/**
 * Created by dxh on 19/10/21.
 * 六爻 64 卦象所对应的卦辞
 */
const GUA_64 = [
    {
        name: "乾为天",
        describe: "凛凛皇者之象　自强不息之意",
        code: [1, 1, 1, 1, 1, 1],
        guaCi: ["为君之道阳刚健，运覆无穷龙御天。","万物始创通且顺，问求有利理当然。"],
    }, {
        name: "坤为地",
        describe: "兼容万物之象　以柔制刚之意",
        code: [0, 0, 0, 0, 0, 0],
        guaCi: ["包容柔顺地坤恩，随伴当如母马奔。", "臣仆寻主须积极，先迷后得莫逡巡。"],
    }, {
        name: "水雷屯",
        describe: "春木更新之象　艰难险阻之意",
        code: [0, 1, 0, 0, 0, 1],
        guaCi: ["萌芽起步最艰难，大路通行得利还。", "万勿轻率求冒进，功成置业自开颜。"],
    }, {
        name: "山水蒙",
        describe: "童蒙启智之象　迷模摸索之意",
        code: [1, 0, 0, 0, 1, 0],
        guaCi: ["启蒙讨教要专诚，一再三多事不成。", "贵在包容无类教，问求得利好前程。"],
    }, {
        name: "水天需",
        describe: "密云不雨之象　待机而动之意",
        code: [0, 1, 0, 1, 1, 1],
        guaCi: ["耐心恒心自信心，安闲等待值千金。", "诚信顺利求者吉，闯险何须惧水深。"],
    }, {
        name: "天水讼",
        describe: "背道而驰之象　无端起讼之意",
        code: [1, 1, 1, 0, 1, 0],
        guaCi: ["天水违行成险地，与人争讼莫逞强。", "知足退让英雄事，争胜虽成终祸殃。"],
    }, {
        name: "地水师",
        describe: "地势临渊之象　以寡服众之意",
        code: [0, 0, 0, 0, 1, 0],
        guaCi: ["用兵须慎莫贪功，争战从来祸害重。", "统帅占求当吉利，或能趋吉又避凶。"],
    }, {
        name: "水地比",
        describe: "众星拱月之象　安逸进取之意",
        code: [0, 1, 0, 0, 0, 0],
        guaCi: ["相依团结勿迟疑，择善占研事可为。", "贞问连连无灾祸，不宁后至反生悲。"],
    }, {
        name: "风天小畜",
        describe: "密云无雨之象　蓄养实力之意",
        code: [1, 1, 0, 1, 1, 1],
        guaCi: ["风急天阴远望西，欲来山雨密云低。", "甘霖将至收成好，积得小财事可为。"],
    }, {
        name: "天泽履",
        describe: "如履虎尾之象　险中求胜之意",
        code: [1, 1, 1, 0, 1, 1],
        guaCi: ["启程举步要留神，量力前行虎尾跟。", "柔悦对刚知应对，方能猛虎不伤人。"],
    }, {
        name: "地天泰",
        describe: "事事通泰之象　上下和睦之意",
        code: [0, 0, 0, 1, 1, 1],
        guaCi: ["茅塞顿开事泰通，阳来阴去运无穷。", "循环往复凭天道，逆势强求反落空。"],
    }, {
        name: "天地否",
        describe: "闭塞不通之象　上下不和之意",
        code: [1, 1, 1, 0, 0, 0],
        guaCi: ["天地不交因阻塞，反常世道乱必生。", "小人得势欺君子，阳去阴来事不成。"],
    }, {
        name: "天火同人",
        describe: "二人同心之象　合作共事之意",
        code: [1, 1, 1, 1, 0, 1],
        guaCi: ["结伴同行大路宽，离火直上九重天。", "最宜君子贞求问，创业功成过险关。"],
    }, {
        name: "火天大有",
        describe: "日丽中天之象　好景不常之意",
        code: [1, 0, 1, 1, 1, 1],
        guaCi: ["阴柔高坐九五尊，伟业当如日中天。", "恶遏善扬天意顺，大吉大利理当然。"],
    }, {
        name: "地山谦",
        describe: "空谷藏玉之象　虚怀处世之意",
        code: [0, 0, 0, 1, 0, 0],
        guaCi: ["山藏地下是虚谦，以退争先利益添。", "终获功成凭策略，好签难得莫疑嫌。"],
    }, {
        name: "雷地豫",
        describe: "雷奋大地之象　事见生机之意",
        code: [0, 0, 1, 0, 0, 0],
        guaCi: ["雷行地奋顺时机，快乐欢愉自伴随。", "大利征行功建业，须防乐极反生悲。"],
    }, {
        name: "泽雷随",
        describe: "乘马逐鹿之象　随遇而安之意",
        code: [0, 1, 1, 0, 0, 1],
        guaCi: ["免灾顺畅泽中雷，大利贞求好事来。", "天黑当回归寝处，循规蹈矩众跟随。"],
    }, {
        name: "山风蛊",
        describe: "物腐虫生之象　不进则退之意",
        code: [1, 0, 0, 1, 1, 0],
        guaCi: ["从来安逸腐虫生，拨乱革新道路亨。", "三思而行三总结，勇往犯险定功成。"],
    }, {
        name: "地泽临",
        describe: "少女从母之象　循序渐进之意",
        code: [0, 0, 0, 0, 1, 1],
        guaCi: ["居高临下势如虹，领导有方事事通。", "教思无穷君得利，阳衰八月有险凶。"],
    }, {
        name: "风地观",
        describe: "风扬尘埃之象　观察入微之意",
        code: [1, 1, 0, 0, 0, 0],
        guaCi: ["祭祀虔诚先净手，尊崇仰慕肃温恭。", "瞻观恰似风行地，彻悟得来感化中。"],
    }, {
        name: "火雷噬嗑",
        describe: "喉中有物之象　夫妻怨怒之意",
        code: [1, 0, 1, 0, 0, 1],
        guaCi: ["咬除障碍道亨通，治狱从来靠证供。", "明察恩威雷交电，量刑法治古今同。"],
    }, {
        name: "山火贲",
        describe: "争妍斗丽之象　粉饰庄扮之意",
        code: [1, 0, 0, 1, 0, 1],
        guaCi: ["火向山行烈焰熊，门庭璀璨业昌隆。", "文明装饰知方寸，积极前行小建功。"],
    }, {
        name: "山地剥",
        describe: "群阴剥阳之象　去旧生新之意",
        code: [1, 0, 0, 0, 0, 0],
        guaCi: ["阴盛阳衰要顺从，高山渐塌地台中。", "小人得势层层进，保守韬光莫争锋。"],
    }, {
        name: "地雷复",
        describe: "万物更新之象　重修破旧之意",
        code: [0, 0, 0, 0, 0, 1],
        guaCi: ["盛阴过后一阳生，雷在地中始复萌。", "出入朋来无阻滞，循环往复七天成。"],
    }, {
        name: "天雷无妄",
        describe: "石中蕴玉之象　守旧安常之意",
        code: [1, 1, 1, 0, 0, 1],
        guaCi: ["雷行天下顺当然，望外福临好事连。", "遇事无须强争进，成功要紧是心虔。"],
    }, {
        name: "山天大畜",
        describe: "浅水行舟之象　积小成大之意",
        code: [1, 0, 0, 1, 1, 1],
        guaCi: ["山高天阔六畜兴，最利贞人问止停。", "莫恋家园温饱暖，出门勇闯事必成。"],
    }, {
        name: "山雷颐",
        describe: "匣中藏剑之象　审慎交往之意",
        code: [1, 0, 0, 0, 0, 1],
        guaCi: ["人生百事食为基，细看朵颐福自知。", "自力更生谋给养，问占得利待来时。"],
    }, {
        name: "泽风大过",
        describe: "枯木生花之象　反省过失之意",
        code: [0, 1, 1, 1, 1, 0],
        guaCi: ["阳刚过度不寻常，枯木花开水泽床。", "长就栋材堪受压，自强积极定吉祥。"],
    }, {
        name: "坎为水",
        describe: "重重险陷之象　向下内敛之意",
        code: [0, 1, 0, 0, 1, 0],
        guaCi: ["重重险阻大江横，欲破危艰靠信诚。", "苦困炼磨人健毅，行为高尚事方成。"],
    }, {
        name: "离为火",
        describe: "丽日当天之象　光明远大之意",
        code: [1, 0, 1, 1, 0, 1],
        guaCi: ["光明无限是朝暾，最利贞求事事欣。", "常道畜牛须择母，乐天知命唱黄昏。"],
    }, {
        name: "泽山咸",
        describe: "山泽通气之象　往来无阻之意",
        code: [0, 1, 1, 1, 0, 0],
        guaCi: ["天交地感道天然，心有灵犀一线连。", "山上泽临贞者利，问求娶妇喜良缘。"],
    }, {
        name: "雷风恒",
        describe: "相对并行之象　努力不懈之意",
        code: [0, 0, 1, 1, 1, 0],
        guaCi: ["有恒坚定自亨通，妇随夫唱德永同。", "问者无恙贞得利，前行进取事昌隆。"],
    }, {
        name: "天山遁",
        describe: "守旧去恶之象　掘井无泉之意",
        code: [1, 1, 1, 1, 0, 0],
        guaCi: ["三十六计走为上，君子必须远小人。", "凡事忍隐多退避，问求小利亦欣欣。"],
    }, {
        name: "雷天大壮",
        describe: "猛处生角之象　声威大壮之意",
        code: [0, 0, 1, 1, 1, 1],
        guaCi: ["雷行天上响隆隆，最利占求待建功。", "君子无为能得利，贪羊莫学困篱中。"],
    }, {
        name: "火地晋",
        describe: "满地锦绣之象　良臣遇君之意",
        code: [1, 0, 1, 0, 0, 0],
        guaCi: ["晋封当似日初升，赏赐良驹意自明。", "天子一天三接见，顺柔奉上作公卿。"],
    }, {
        name: "地火明夷",
        describe: "凤凰垂翼之象　弃明投暗之意",
        code: [0, 0, 0, 1, 0, 1],
        guaCi: ["最是伤情日落山，重重险困势难安。", "须效箕子佯疯避，若问艰危可过关。"],
    }, {
        name: "风火家人",
        describe: "入海求珠之象　开花结果之意",
        code: [1, 1, 0, 1, 0, 1],
        guaCi: ["家庭伦理贵谐和，主妇柔谦福自多。", "内正家齐能外顺，问求女事乐欣欣。"],
    }, {
        name: "火泽睽",
        describe: "二女同居之象　阴阳失调之意",
        code: [1, 0, 1, 0, 1, 1],
        guaCi: ["火升水降两相违，离背只能小事为。", "异可求同同存异，顺应时势莫狐疑。"],
    }, {
        name: "水山蹇",
        describe: "门前有陷之象　背明向暗之意",
        code: [0, 1, 0, 1, 0, 0],
        guaCi: ["山高水急路难探，莫向东北利西南。", "得遇贵人能相助，贞者大吉渡龙潭。"],
    }, {
        name: "雷水解",
        describe: "草木舒展之象　遇困可解之意",
        code: [0, 0, 1, 0, 1, 0],
        guaCi: ["除危解困利西南，雷雨交加势非凡。", "侠义去来真君子，前行主动福添增。"],
    }, {
        name: "山泽损",
        describe: "山高水深之象　以德报怨之意",
        code: [1, 0, 0, 0, 1, 1],
        guaCi: ["挖泽堆山山益增，虔诚能改损为盈。", "问求无碍应积极，祭祀何须奉厚牲。"],
    }, {
        name: "风雷益",
        describe: "风雷交错之象　损上益下之意",
        code: [1, 1, 0, 0, 0, 1],
        guaCi: ["风雷激荡益增添，积极前行好运生。", "冒险功成创大业，逢凶化吉不须惊。"],
    }, {
        name: "泽天夬",
        describe: "蛟龙登天之象　亏中有益之意",
        code: [0, 1, 1, 1, 1, 1],
        guaCi: ["宣不当庭刚断柔，虔诚呼号有危忧。", "告知从众迟兴武，进取功成自可求。"],
    }, {
        name: "天风姤",
        describe: "风云际会之象　聚散随缘之意",
        code: [1, 1, 1, 1, 1, 0],
        guaCi: ["风生天下任高低，妇悍岂宜娶作妻。", "把握时机凭邂逅，小人防范莫轻随。"],
    }, {
        name: "泽地萃",
        describe: "鲤登龙门之象　精英荟萃之意",
        code: [0, 1, 1, 0, 0, 0],
        guaCi: ["聚水成潭万事亨，君王得势庙登临。", "勇往进取求者利，厚牲祭祀遇贵人。"],
    }, {
        name: "地风升",
        describe: "积小成大之象　拼搏得益之意",
        code: [0, 0, 0, 1, 1, 0],
        guaCi: ["地中生木步高升，得遇贵人莫怕惊。", "事事皆由吉相伴，信诚合力利南征。"],
    }, {
        name: "泽水困",
        describe: "河中无水之象　守正待机之意",
        code: [0, 1, 1, 0, 1, 0],
        guaCi: ["困扰迫人须隐忍，空言无信反蹉跎。", "求人之问当得遇，顺利无灾福自多。"],
    }, {
        name: "水风井",
        describe: "珠藏深渊之象　井井有条之意",
        code: [0, 1, 0, 1, 1, 0],
        guaCi: ["村邑变时井不迁，时光流逝井依然。", "汲瓶取水瓶先破，劳却无功恶运连。"],
    }, {
        name: "泽火革",
        describe: "豹变为虎之象　改旧纳新之意",
        code: [0, 1, 1, 1, 0, 1],
        guaCi: ["泽火难容须变革，维新指日可完成。", "前程通顺贞求利，悔恨将除局朗明。"],
    }, {
        name: "火风鼎",
        describe: "鼎器烹调之象　去故取新之意",
        code: [1, 0, 1, 1, 1, 0],
        guaCi: ["钟鸣鼎食帝王乡，留待英才展所长。", "除旧布新知善用，同心改革大吉祥。"],
    }, {
        name: "震为雷",
        describe: "雷惊百里之象　惊恐不屈之意",
        code: [0, 0, 1, 0, 0, 1],
        guaCi: ["霹雳震雷事事通，来时惊恐去欢容。", "震惊百里何足论，把酒开怀笑大风。"],
    }, {
        name: "艮为山",
        describe: "重山关锁之象　步步为营之意",
        code: [1, 0, 0, 1, 0, 0],
        guaCi: ["慎行知止稳如山，背定身停动亦难。", "心静如临清静地，适时而止免危艰。"],
    }, {
        name: "风山渐",
        describe: "草木渐茂之象　积小成多之意",
        code: [1, 1, 0, 1, 0, 0],
        guaCi: ["山中木长渐成材，千里归鸿步岸回。", "嫁女渐行吉大利，问求定得笑颜开。"],
    }, {
        name: "雷泽归妹",
        describe: "少女追男之象　错失端正之意",
        code: [0, 0, 1, 0, 1, 1],
        guaCi: ["婚嫁偏逢泽上雷，势如水火两相违。", "前途凶险终无利，速速停行莫迟疑。"],
    }, {
        name: "雷火丰",
        describe: "光明普照之象　弃暗投明之意",
        code: [0, 0, 1, 1, 0, 1],
        guaCi: ["天地人间万物丰，为王庆誉日方中。", "阳光莫让帘遮隔，世事无忧路自通。"],
    }, {
        name: "火山旅",
        describe: "鸟焚其巢之象　乐极生悲之意",
        code: [1, 0, 1, 1, 0, 0],
        guaCi: ["旅程恰似火烧山，颠沛流离自等闲。", "并济刚柔休倨傲，问求行旅凯歌还。"],
    }, {
        name: "巽为风",
        describe: "飓风覆船之象　上行下效之意",
        code: [1, 1, 0, 1, 1, 0],
        guaCi: ["听命顺从是巽风，无孔不入小亨通。", "前行进取加谦逊，助运贵人自可逢。"],
    }, {
        name: "兑为泽",
        describe: "天降雨泽之象　有誉有讥之意",
        code: [0, 1, 1, 0, 1, 1],
        guaCi: ["金水滔滔起夺争，信诚和悦可通亨。", "须防暗抢加强夺，谨慎能求小利生。"],
    }, {
        name: "风水涣",
        describe: "顺风扬帆之象　随波逐流之意",
        code: [1, 1, 0, 0, 1, 0],
        guaCi: ["风行水上波涣散，得势君王坐庙坛。", "冒险功成当创业，问求得利挽狂澜。"],
    }, {
        name: "水泽节",
        describe: "蓄水成塘之象　勤检克己之意",
        code: [0, 1, 0, 0, 1, 1],
        guaCi: ["水入泽中须节制，恰如其分自畅通。", "过度苦节终无益，执意强求事反凶。"],
    }, {
        name: "风泽中孚",
        describe: "鹤鸣子和之象　以诚待人之意",
        code: [1, 1, 0, 0, 1, 1],
        guaCi: ["心诚祭祀自然灵，有肉有鱼吉运行。", "冒险功成创大业，问求得利喜盈盈。"],
    }, {
        name: "雷山小过",
        describe: "飞鸟遗音之象　阳奉阴违之意",
        code: [0, 0, 1, 1, 0, 0],
        guaCi: ["浅尝辄止笑怀开，小事可成大事推。", "飞鸟归巢休鹜远，吉祥得利定相随。"],
    }, {
        name: "水火既济",
        describe: "阴阳和谐之象　上下相通之意",
        code: [0, 1, 0, 1, 0, 1],
        guaCi: ["功成既济事亨通，奋发依然莫放松。", "小利能求须谨慎，惟恐初吉变乱终。"],
    }, {
        name: "火水未济",
        describe: "阴阳失调之象　上下不通之意",
        code: [1, 0, 1, 0, 1, 0],
        guaCi: ["穷出变思事可通，小狐济渡正匆匆。", "只怜到岸濡沾尾，成败须期努力中。"],
    }
];

const getGuaByCode = (code) => {
    if (code.length < 6) {
        return null;
    }
    for (let i = 0; i < GUA_64.length; i++) {
        if (GUA_64[i].code.toString() === code.toString()) {
            return GUA_64[i];
        }
    }
    return null;
};

const getGuaByName = (name) => {
    if (name.length <= 0) {
        return null;
    }
    for (let i = 0; i < GUA_64.length; i++) {
        if (GUA_64[i].name === name) {
            return GUA_64[i];
        }
    }
    return null;
};

