/**
 * Created by dxh on 19/10/21.
 * 六爻 64 卦象所对应的卦辞
 */
const guaCiJieYiMoreData = [
   {
    zhuguaName: "乾为天",
    hanyi: "乾卦由六阳爻构成，为《易经》六十四卦之首。乾代表天，象征着天道运行，周而复始，覆盖万物无偏无私，万物由此生机勃勃，刚健不息。内外卦皆为乾，代表了无限的能量，如果以此天象来比喻人的作为，则表示此人拥有十足的信心与无限的动能，行为上积极主动并且自身实力很强。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "乾卦是比较吉祥如意的一个卦，得到乾卦之后婚恋都容易成功。但成功不是凭空等来的，它需要当事人勇敢去追求。在婚姻生活中，要相互理解包容，避免过于强势，否则会走向相反的一面。",
          info: "1、乾卦占恋情\n" +
            "比较吉利！ 恋情可以成功，但双方都不要太强势，要互相体谅，否则就会乐极生悲。一般来说，得到乾卦的人恋情都可以成功，在追求的过程中要大度、自信，用自己自强不息的精神打动对方。\n" +
            "\n" +
            "2、乾卦占婚姻运势\n" +
            "总体吉祥如意！但婚后的相处过程比较难，需要双方都有容人之量，在家庭生活中，要发扬民主精神，使夫妻双方具有平等的地位。" 
        },
        caiyun: {
          jixiong: "吉",
          title: "乾卦为比较吉利的一个卦，占得乾卦说明财运亨通。只要抓住机遇，努力打拼，就会获得成功。但要注意不可得意忘形，做事要小心谨慎，以防破财漏财。",
          info: "1、乾卦占财运\n" +
            "吉。财运大旺，获利十分丰厚。但要防止因意想不到的小事耗财。\n" +
            "\n" +
            "2、乾卦占生意开张\n" +
            "吉。此时开张大吉，会有一个好的开始，象征着以后的生意红红火火。但要注意为人不可过于傲慢，万事以和为贵，谨记和气生财。\n" +
          "\n" +
              "3、乾卦占买卖交易\n" +
            "吉。交易顺利，且有利可图，但要注意不可得意忘形，以免招致失败，要注意人际关系的和谐。\n" +
          "\n" +
              "4、乾卦占股市期货\n" +
            "吉。股市上涨，但如果涨得太高的话，也不见得是什么好事。所以要见好就收。"
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "得到乾卦的人事业发展都会比较顺利，可以说是如曰中天，甚至能够达到名利双收的效果，但是全盛之时经常也是衰败之始，所以要小心谨慎，以免乐极生悲。",
          info: "1、乾卦占事业\n" +
            "平。你的努力加上自身的实力，让你的事业如日中天。但在形势一片大好的时候，也不要得意忘形，要注意周围人际关系的和谐，以礼待人，虚心行事，否则就会乐极生悲。\n" +
            "\n" +
            "2、乾卦占工作变动\n" +
            "平。想要变动工作的人士，建议还是要慎重一些，暂时保持现状为好。\n" 
        },
        zinv: {
          jixiong: "吉",
          title: "乾卦占子女",
          info: "乾卦占子女为健康聪明，活泼可爱。胎孕方面，宜小心保养，多生男孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "乾卦说明现在你已经信心十足，自身实力很强，作为一位学生，你已经很优秀了，成绩名列前茅。但切忌骄纵傲慢，以免盛极转衰.",
          info: "1、乾卦占考试\n" +
            "吉。由于你的努力，你的成绩很不错，照此下去可以金榜题名，但不要有了不错的成绩就骄傲自满，否则仍会失败。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "乾卦占求职",
          info: "在求职之路上会比较顺利，得贵人相助，会找到比较理想的工作，如果能担任公职，会大有作为。"
        },
        guansi: {
          jixiong: "吉",
          title: "乾卦占官司诉讼",
          info: "代表自己一方有理，应该据理力争,官司剑拔弩张，会较为迅速地判决。"
        },
        jibing: {
          jixiong: "半吉",
          title: "乾卦占疾病",
          info: "如果你是最近得的病，那么很快就能好转；如果这个病已经有几个月了，那么有加重的可能，容易有心发热、口干舌燥或毒疮的症状，疾病会在白天加重，宜多加注意，生病多为头脑、神经之病，应细心调养。若变卦有解仍为吉。"
        },
        shiwu: {
          jixiong: "吉",
          title: "乾卦占失物",
          info: "失物有望找。"
        },
        gupiao: {
          jixiong: "吉",
          title: "乾卦占股票期货",
          info: "天位，易高位拉升，注意及时卖出止盈。"

        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "乾卦占出行",
          info: "路上或为行李所累或因风雨而阻，宜结伴行,不宜独行。"
        },
        xiaoxi: {},
        qita: {}

      }

  },
  {
    zhuguaName: "坤为地",
    hanyi: "坤卦，即坤为地卦。该卦内卦和外卦均为坤，是大地的象征。大地承载万物，以宽大的胸怀包容所有生物。正是因为如此，万物才能生生不息地生长、繁衍。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "坤卦告诉我们，婚姻爱情方面要具有最广大的包容性。耐心是爱情马拉松中必不可少的动力，没有耐心的人往往会中途退出，走不到幸福的终点。此外，包容对方的不足之处也是很重要的。",
          info: "1、坤卦占恋情\n" +
            "比较吉利。这是一场持久的恋情，需要足够的耐性。对于恋爱中发生的矛盾，只要不是原则性的问题，就尽量忍，用包容之心协调好与对方的关系。\n" +
            "\n" +
            "2、坤卦占婚姻运势\n" +
            "比较吉利。建立家庭之后，夫唱妇随的情况很容易成为现实，所以家庭比较幸福美满。" 
        },
        caiyun: {
          jixiong: "半吉半凶",
          title: "坤卦告诉我们，顺应形势的变化，与人积极合作，守正而行，最终就能获利。面对不好的局势不要贸然投资，现在不是积极主动的时候，要静待时机，财运会自己找上门来的。此外，多与女性接触，有助于提升运势。",
          info: "1、坤卦占财运\n" +
            "平。平时应注重钱财的积蓄，凡事都事前做好规划。\n" +
            "\n" +
			 "2、坤卦占生意开张\n" +
            "平。时机还没有成熟，不能仓促决定开张之事。\n" +
            "\n" +
			 "3、坤卦占股市期货\n" +
            "吉。股市下跌，此时适合买进，中长期投资会获得可观的收入。\n" +
            "\n" +
			  "4、坤卦占买卖交易\n" +
            "平。不可急于求成，耐心等待为佳。\n" 
        },
        shiye: {
          jixiong: "吉",
          title: "坤卦启示人们，首先要安于现状，甘心当配角。但并不意味着什么都不做，此时正是增强自身实力，充实自己的好时机，待外在局势对自己有利时，就可一展身手了。寓意做人应有宽容的心，做事不要太计较得失，应有平静达观的心态；要先取守势，做事前要先做好充足的准备。",
          info:  "1、坤卦占事业\n" +
            "比较吉利。你的事业发展不是一帆风顺的，但是不要太着急，也不要灰心，随形势自然发展，好的机会自然会到来的。如果这时强出头，反而会招致不顺。\n" +
            "\n" +
			 "2、坤卦占工作变动\n" +
            "平。想要变动工作的人士，建议静待一段时间，现在还不是变动的时候。\n" 
        },
        zinv: {
          jixiong: "吉",
          title: "坤卦占子女",
          info: "而且孩子十分听话，易于管教。胎孕方面，生产无惊阻，比较平安顺利，多生女孩。"
        },
        xueye: {
          jixiong: "半吉半凶",
          title: "坤卦占考运求职",
          info: "你的考试成绩暂时居于中上，处于上榜的边缘，所以还需要再加把劲，成绩会越来越好的。"
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "坤卦占考运求职",
          info: "你还需要等待时机，现在还无法马上找到满意的工作，不要气馁，继续等待，好工作会自己出现的。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "坤卦占官司诉讼",
          info: "你方气盛，压制对方；这次诉讼，牵连证人比较多，耗费比较大；官司有救，适于和解。"
        },
        jibing: {
          jixiong: "半吉半凶",
          title: "坤卦占疾病",
          info: "病是内症，易晚上加重。容易有感冒风寒、四肢不协、头疼发热、口渴瘫痪、口眼歪斜的症状发生。防腹痛或腹泻。如果你是最近得的病，那么很快就能好转；如果这个病已经有几个月了，那么有加重的可能。"
        },
        shiwu: {
          jixiong: "凶",
          title: "坤卦占失物",
          info: "难以寻回，大部份均不知下落。"
        },
        gupiao: {
          jixiong: "吉",
          title: "坤卦占股市期货",
          info: "股市下跌，此时适合买进，中长期投资会获得可观的收入。不可急于求成，耐心等待为佳。"
        },
        jiazai: {},
        chuxing: {},
        xiaoxi: {},
        qita: {}
      }


  },
  {
    zhuguaName: "水雷屯",
    hanyi: "水雷屯卦代表刚生长的小草，脆弱，容易受伤，凡事都会遇到困难的意思，主凶卦。象征凡事需要等待时机，暂时需要没有机会，等待机会的意思。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "屯卦为四大难卦之一，屯卦表示恋爱和婚姻都不是一个人的事情，它们需要的是两个人的缘分。当两个人没有缘分时，强求不得，应该及时放手。强扭的瓜不甜，不知道及时放手就会带来不想看到的后果。",
          info:"1、屯卦占恋情\n" +
            "凶 。 两个人很难将恋情维持下去，即使可以勉强维持，也是磕磕绊绊，充满了不顺利。究其主因，是两个人不合适，无论不合适的原因是什么，这段恋情很难修成正果。\n" +
            "\n" +
            "2、屯卦占婚姻\n" +
            "凶 。  首先，两个人很难走入婚姻的殿堂；其次，即使结了婚，生活也不会幸福。\n"
        },
        caiyun: {
          jixiong: "凶",
          title: "屯卦为四大难卦之一，属于万事开头难的类型，事情刚刚开始或是正处于规划阶段，困难重重，诸事不顺，财运当然也不好，这时投资一定要小心谨慎，细心观察局势。",
          info: "1、屯卦占财运\n" +
            "凶。诸事不顺，阻扰众多，个人财运没有起色，唯有努力打拼，才能避免陷入穷困的境地。\n" +
			  "\n" +
			  "2、屯卦占生意开张\n" +
            "凶。时机不成熟，各方面条件不具备，不宜开张，否则会使自己陷入困境。\n" +
			  "\n" +
			  "3、屯卦占股市期货\n" +
            "凶。市场不景气，时机不成熟，投资之事一定要慎重而行。\n" +
			  "\n" +
			  "4、屯卦占买卖交易\n" +
            "凶。买卖双方没有诚意，再加上其他一些外在的阻扰，使得交易难成。\n" 
        },
        shiye: {
          jixiong: "凶",
          title: "水雷屯卦是四大难卦之一，得到屯卦就意味着事业发展很不顺利，困难重重。自身能力的不足加上过于急躁，使得局面很棘手,但不要太灰心，逆境之中，也是锻炼毅力、耐心的最好机会。",
          info: "1、屯卦占事业\n" +
            "凶。你的事业现状就如同创业之初或人生的起步阶段，一切还处在规划阶段，波折多，困难大，诸事不顺。这时需要意志坚定，只要撑过困难时期，一切会好起来的。\n" +
			  "\n" +
			  "2、屯卦占工作变动\n" +
            "凶。对于想要变动工作的人士来说，现在绝不是个好时机，还需要等待一段时间。\n" 
        },
        zinv: {
          jixiong: "吉",
          title: "屯卦占子女",
          info: " 孩子宜在能得到一定锻炼的家庭环境中成长。 胎孕方面，产母有虚惊，但可无虑，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "屯卦在学业上会很不顺利，除了自身状态下滑，临场发挥不好，还有本身实力就欠佳。",
          info: "凶。你的学业考试结果不佳，因为自身的水平有限，临场发挥也不好，所以需要加倍努力了。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "在工作事业方面，屯卦告诉我们，万事开头难，自身实力的不足还有外在环境的恶劣，使得工作面临着很多困难，但不要太灰心，逆境之中，也是锻炼毅力、耐心的最机会。",
          info: "凶。求职不顺利，有种才能无法施展的感觉，这主要受外在形势改变的影响。切记不要急躁，静待时机，同时也要注意不断充实自己，提高自身的能力。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "屯卦测官司诉讼",
          info: "你方气盛，压制对方；官司可能会经历两处反复后结案；官司有救，适于和解；须防日后纠纷再起。。"

        },
        jibing: {
          jixiong: "凶",
          title: "屯卦测疾病",
          info: "容易有脾胃不调、虚黄浮肿、瘟疫毒症等症状发生；病情易两处，内伤外感；③病在胸部，饱闷不宽；茶饭不思，或者食欲不佳。"
        },
        shiwu: {
          jixiong: "凶",
          title: "屯卦测失物",
          info: "难以寻回。"
        },
        gupiao: {
          jixiong: "凶",
          title: "屯卦测股票期货",
          info: "进退不果，两难。注意眼下不要贸然投资，以防血本无归。市场不景气，时机不成熟，投资之事一定要慎重而行。"
        },
        jiazai: {},
        chuxing: {},
        xiaoxi: {},
        qita: {}

      }

  },
  {
    zhuguaName: "山水蒙",
    hanyi: "此卦代表模糊，不清晰，朦胧不明。人与事情不明确，凡事需谨慎。得此卦是非难辨，迷失方向。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "如果得到了山水蒙卦，说明两个人的缘分不足。正如俗话所说，流水虽有意，落花却无情。恋爱和婚姻必须是两个人互相愿意才行，只有单方面的热情是不够的。",
          info: "1、蒙卦占恋情\n" +
            "不太顺利。对方对你可能没有足够的兴趣，这时应该主动退出，因为这样维持下去对两个人都没有好处，尤其对“落花有意”的一方更为不利，只能增添痛苦。\n" +
            "\n" +
            "2、蒙卦占婚姻运势\n" +
            "不吉利。单相思一场，求婚也不顺利，因为对方可能根本没有看得上你，考虑一下是不是你的眼光或标准是不是太高了，如果不是的话，果断放弃也是不错的选择。\n" 
        },
        caiyun: {
          jixiong: "凶",
          title: "蒙卦表示人生经验和智慧不足，表现在财运上就是，缺乏投资、理财的专业知识或者经验。往往看不清楚局势的真正走向，不能作出正确的决断。所以，要想财运上更加顺畅，就要多学习，不断提高自己在这方面的能力。",
          info: "1、蒙卦占财运\n" +
            "凶。现在财运不佳，要多学习知识，积累知识，将来才能赚到更多的钱。\n" +
            "\n" +
			 "2、蒙卦占生意开张\n" +
            "凶。不宜开张，应通过各种渠道，全面了解市场信息，然后再决定开张之事。\n" +
            "\n" +
			  "3、蒙卦占股市期货\n" +
            "凶。股市一直保持下跌状态，前景并不乐观。最好多了解一些投资理财方面的相关知识。\n" +
            "\n" +
			  "4、蒙卦占买卖交易\n" +
            "凶。自身实力不足，交易难以达成。\n"
        },
        shiye: {
          jixiong: "凶",
          title: "山水蒙卦显示，此时正处于混沌阶段。因为自身的经验不足，判断力差，无法对事情作出正确的选择判断，所以导致事业、工作上遇到挫折、失败。必须虚心学习，培养奋发图强精神。务必脚踏实地，最忌好高骛远，否则会陷入孤立无援的境地。",
          info: "1、蒙卦占事业\n" +
            "凶。你的事业目前处于混沌状态，停滞不前。这主要是因为经验不足，努力不够，所以导致决策失误。\n" +
            "\n" +
			 "2、蒙卦占工作变动\n" +
            "凶。如果想变动工作，建议要耐心等待一段时间，现在还不是时候。\n" 
        },
        zinv: {
          jixiong: "吉",
          title: "蒙卦占子女",
          info: " 孩子或者非常聪明，或比较平庸。 胎孕方面，胎孕无碍,易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "山水蒙卦，外卦为山，代表阻碍；内卦为水，代表陷落，困难重重。内外皆受困，象征着智慧未开启，需要受到启蒙及教育。就像是弱小无知的孩子，在未受到教育之前，是懵懂无知的，如果能传授给他知识，就能使他得到提升，思想变得丰富。此卦说明，一个人的人生经验和智慧不足，就需要有人来指导启蒙，以使其获得更多的知识和咨询，因此我们应多向智者请教、学习。",
          info: "你的考试成绩不佳，一方面是因为自信过度，所以掉以轻心；另一方面是因为学习方法不对，所以进步较慢。所以现在你要做的就是改变态度，改变学习方法了。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "山水蒙卦，外卦为山，代表阻碍；内卦为水，代表陷落，困难重重。内外皆受困，象征着智慧未开启，需要受到启蒙及教育。就像是弱小无知的孩子，在未受到教育之前，是懵懂无知的，如果能传授给他知识，就能使他得到提升，思想变得丰富。此卦说明，一个人的人生经验和智慧不足，就需要有人来指导启蒙，以使其获得更多的知识和咨询，因此我们应多向智者请教、学习。",
          info: "求职不顺利，暂时找不到满意的工作，需要静心等待，同时提升自己的专业知识。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "蒙卦占官司诉讼",
          info: "这次诉讼，牵连证人比较多，耗费比较大；人证物证易不利于你；官司有救，适于和解。"
        },
        jibing: {
          jixiong: "凶",
          title: "蒙卦占疾病",
          info: "容易有后腰与泌尿、风寒酸痛、四肢不适的症状发生；视力血管，心脏病症；疾病会在白天加重，宜多加注意；茶饭不思或者食欲不振症状。"
        },
        shiwu: {
          jixiong: "半吉半凶",
          title: "蒙卦占失物",
          info: "遍寻不获。似乎遗失在某处，忘记带走，可试试问下周边的人。"
        },
        gupiao: {
          jixiong: "凶",
          title: "蒙卦占股市期货",
          info: "涨跌不定，市场朦胧，认真思考，研判走势。前景并不乐观。最好多了解一些投资理财方面的相关知识。"
        },
        jiazai: {},
        chuxing: {},
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "水天需",
    hanyi: "需的上卦为坎，代表云；下卦为乾，代表天。云浮聚于天上，待时降雨是需卦的卦象。水天需卦为小凶，得此卦者，时机尚未成熟，需要耐心等待，急进反会见凶。需，代表需要、需求，但却又是时机未到。此卦凶中带吉，需耐心等待，则事情可成。健康方面，要特别注意。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "需卦告诉人们，两个人从相识到相爱，再到结婚，像海水形成白云再形成雨的变化一样，是一个漫长的过程,两人相处时间一长，可能就会失去耐心。这是恋爱中的大敌，必须要克服。",
          info: "1、需卦占恋情\n" +
            "吉，这段恋情基本上可以非常美满，关键是两个人要有耐心和恒心把这条漫长的“马拉松”跑完。道路并不难走，只是比较漫长。只要中途不放弃，就一定能有一个美好的结局。\n" +
            "\n" +
            "2、需卦占婚姻运势\n" +
            "吉，婚事多半是等来的，结婚之后的生活可以长久维持，只不过日子会显得比较平淡，没有恋爱时那么多激情，但这也是一个很理想的状态。\n"
        },
        caiyun: {
          jixiong: "半吉半凶",
          title: "需卦卦辞启示我们，现在时机还没有成熟，因此，需要耐心等待时机，不可急于求成，轻举妄动。如果无法冷静沉着，贸然进行交易，就会有破财的风险。",
          info: "1、需卦占财运\n" +
            "平。最初的时候，财运不济，但只要在等待时机中，慢慢努力，就一定能迎来转机，达成自己的愿望。\n" +
            "\n" +
			  "2、需卦占生意开张\n" +
            "平。现在不适宜开张，最好先等待一段时间再决定开张之事。\n" +
            "\n" +
			  "3、需卦占股市期货\n" +
            "平。股市行情不乐观，较长一段时间都会保持下跌之势。\n" +
            "\n" +
			  "4、需卦占买卖交易\n" +
            "平。表面看上去有利可图，但实际上无法获利，最好等时机好转后再将货物出手。\n" 
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "每个人都希望自己心中的目标能够实现，但有时候不是自身的实力不够，而是时机未到。你的事业发展遇到了障碍，不要急于行动，成功总是需要漫长的等待。",
          info: "1、需卦占事业\n" +
            "平。你的工作进展不大，不是你不够努力，也不是你的能力不强，实在是外来条件不好，但不要垂头丧气，未来不是没有机会，现在不要操之过急，慢慢等待，好运会降临的。\n" +
            "\n" +
			  "2、需卦占工作变动\n" +
            "平。想要变动工作的朋友，建议要三思而行，现在还不是变动的好时机。\n" 
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "需卦占子女",
          info: "占得需卦得子迟。 胎孕方面，临产之时才占卜，代表会有障碍。防克产母。易生男孩。"
        },
        xueye: {
          jixiong: "半吉半凶",
          title: "水天需卦，外卦为水，代表凶险，内卦为天，代表积极奋发，此卦就好像是水蒸气升到天上变为了云，云量积少成多，似乎要下大雨，但让人着急的是雨久久不下。",
          info: "你最近的考运差了些，虽然自己很努力，确实实力也不弱，但考试状态不是很好，不要着急，慢慢调整好，相信下一次你会取得理想的成绩。"
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "水天需卦，外卦为水，代表凶险，内卦为天，代表积极奋发，此卦就好像是水蒸气升到天上变为了云，云量积少成多，似乎要下大雨，但让人着急的是雨久久不下。",
          info: "现在可能还不是求职的最佳时机，即使可以找到一份工作，也不能令你满意，所以还是耐心寻找吧，你会找到称心的工作的。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "需卦占官司诉讼",
          info: "这次诉讼，牵连证人比较多，耗费比较大；卦象看对方有理；需要防证人证据不利于你；官司有救，适于和解。"
        },
        jibing: {
          jixiong: "半吉半凶",
          title: "需卦占疾病",
          info: "容易有感冒风寒、四肢不协、头疼发热、口渴瘫痪、口眼歪斜的症状发生；防腹痛或腹泻。防晚上病重；疾病会导致吐泻的症状发生，宜多加留意。"
        },
        shiwu: {
          jixiong: "半吉半凶",
          title: "需卦占失物",
          info: "即时不能寻回，需经过一段时间有可能会出现。"
        },
        gupiao: {
          jixiong: "半吉半凶",
          title: "需卦占股市期货",
          info: "股市行情不乐观，较长一段时间都会保持下跌之势。表面看上去有利可图，但实际上无法获利，最好等时机"
        },
        jiazai: {},
        chuxing: {},
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "天水讼",
    hanyi: "讼卦代表诉讼，争执，为凶卦。遇到事情最好通过法律途径解决，也代表官非口舌。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "天水讼卦的外卦为乾,代表天；内卦为坎，代表水。天的“气场”比较强,是刚健有力的象征；水的“气场”却比较弱，是柔弱无力的象征。天和水遇到一起，不易融洽地相处。",
          info: "1、讼卦占恋情\n" +
            "凶。意味着恋人之间口角或矛盾比较多。两个人平时容易口角不断，一不小心就会演变为严重的争吵。如果两个人都不妥协退让，恋情就很难“修成正果”。\n" +
            "\n" +
            "2、讼卦占婚姻运势\n" +
            "不太顺利，甚至有点凶险。即使婚姻已成，但如果不注意维护双方的关系，就不会有多么幸福。夫妻双方有时会吵架，把平静的生活搅乱甚至婚姻破裂。\n"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。讼卦告诉我们，此时为多事之秋，要谨慎行事，平时待人处事时，要小心谨慎，以免与人发生冲突而影响自己的财运。",
          info: "1、讼卦占财运\n" +
            "凶。财运不佳，有人会从中制造障碍，较易与人发生争讼，并会因此而破财。\n" +
            "\n" +  
		  "2、讼卦占生意开张\n" +
            "凶。开张之事会遭到他人的阻扰，并可能会引发是非争斗。因此，此时不宜开张。\n" +
			"\n" +
            "3、讼卦占买卖交易\n" +
            "凶。买卖双方存在意见上的分歧，容易发生冲突和争吵，买卖也因此而难以实现。"
        },
        shiye: {
          jixiong: "凶",
          title: "讼卦预示着事业、工作中多是非口舌，易与生意伙伴、同事发生争执，争执就会结怨，伤人伤己，还是把精力放在重要的事情上，避免因为精力分散而耽误大事，带来不必要的损失。",
          info: "1、讼卦占事业\n" +
            "凶。目前对你来说是个多事之秋，工作不顺利，身心疲惫，还容易与人发生争执。注意放松自己的心情，争执只会两败俱伤，还容易招致小人，到最后得不偿失。\n" +
            "\n" +  
		  "2、讼卦占工作变动\n" +
            "凶。现在不是变动工作的好时机，需要待机而动。\n" 
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "讼卦占子女",
          info: "孩子语言能力比较强。 胎孕方面，注意防范意外而动胎气，生产无惊阻，比较平安顺利，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "讼卦占考运",
          info: "考试成绩不佳，因为生活中的一些是非或麻烦影响了你的心情和考试状态，所以考试成绩不是很理想，注意调整好自己的状态，现在的首要任务毕竟是学习，不要因为一些无谓的事影响了学业。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "讼卦占求职",
          info: "不顺利，在应试过程中容易与人发生一些不愉快的事，要学会控制自己的情绪，以礼待人，免除一些是非，这样找工作会更顺利。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "讼卦占官司诉讼",
          info: "官方易出现不认可你的说法，打官司消耗很大，对方易出现想要求和想法，于你有利；无官主事，宜找中间人调解。"

        },
        jibing: {
          jixiong: "凶",
          title: "讼卦占疾病",
          info: "易因食而病，胃口减少或因争财或口舌争斗而起病；容易有后腰泌尿、风寒酸痛、四肢不适的症状发生。"
        },
        shiwu: {
          jixiong: "凶",
          title: "讼卦占失物",
          info: "不能寻回。"
        },
        gupiao: {
          jixiong: "凶",
          title: "讼卦占股市期货",
          info: "变动，多空分歧，震荡投机。时机不成熟，投资之事要小心谨慎，以免受骗而与他人发生争讼。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "讼卦占出行",
          info: "途中容易多有变故，出行防耗财。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "地水师",
    hanyi: "地水师卦为下卦坎，坎为水；上卦坤，坤为地，后阿比地中有水；代表容纳、包容之意。得此卦者，困难重重，忧心劳众，宜包容别人，艰苦努力，摒除一切困难。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "师卦代表外来的障碍，在恋爱和婚姻中表现为父母的反对意见，甚至设置障碍。整体上看不容易有很好的结果，两个人很难走入婚姻的殿堂。双方的努力效果也不一定会好，因为外在的障碍不是仅凭两个人能扫清的。",
          info: "1.师卦占恋情\n" +
            "恋情不顺。首先两个人的感情基础并不是很牢固，容易出现家长的反对意见是最大的障碍，而且相当难以克服，所以恋情多半没有好的结果。\n"+
			 "\n" +
			  "2.师卦占婚姻\n" +
            "不太顺，很难说得上吉与凶。两个人之间虽然没有什么问题，易因双方的家长或长辈提出了反对意见，导致婚事或婚姻生活非常不顺利。\n"
        },
        caiyun: {
          jixiong: "凶",
          title: "师卦为遵纪守法，以避免灾祸的意思。师卦告诉我们，现在市场起伏不定，不是投资的好时机。同时一定要奉行社会规范，不做不法交易，生财有道，财运才能持久。",
          info: "1、师卦占财运\n" +
            "凶。财运不济，不义之财要不得。只有付出努力和血汗，自己辛苦打拼才能得到钱财。"+
		      "\n" + 
			  "2、师卦占生意开张\n" +
            "凶。该行业市场竞争日益激烈，此时不宜开张。"+
		      "\n" + 
			  "3、师卦占股市期货\n" +
            "凶。股市上是非争斗不断，短期内不会有利可图。"+
		      "\n" + 
			  "4、师卦占买卖交易\n" +
            "凶。交易双方没有诚意，阻碍限制较多，交易达成的几率较低。"

        },
        shiye: {
          jixiong: "半吉半凶",
          title: "师卦启示人们，自由与自律是并存的，在工作中应注意遵守工作纪律和社会规范，不要为了事业的成功就去从事非法的交易或是做违法的事情，否则就会招致失败或灾难。",
          info: "1、师卦占事业\n" +
            "凶。事业发展不顺利，机遇不多，同时还经常有突发状况，搞得你心神不宁，神经紧张。在工作中要注意，不要投机取巧，违反社会规范，一切按正途行事，定会有所收获的。"+
		      "\n" + 
			  "2、师卦占工作变动\n" +
            "凶。想要变动工作的朋友，现在竞争太激烈，还是等等再看。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "师卦占子女",
          info: "孩子以后易聪明伶俐，有出息之象。 胎孕方面，喜中有忧或有不安或不孕，已孕易生女孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "地水师卦告诉我们，一切事情都是有章可循的，无规矩不成方圆。在学习中，如果想要有所成就，就需要我们端正自己的学习态度，有扎实的基础，而不能靠临时抱佛脚。",
          info: "成绩不理想，原因不是考运不好，而是平时学习不够用功，只想着临时磨磨枪，搞突击学习。如果想学有所成，就要注意平时的努力，让自己真正有实力。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "师卦占求职",
          info: "也许是运气不佳，也许是竞争过于激烈，总之你的求职不易成功，要想使自己在众多求职者中脱颖而出，增强自己的实力最重要，同时也要注意积极主动一些。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "师卦占官司诉讼",
          info: "你方占优，占理，压制对方；官司可能会经历反复后结案；诉讼耗费比较大；需防对方与证人合谋害你。"
        },
        jibing: {
          jixiong: "凶",
          title: "师卦占疾病",
          info: "容易有脾胃不调、虚黄浮肿、瘟疫毒症等症状发生；病情易出现内伤外感；病伴有胸闷不宽；多疾缠身，病情危险。"
        },
        shiwu: {
          jixiong: "凶",
          title: "师卦看失物",
          info: "不会出现，即或寻回，也已损坏"
        },
        gupiao: {
          jixiong: "凶",
          title: "师卦看股票",
          info: "现在市场起伏不定，不是投资的好时机。同时一定要奉行社会规范，不做不法交易，生财有道，财运才能持久"
        },
        jiazai: {},
        chuxing: {
          jixiong: "半吉半凶",
          title: "师卦占出行",
          info: "出行须防酒色,切勿贪杯，总体顺利。"

        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "水地比",
    hanyi: "比卦，代表比劫，比劫者兄弟，代表与朋友合伙，和谐之意。得此卦者，可获朋友之助，众人之力，谋事有成，荣显之极。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "比卦意味着两个人的性格可以互补，这是一个非常吉祥如意的卦。个性互补有两个意思：一是个性确实不同，二是不同的个性之间并没有不可调和的矛盾，是一种非常理想的状态。",
          info: "1、比卦占恋情\n" +
            "大吉！男方有男子汉气概，女方有女子的温柔体贴，这样的爱情让所有人羨慕。在恋爱过程中，双方都能在对方身上学习到很多长处，以弥补自己的短处。这种能让人不断进取的愛情才是最完美的。\n" +
            "\n" +
            "2、比卦占婚姻运势\n" +
            "大吉！你们正是恋人中的模范、夫妻中的榜样！在和谐的婚姻中，两个人的性格应该是“优势互补”的。这样的个性不但可以让矛盾化解，而且能提髙婚姻生活的质量。" +
			 "\n"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运大旺。在与人交往中，要有宽广的心胸。和谐的人际关系能带来巨大的财富。俗话说，“一个好汉三个帮”，集众人之智慧比孤军作战的力量要强大得多，所以和谐的人际关系很重要。",
          info: "1、占财运\n" +
            "吉。贵人相助，财运大旺。\n" +
            "\n" +
            "2、占生意开张\n" +
            "吉。开张大吉，生意红火。\n" +
            "\n" +
            "3、占买卖交易\n" +
            "吉。双方有共识，可达成交易，获取利润。"
        },
        shiye: {
          jixiong: "吉",
          title: "在工作中与人相处应该以和为贵，在和谐、融洽的氛围中更容易得到贵人的相助，切忌孤军作战，要注意与工作伙伴的紧密配合。",
          info: "1、比卦占事业\n" +
            "吉。你的事业运势由弱转强，机遇来临。值得高兴的是，在你身边会有贵人相助，你将会得到长辈的提携，所以要好好利用周围的人际关系，多寻求朋友的帮助，相信一定会实现自己心中的目标。\n" +
            "\n" +
            "2、比卦占工作变动\n" +
            "吉。如果想要变动工作，现在是个不错的时机。\n" 
        },
        zinv: {
          jixiong: "吉",
          title: "比卦占子女",
          info: "孩子性格易聪明乖巧，亲情融合之象。 胎孕方面，生产无惊阻，比较平安顺利，已孕易生男孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "比卦占考运",
          info: "考试顺利，成绩比较理想。这主要归功于平时的努力，基础知识学得很扎实，另外考试时的好心情，放松的心态也是一个原因，所以在平时也要注意与同学友好相处，获得一个友好的外部环境。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "比卦占求职",
          info: "你的求职运不错，因为有不错的运气，再加上有贵人相助，可以找到一个比较满意的工作。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "比卦占官司诉讼",
          info: "卦象显示虽对方有理；但对方有可能会找你求和，于你有利；诉讼过程不太顺；防止对方与证人合谋害你。"
        },
        jibing: {
          jixiong: "凶",
          title: "比卦占疾病",
          info: "容易有感冒风寒、头疼发热、口渴瘫痪、口眼歪斜症状；防腹痛或腹泻。防晚上病重；病症多是旧疾，病情不安。"

        },
        shiwu: {
          jixiong: "凶",
          title: "比卦占失物",
          info: "不会再现。通常均已遭损毁。"
        },
        gupiao: {
          jixiong: "吉",
          title: "比卦占股市期货",
          info: "众星拱比，枯树开花，股市上涨，且呈现出分批轮流上涨的趋势。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "比卦占出行",
          info: "出行注意防口舌是非，总体顺利。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "风天小畜",
    hanyi: "此卦，上卦为风、下卦为天，威风吹拂，草木有生机。意味着：力量较薄弱，需要储蓄势力等待机会。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "风天小畜卦说明你们已经有了一定的感情基础，但这个基础十分不牢固。这时男女双方都对对方产生了三心二意的想法。三心二意是感情生活中的破坏分子，必须防止它的出现。",
          info: "1、小畜卦占恋情\n" +
            "半吉，表示恋人好不容易走到了今天，却逐渐厌倦起来。感情中三心二意，总是觉得对方不能令自己满意。恋情正面临着重大考验，如果不采取措施，很可能会破灭。\n" +
            "\n" +
            "2、小畜卦占婚姻运势\n" +
            "半吉，两人婚姻并不是一帆风顺。不顺利的原因，是两个人互相起了异心，三心二意用情不专。但只要及时调整，回归正道，最后还是可以终成眷属的。\n" 
              
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明能发一笔小财。能有一些小财运已经不错了，有的人还一直在走霉运呢，所以要有知足常乐的心态。等时机来临，自己的实力提高了，就一定会获得更大的收益。",
          info:"1、小畜卦占财运\n" +
            "吉。能得到数量不大的钱财，还需要进一步努力。\n" +
			  "\n" +
            "2、小畜卦占生意开张\n" +
            "吉。此时开张，会有小的利润，但只要努力经营，生意就会慢慢好起来。\n" +
			  "\n" +
            "3、小畜卦占股市期货\n" +
            "吉。股市略微上涨，但获得的利润有限，最好进行小额投资。\n" +
			  "\n" +
            "4、小畜卦占买卖交易\n" +
            "吉。交易能成，会有小的收获，但现在不会有获得髙利润的买卖机会。"
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "时机尚不成熟，应当耐心而积极地积存力量，切不可冒险行动。遇到挫折不可灰心，鼓起勇气战胜困难，坚持原则，加强团结合作，提前做好各项准备，会有所成。",
          info:"1、小畜卦占事业\n" +
            "吉中带凶。你的事业发展不是很平坦，起伏不定，有时看起来前途一片光明，有时又会生出一些障碍，影响事业的发展。不要太浮躁，“小不忍，则乱大谋”，现在全力以赴，努力奋斗，等时机成熟时，成功自然会到来。\n" +
			  "\n" +
            "2、小畜卦占工作变动\n" +
            "半吉半凶。时机尚不成熟，想要变动工作，建议等一等\n" 
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "小畜卦占怀孕子女",
          info: "孩子会面临着父母不和的局面，子女劳碌之象。胎孕方面，注意防范意外而流产，已孕易生女孩。"
        },
        xueye: {
          jixiong: "半吉半凶",
          title: "在学习上不能过于急躁，好的成绩是需要一点点慢慢积累的，如果继续努力，成绩会有一个较大的提升。",
          info: "考试成绩一般，还有一个较大的提升空间，不要太着急，调整好心态，好好努力，一定会取得不错的成绩的。"
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "在工作上，当事业起伏不定时，一定要沉住气，不要急功近利，“欲速则不达”，等待时机到来，一定会取得大的收获。",
          info: "你的求职运只能说一般，虽然可以找到一份工作，但不会让你很满意，而且短期内也无法找到。不要太灰心，继续努力，会有好的工作机会出现的。"
        },
        guansi: {
          jixiong: "凶",
          title: "小畜卦占官司诉讼",
          info: "对方态度强势，这次诉讼你占劣势；对方易有理,诉讼过程中无官主事；虽你方证据有利，但易因证据不足而败；"
        },
        jibing: {
          jixiong: "凶",
          title: "小畜卦占疾病",
          info: "容易有咳嗽虚怯、气喘痰多、外伤牙痛的症状；或是因饮食、钱财、房事而病；疾病会导致吐泻的症状发生，宜多加留意及时就医。"

        },
        shiwu: {
          jixiong: "半吉",
          title: "小畜卦占失物",
          info: "遗失物有被硬物夹住或者第三格的地方。"
        },
        gupiao: {
          jixiong: "半吉",
          title: "小畜卦占股市期货",
          info: "股市略微上涨，但获得的利润有限，能量不足，最好进行小额投资。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "小畜卦占出行",
          info: "路上不顺或为行李所累或因风雨而阻；到达目的地之后，事情多有不顺。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "天泽履",
    hanyi: "天泽履卦为小吉，凶中带吉，暂时困难重重，但是有惊无险。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "天泽履卦是一个有惊无险的卦。恋爱过程中会有很多挫折、它们看上去是很大的困难，但只要勇于前进，有愈挫愈勇的精神，有可能最终修成正果，与心爱的人喜结良缘。",
          info: "1、履卦占恋情\n" +
            "恋情一波三折，但有惊无险。恋爱的过程很少有一帆风顺的，天泽履卦所代表的恋爱之路要更难走一些，但只要不超过一定限度，所有挫折都是正常的。\n" +
            "\n" +
            "2、履卦占婚姻\n" +
            "开始不顺，最终吉利！在一开始的时候，看来是两个人的缘分还没有发挥作用，事情总是那么不顺利。但只要你们不怕艰辛，愈挫愈勇，能坚持度过考验，最终可以修成正果。\n" 
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明很难得到钱财。在险关、难关面前，要有如履薄冰之感，行事谨慎，才可保平安。经历过磨难之后，你会比别人拥有更多的人生财富，所以不要因为眼前的困难而烦恼。",
          info: "1、履卦占财运\n" +
            "凶。财运不济，平时行事要谨慎，以免破财。\n" +
            "\n" +
            "2、履卦占生意开张\n" +
            "凶。客观环境不允许，不宜开张。\n" +
            "\n" +
            "3、履卦占股市期货\n" +
            "凶。股市上下起伏不定，一定要小心应对，否则会有损失。\n" +
            "\n" +
            "4、履卦占买卖交易\n" +
            "凶。交易有阻碍，难以达成，要努力与对方沟通。"
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "事业工作运势起初很不顺利，受到种种困难，若能提高警惕，谨小慎微，脚踏实地，逐个地去克服困难，不改变自己的决心，一定可以达到目的。办事有自知之明，务必量力而行，不可不顾实际，尤其不得逞强，急于求成。",
          info:"1、履卦占事业\n" +
            "半吉半凶。你的事业运势还可以，但不是一帆风顺，中间会遇到险阻。如果你能勇敢面对，谨慎处理，这些险阻应该算不了什么，最终会化险为夷的。但千万不要草率行事，一定要小心行事，这样才可以安度危机。\n" +
            "\n" +
            "2、履卦占工作变动\n" +
            "凶。打算变动工作的朋友，建议等时机成熟了再动，现在环境还不允许。\n" 
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "履卦占怀孕子女",
          info: "孩子的性格比较坚韧，初运有劳碌后期幸福也。 胎孕方面，注意防范受惊吓之象，注意安胎，已孕易生女孩。"
        },
        xueye: {
          jixiong: "半吉半凶",
          title: "天泽履卦显示有惊无险，但成功不是空等来的。在学习上不努力是肯定不能取得好成绩的，所以，即使现在成绩还不错，也不能掉以轻心。",
          info: "平。好成绩的取得离不开勤奋的学习，对考试掉以轻心势必会使成绩不理想。从现在开始努力吧，你的基础不错，只要努力就会取得不错的成绩的。"
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "天泽履卦显示有惊无险，但成功不是空等来的。在学习上不努力是肯定不能取得好成绩的，所以，即使现在成绩还不错，也不能掉以轻心。",
          info: "平。可以找到合适的工作，但在这个过程中需要等待，因为竞争者太多。如果想尽快找到满意的工作就要积极主动一些，这样成功的几率才会更高。"
        },
        guansi: {
          jixiong: "半吉",
          title: "履卦测官司诉讼",
          info: "你方气盛，压制对方；官司有救，适于和解，宜步步为营。"
        },
        jibing: {
          jixiong: "凶",
          title: "履卦测疾病",
          info: "容易有感冒风寒、四肢不协、头疼发热、口渴瘫痪、口眼歪斜的症状；病是内症，晚上加重。茶饭不思或者食欲不振症状。"
        },
        shiwu: {
          jixiong: "半吉",
          title: "履卦测失物",
          info: "赶快去找有可能寻回，留意行过的路上，或者有鞋的地方。"
        },
        gupiao: {
          jixiong: "凶",
          title: "履卦占股市期货",
          info: "股市上下起伏不定，一定要小心应对，小心跟庄，注意被咬，否则会有损失。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "履卦测外出",
          info: "这次出行平安顺利，即使有危险，也能得到化解。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "地天泰",
    hanyi: "地天泰卦表示由小而大，诸事顺利，否极泰来之意，为吉卦。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "泰卦表示天地交合，使万物充满生机活力，也预示着恋爱或婚姻的顺利发展。在恋爱过程中，它意味着两个人的爱情甜蜜美好；在婚姻生活中，它意味着夫妻双方感情融洽。是比较吉祥如意的一个卦",
          info: "1、泰卦占恋情\n" +
            "比较顺利。 你们的恋情会异常顺利，可以说一切形容爱情美好的词语都是为你们准备的。尽情享受这来之不易的幸福吧，婚姻的殿堂就在前面等着你们！为什么会这样顺利？这恐怕只能用“缘分”来解释了。\n" +
            "\n" +
            "2、泰卦占婚姻运势\n" +
            "大吉大利！你们的恋情几乎没有波折，你们的婚姻中虽然会有小小的不顺利，但是很容易克服。总之，你们的生活会非常幸福美满。\n" 
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运大旺。此时是否极泰来、有利可图，可以利用的大好时机，所以要在事业上进行周密的规划，并积极实施。注意要虚心听取他人的意见或建议，多与人沟通交流，会有意想不到的收获。",
          info: "1、泰卦占财运\n" +
            "吉。财运俱佳，诸事顺利，能获得很大的收益。\n" +
			"\n" +
            "2、泰卦占生意开张\n" +
            "吉。开张大吉，生意兴隆。\n" +
			 "\n" +
            "3、泰卦占股市期货\n" +
            "吉。股市上涨，能从中获利。\n" +
			 "\n" +
            "4、泰卦占买卖交易\n" +
            "吉。买卖双方洽谈顺利，交易能成，可以获得可观的利润，但买进比卖出获利大。"
        },
        shiye: {
          jixiong: "吉",
          title: "占得泰卦的人，无论工作或事业上，都不会有太大困扰，可以说是否极泰来，一切厄运，不顺利都已经成为过去。事业、工作、人际都由闭塞转为了畅通。但不要得意忘形，固步自封、不知进取都会造成失败，要注意多听取周围同事、上司的意见。",
          info: "1、泰卦占事业\n" +
            "坚持由小而大，循序渐进的原则，事业已达到顺利的境地，更应小心从事，居安思危，积极寻求、开拓新的事业，方可继续前进，若因循守旧，不思进取，必遭失败。\n" +
			 "\n" +
			"2、泰卦占工作变动\n" +
            "吉。 现在想要变动工作，是个不错的时机，注意提前了解清楚接收公司的情况。\n" +
            "\n" +
            "3、泰卦占经商\n" +
            "顺利。务必注意市场动向，开拓新的领域，展开新的竞争。为此，密切与他人的合作，争取各方面的帮助，但需谦虚谨慎，警惕巧言令色的小人。"
        },
        zinv: {
          jixiong: "吉",
          title: "泰卦占怀孕子女",
          info: "孩子会非常聪明可爱，将来必成大器。 胎孕方面，比较顺利，安而无灾，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "泰卦，乾为天，坤为地，天气下降，地气上升，天地阴阳交合，万物的生养之道通畅。泰为通，泰象征通泰。即安泰亨通。通泰之时，阴者衰而往，阳者盛而来，所以既吉祥又顺利。",
          info: "你的勤奋努力终于没有白费，考试成绩会很理想，金榜题名的机会很大，但不要因为一两次的好成绩就自信过头，小心大意失荆州。持续的努力才能让成功的喜悦常伴左右。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "泰卦，乾为天，坤为地，天气下降，地气上升，天地阴阳交合，万物的生养之道通畅。泰为通，泰象征通泰。即安泰亨通。通泰之时，阴者衰而往，阳者盛而来，所以既吉祥又顺利。",
          info: "先要祝贺你啦，因为自身的实力很强，再加上有不错的求职运，你可以找到一份不错的工作，未来的发展不可估量。"
        },
        guansi: {
          jixiong: "凶",
          title: "泰卦占官司诉讼",
          info: "诉讼牵连证人或方面比较多，耗费比较大；可能出现官方不认可你的说法，打官司消耗很大；须防日后纠纷再起。"

        },
        jibing: {
          jixiong: "凶",
          title: "泰卦占疾病",
          info: "易因食而病，胃口减少；容易有感冒风寒、头疼发热的症状发生；防腹痛或腹泻；病是内症，晚上加重，宜多加留意。"
        },
        shiwu: {
          jixiong: "凶",
          title: "泰卦占失物",
          info: "不会出现。"
        },
        gupiao: {
          jixiong: "吉",
          title: "泰卦占股市期货",
          info: "股市上涨，能从中获利。可以获得可观的利润，但买进比卖出获利大。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "泰卦占出行",
          info: "出行防耗财,出行总体顺利。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "天地否",
    hanyi: "天地否卦代表事情有挫折、阻碍，容易节外生枝。万物闭塞收缩，办事很难沟通和交流。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "否卦是六十四卦中最不吉利的卦之一。得到了否卦，说明两个人的个性完全合不来，几乎没有挽回的佘地。果断分手是一个比较好的选择，否则只能给两个人带来更多的痛苦。",
          info: "1、否卦占恋情\n" +
            "凶。否卦说明两个人容易个性合不来，而且相差非常大。在恋爱过程中，两个人经常会在各种问题上出现分歧，往往引起争吵。\n" +
            "\n" +
            "2、否卦占婚姻\n" +
            "凶。你们的个性决定两个人难以和平地相处。婚姻生活中，两个人三天两头吵架甚至动手，这注定是一个非常失败的婚姻，要想改变更是难上加难。\n" 

        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。个人事业陷入困境，此时应振奋起来，主动寻求对策，在困境之中主动求生存。",
          info: "1、否卦占财运\n" +
            "凶。财运不济，个人才能和智慧不够，再加上时运不济，不能实现得财的愿望。\n" +
            "\n" +
            "2、否卦占生意开张\n" +
            "凶。不宜开张，否则会有巨大的损失。"+
            "\n" +
            "3、否卦占买卖交易\n" +
            "凶。可以慎重买进，但不宜卖出，否则会损失钱财。"
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "天地否卦是个很不吉利的卦，占得否卦的朋友事业、共走发展会很不顺利，就像是遇到了寒冬，不光会有大雪，还会有冰雹，事业发展处于停滞期，困难重重。",
          info: "1、否卦占事业\n" +
            "凶。你的事业发展受到了很大的阻力，处处不顺，这跟沟通不畅也有很大关系，因为人际关系的疏离，人与人之间的距离越来越远，也阻碍了工作的进展。\n" +
            "\n" +
            "2、否卦占工作变动\n" +
            "凶。对于想要变动工作的朋友来说，现在不是个好时机。"
        },
        zinv: {
          jixiong: "凶",
          title: "否卦占怀孕子女",
          info: "孩子性格易内向孤僻，注意成长过程中的引导。 胎孕方面，怀孕和生产过程中易有不安，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "天地否卦占考运",
          info: "考运不佳，因为自身的能力不足，没有扎实的基础，准备也不充分，造成了成绩的不理想，另外你的学习方法也有点问题，需要好好思考一下了。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "天地否卦占求职",
          info: "现在不是求职的好时机，首先自身实力不强，无法引起用人单位的信任，另外缺乏贵人的相助，在求职过程中会处处碰壁，无法求得好工作。现在好好审视一下自己，努力充实自己的专业知识，这样才能找到适合的工作。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "否卦占官司诉讼",
          info: "你方气盛，压制对方；你方有理；事有转机，易出现多次审讯；防止对方与证人合谋害你。"
        },
        jibing: {
          jixiong: "凶",
          title: "否卦占疾病",
          info: "容易有心发热、口干舌燥或毒疮的症状发生；病易在胸部，容易有心痛的症状发生；目前无药可医，药效不显；多疾缠身，病情危险,宜及时就医。"
        },
        shiwu: {
          jixiong: "凶",
          title: "否卦占失物",
          info: "卦象不吉，寻不回。"
        },
        gupiao: {
          jixiong: "凶",
          title: "否卦占股票期货",
          info: "跌而且是容易暴跌，再创新低，建议谨慎投入。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "否卦占出行",
          info: "出行须防酒色；不病则灾，不利出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "天火同人",
    hanyi: "同人卦代表志同道合，合作、合二为一，吉卦。得此卦者大吉大利，与人合伙创业，共同发展。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "同人卦说明恋人之间相亲相爱，彼此关系非常融洽。如果建立一个家庭，也可以幸福美满、家运昌隆。两个人可以做的就是把这样美好的时光维持下去。",
          info: "1、同人卦占恋情\n" +
            "非常吉利！ 天火同人卦表示是一段非常难得的恋情，恋人之间的关系会非常融洽，彼此之间相亲相爱、互相关心，容易一起进入婚姻的殿堂。\n" +
            "\n" +
            "2、同人卦占婚姻\n" +
            "非常吉利！你们是很适合的一对，而且你们懂得如何相处，能互相照顾，互相关心。天时、地利、人和你们基本上都占据了，尤其是在人和方面你们做得更好。\n" +
			  "\n" 
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运大旺。事业上结交志同道合的朋友，大家共同努力，就能取得最后的成功。而且大家一起合作，成功的机会更大，获利也会更丰厚。所以，一定不要忽视众人的力量。",
          info: "1、同人卦占财运\n" +
            "吉。财俱佳，和谐的人际关系有助于提升财运。\n" +
            "\n" +
            "2、同人卦占生意开张\n" +
            "吉。开张大吉，生意兴隆。\n" +
            "\n" +
            "3、同人卦占股市期货\n" +
            "吉。股市上涨，前景乐观。\n" +
            "\n" +
            "4、同人卦占买卖交易\n" +
            "吉。买卖双方有默契，交易之事会顺利达成共识。"
        },
        shiye: {
          jixiong: "吉",
          title: "天火同人卦体现了团结的力量。如果在一个团体中，大家能同心同德、通力合作，集中力量朝一个目标前进，事业就一定能成功。宜广泛开展人际活动，建立广泛的联系，求大同，存小异，坚持正确的原则，必能成就大事业。",
          info:"1、同人卦占事业\n" +
            "吉。因为运势正旺，你的事业发展很顺利，要善用机会，与其自己努力创造，还不如集结众人的智慧，大家通力合作。只要大家同心同德，通力合作，就一定能成就大事。\n" +
            "\n" +
            "2、同人卦占工作变动\n" +
            "吉。想要变动工作，现在不用犹豫了，可以付诸行动了。\n" 
        },
        zinv: {
          jixiong: "吉",
          title: "同人卦占怀孕子女",
          info: "孩子聪明伶俐，上下皆能和睦之象。 胎孕方面，生产无惊阻，总体平安顺利，易生男孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "同人卦占考运运势",
          info: "考运不错，自身实力也很强，考试成绩优异。如果想有进一步的提高，不妨找一位成绩优异的同学一起学习，相互交流，相互促进，这样想要达到更高的目标就会比较容易。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "同人卦占求职运势",
          info: "以你现在的运势来看，用“事事顺心，事事如意”来形容最恰当不过了，因为有贵人的提携、帮忙，你可以很容易找到一个满意的工作,如果想自己创业，现在也是个不错的时机呢。"
        },
        guansi: {
          jixiong: "凶",
          title: "同人卦占官司诉讼",
          info: "对方态度强势，这次诉讼你占劣势；这次诉讼，牵连证人或者方面比较多，耗费比较大."
        },
        jibing: {
          jixiong: "凶",
          title: "同人卦占疾病",
          info: "容易有后腰与泌尿、风寒酸痛、四肢不适的症状发生；视力血管，心脏病症；病症多是旧疾，病情不安，病是内症，晚上加重。"
        },
        shiwu: {
          jixiong: "吉",
          title: "同人卦占失物",
          info: "可能被某物压在底层，尽快找寻，则可取回。"
        },
        gupiao: {
          jixiong: "吉",
          title: "同人卦占股市期货",
          info: "火光冲天，人心趋同，迎合大势，股市上涨，前景乐观。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "同人卦占外出",
          info: "很平安顺利，并可以结交新朋友，获得帮助。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "火天大有",
    hanyi: "火天大有卦代表象征大有收获，为大吉之卦。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "大有卦象征着在爱情方面会有很大的收获,两个人最终可以步入婚姻的殿堂,爱情幸福，婚姻生活也会美满。只需要付出小小的努力，就能成为人人羡慕的佳偶.",
          info: "1、大有卦占恋情\n" +
            "非常吉利！需要用一定的付出换来胜利的果实，空等是等不来幸福的。追求对方的过程没有太多的波折，比较顺利。\n" +
            "\n" +
            "2、大有卦占婚姻\n" +
			 "非常吉利！不过大有卦的大吉大利不是凭空出现的，而是你们用自己的主动维系经营的感情换来的。\n" 
              
        },
        caiyun: {
          jixiong: "吉",
          title: "大有卦有繁荣、富有的意思。占得此卦说明财运亨通，各种资源会聚，生意上可顺利成交，并收获颇丰。在形势一片大好的时候，切忌狂妄骄纵，谨慎行事，财运才会保持顺畅。",
          info: "1、大有卦占财运\n" +
            "吉。财运俱佳，平时吃苦耐劳，无私心，得到的钱财就更多。\n" +
            "\n" +
			 "2、大有卦占生意开张\n" +
            "吉。开张大吉。日后经营先打折扣，后正式营业，就能赚大钱。\n" +
            "\n" +
			  "3、大有卦占股市期货\n" +
            "吉。股市上涨，投资会获得丰厚的收入。\n" +
            "\n" +
			  "4、大有卦占买卖交易\n" +
            "吉。运势佳，可顺利达成买卖交易，且能获得很多利润。\n" 
        },
        shiye: {
          jixiong: "吉",
          title: "火天大有卦，可以说是集聚了天时、地利、人和，此时正是大有作为之时，各种资源汇聚，只要谨慎谦虚、努力工作，事业上会有很大进展。事业已经取得一定的成就，最忌得意忘形，胡作非为。务必止恶扬善，坚守中止，交往正直的朋友，戒惧谨慎，兢兢业业，真正做到大而不盈，满而不溢，事业可望迈上新的台阶。",
          info: "1、大有卦占事业\n" +
            "吉。事业上也可以说是一帆风顺，甚至会大有作为，但是如果因此而狂妄自大，就会得到乐极生悲的下场。决策性格坚强，勇于战胜困难，奋斗向上，前进途中困难和厄运很多，唯有认真对待才能不断取得成功，如放松警惕，骄傲自满，将带来惨重失败。朋友很多，交际广泛，对事业很有帮助，但其中也有拆台的小人。\n" +
            "\n" +
			 "2、大有卦占工作变动\n" +
            "吉。现在要变动工作，还算是个不错的时机，但要小心应付。\n"
        },
        zinv: {
          jixiong: "吉",
          title: "大有卦占怀孕子女",
          info: "孩子吉祥如意，一生平安之象。 胎孕方面，最好生育及产检选在大医院，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "现在运势正强，但不能得意忘形。即使学习成绩不错，自身实力也很强，也不能骄傲松懈。",
          info: "恭喜你，现在你已经是自信满满了，你的考运不错，实力也很强，如果已经考完试，现在就可以庆贺了。如果现在正在准备中，那就安心考试吧，你会取得一个让人满意的成绩的。需要注意的是，即使成绩很好，也不能松懈，要继续努力。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "火天大有卦占求职",
          info: "你的求职运不错，工作机会多，可以很顺利地找到一份满意的工作。并且让人高兴的是，你能遇到一个做事严谨又平易近人的老板。"
        },
        guansi: {
          jixiong: "吉",
          title: "大有卦占官司诉讼",
          info: "对方想要求和，于我有利；有利于圆满解决。"
        },
        jibing: {
          jixiong: "吉",
          title: "大有卦占疾病",
          info: "容易有心发热，口干舌燥，或毒疮的症状发生；疾病会在白天加重，宜多加注，治疗可愈。"
        },
        shiwu: {
          jixiong: "吉",
          title: "大有卦占失物",
          info: "找寻费时，但坚持不懈可失而复得。"
        },
        gupiao: {
          jixiong: "吉",
          title: "大有卦占股票期货",
          info: "反弹，上下回归，顺势而为，大有收获。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "大有卦占出行",
          info: "出行比较平安顺利，可动身。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "地山谦",
    hanyi: "吉：得此卦者，吉利平安，步步高升。谦虚忍让者前途大好，骄横者必招败。谦受益，满招损。谦和忍让，尊人自卑；利用谦虚，万事可达。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "恋爱或婚姻是两个人的事，相处中凡事不要以自我为中心，都应该多为对方考虑。恋爱过程中互相谦让，结婚后相敬如宾，就能成为让人们羡慕的模范佳偶。",
          info: "1、谦卦占恋情\n" +
            "吉。 你们的恋情是顺利的，心中互相为对方留出了足够的空间。平时相处过程中，虽然对方有时候做一些让你不太乐意的事，但是只要你尽量去理解对方，就容易会有好的结果。\n" +
            "\n" +
            "2、谦卦占婚姻运势\n" +
            "吉。夫妻双方如能在生活中彼此保持谦让和理解对方，你们不但得到了美满的婚姻，而且会用自己的爱心建造自己的私人小空间。\n"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。为人处事谦虚低调，才能得到别人的认可，同时不可太贪心，投资要有节制，不可一次投入太多资金，以免资金周转出现问题。",
          info: "1、谦卦占财运\n" +
            "吉。财运俱佳，平时做事谨慎谦虚，会获得更多的钱财。\n" +
            "\n" +
            "2、谦卦占生意开张\n" +
            "吉。开张大吉，日后经营做到童叟无欺，会有名利双收的可能。\n" +
            "\n" +
            "3、谦卦占股市期货\n" +
            "吉。股市上涨，虽然幅度不大，但也能从中获利。适宜小额投资。\n" +
            "\n" +
            "4、谦卦占买卖交易\n" +
            "吉。以谦和有礼的态度与对方共事，就会从中获得利润。"
        },
        shiye: {
          jixiong: "吉",
          title: "在事业、工作中谦虚是美德，虚怀若谷可以学到更多的东西，还可以避开一些人际关系纠纷，免除危机。此外，保持谦虚的同时还要拥有雄厚的实力与事业能力，这样才能得到大家的支持，使事业发展更加顺利。",
          info: "1、谦卦占事业\n" +
            "吉。此时你的事业运势亨通，过去的阴霾一扫而光，各种资源汇聚，只要能谦虚谨慎，广纳人才，就一定能达成心中的目标，前景必定光明。但切忌骄傲自大，时刻牢记物极必反。\n" +
            "\n" +
            "2、谦卦占工作变动\n" +
            "吉。想要变动工作的朋友，现在是个不错的时机，注意不要太自满，要谦虚行事。\n" 
        },
        zinv: {
          jixiong: "吉",
          title: "谦卦占怀孕子女",
          info: "孩子会具有谦虚平易的美德。 胎孕方面，生产无惊阻，比较平安顺利，易生男孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "如果平时不努力，现在就拿起书本好好准备吧，没有实力的人就没有资格谈运气，因为运气再好，没有实力作保证也考不出好成绩。在事业上，更要谦虚谨慎，虚心听取各方面的意见，同时不断充实自己的实力。",
          info: "考运不错，成绩很好，但不可松懈，应继续努力，这样成绩会更好。同时，在考试过程中不要马虎大意，一定要多检查一遍，以免出错。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "如果平时不努力，现在就拿起书本好好准备吧，没有实力的人就没有资格谈运气，因为运气再好，没有实力作保证也考不出好成绩。在事业上，更要谦虚谨慎，虚心听取各方面的意见，同时不断充实自己的实力。",
          info: "运气不错，可以求职成功。注意提升自身的实力，这样机会更大，同时在求职和任职过程中要谦和有礼，这样才会得到用人单位的喜爱和重用。"
        },
        guansi: {
          jixiong: "吉",
          title: "谦卦占官司诉讼",
          info: "你方气盛，压制对方；官司有救，适于和解。"
        },
        jibing: {
          jixiong: "凶",
          title: "谦卦占疾病",
          info: "容易有心发热、口干舌燥或毒疮的症状发生；病是内症，晚上加重；茶饭不思或者食欲不振症状."
        },
        shiwu: {
          jixiong: "凶",
          title: "谦卦占失物",
          info: "难以发现，有失窃的可能。"
        },
        gupiao: {
          jixiong: "吉",
          title: "谦卦占股市期货",
          info: "股市上涨，虽然幅度不大，但也能从中获利。适宜小额投资。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "谦卦占出行",
          info: "这次出行平安顺利，即使有危险，也能得到化解。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "雷地豫",
    hanyi: "雷地豫卦震上坤下，为震宫初世卦。象征万物苏醒，顿悟的意思；利于开拓市场，一个崭新的开始。代表高兴悦乐之意。此卦显示做事积极、有力，性情柔和、圆融，充满令人喜乐之气、主小吉象。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "在恋爱或婚姻中，喜新厌旧是人类的一大恶习，当恋爱或婚姻生活变得沉闷无趣时，要注意防范恋情或婚姻危机。",
          info: "1、豫卦占恋情\n" +
            "恋爱一开始双方都充满激情，但随着时间的推移，激情会渐渐消退。双方都觉得对方似乎不像以前那样令自己倾慕了，从而付出渐渐减少。这是恋爱过程中的一个危机时刻，需要小心度过。\n" +
            "\n" +
            "2、豫卦占婚姻\n" +
            "婚姻运势平。没有大的挫折，但小挫折不断。你们的感情在一开始虽然不错，但是随着时间的推移，渐渐不像原来那么热烈了。但是对于你们来说，当前的状态潜藏着情感的危机。\n"

        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。无论做什么事，都要未雨绸缪，预先做好规划，不打无准备之仗。“机会是留给有准备的人的”，凡事先做好准备，做好规划，面对变动才能从容应对。",
          info: "1、雷地豫卦占财运\n" +
            "吉。财运较旺，特别是能赚到娱乐方面的钱财。\n" +
            "\n" +
            "2、雷地豫卦占生意开张\n" +
            "吉。娱乐休闲行业开张大吉，生意兴隆。\n" +
            "\n" +
            "3、雷地豫卦占股市期货\n" +
            "吉。股市上涨，会有让人满意的收获。\n" +
            "\n" +
            "4、雷地豫卦占买卖交易\n" +
            "吉。物价上涨，卖出定能获大利。"
        },
        shiye: {
          jixiong: "吉",
          title: "雷地豫卦告诉我们，现在正是机会来临之时，要注意把握这大好时机,做好准备，专心投入。在这个关键时刻千万不要因为有了一点成绩就松懈倦怠，以防功亏一箦。",
          info: "1、豫卦占事业\n" +
            "吉。目前时机大好，是个大展宏图的好机会。你将会发现做事都有得心应手的感觉，要好好把握时机，做好充足的准备，到时会大有作为。注意功成名就时不可狂妄自满，以免造成乐极生悲的后果。\n" +
            "\n" +
			  "2、豫卦占工作变动\n" +
            "吉。想要变动工作，现在比较合适，注意事先要打听清楚消息。\n" +
			"\n" +
            "3、豫卦占经商\n" +
            "吉。时运已到，应大胆行动，即使发生挫折，也可以很快化险为夷。应加强同他人的合作，开诚布公，共同开发事业。"
        },
        zinv: {
          jixiong: "吉",
          title: "豫卦占怀孕子女",
          info: "孩子从小就比较精明，前程美好。 胎孕方面，比较平安顺利,母子安康，易生男孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "要充分利用机会，尽早做好准备，不要松懈怠慢。在学习上要提前准备，学习不是一蹴而就的，不要最后再临阵磨枪。",
          info: "吉。考运不错，加上平时的勤奋努力，要金榜题名并非难事。在考试过程中要谨慎作答，不要急躁，否则就可能因为粗心大意而使成绩受到影响。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "豫卦占求职运势",
          info: "吉。会找到比较适合的工作。在应聘前要做好充分的准备，才能从容应对考官的面试，博得考官的欣赏，顺利地谋得好职位。"
        },
        guansi: {
          jixiong: "吉",
          title: "豫卦占官司诉讼",
          info: "你方见理；对方有可能想要求和，于你有利；防对方与证人合谋害你。"
        },
        jibing: {
          jixiong: "凶",
          title: "豫卦占疾病",
          info: "容易有咳嗽虚怯、气喘痰多、外伤牙痛的症状；须防骨折、骨伤、刀伤；③疾病会在白天加重，宜多加注意；④疾病会导致吐泻的症状发生，宜多加留意。"

        },
        shiwu: {
          jixiong: "吉",
          title: "豫卦占失物",
          info: "难以寻回。"
        },
        gupiao: {
          jixiong: "吉",
          title: "豫卦占股票期货",
          info: "升，轮番作业但涨幅有限，建议见好就收。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "豫卦占出行",
          info: "出行须防酒色,总体比较顺利。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "泽雷随",
    hanyi: "泽雷随卦代表代表随和、吉祥之含义，象征随遇而安，一切随缘、随和。为吉卦。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "要试着去改变自己，放下身段，尽量多了解对方，学习对方性格中的优点，更好地融入对方的生活之中。注意调整好自己的心态和步伐，细细体味“嫁鸡随鸡，嫁狗随狗”的哲理和心境。耐心经营“随遇而安”的婚姻,创造精彩、丰富、和谐的美满生活。",
          info: "1、随卦占恋情\n" +
            "虽然这段感情一波三折，但是最终会修成正果，抱得美人归。此卦告诉你，双方交往的过程中，要照顾对方的想法和感受，尊重对方，理解对方的心情和意愿。只有这样，才能谱写出一支甜蜜的恋曲。\n" +
            "\n" +
            "2、随卦占婚姻运势\n" +
            "吉，可夫唱妇随。虽然婚期会因为种种变故，拖延一段时间，甚至经过一段时间的磨合，但是有情人终成眷属。\n" 
        },
        caiyun: {
          jixiong: "吉",
          title: "随卦的运势时好时坏，起起伏伏，局势变化比较大。这时要学会观察投资环境的变化，这样才能更好地随机应变，避开一些暗滩。另外，广纳建言也是一个很好的做事方式，多寻求他人的协助，人生之路会更加顺畅。",
          info: "1、随卦占财运\n" +
            "吉。贵人相助，财运较旺。\n" +
            "\n" +
            "2、随卦占生意开张\n" +
            "吉。在朋友的帮助下，生意开张十分吉利。\n" +
            "\n" +
            "3、随卦占股市期货\n" +
            "吉。股市偶尔会出现停滞拖延的现象，但如果谨慎行事，就会从中获利。\n" +
            "\n" +
            "4、随卦占买卖交易\n" +
            "吉。波折过后，交易即成。"
        },
        shiye: {
          jixiong: "吉",
          title: "对社会和人生有正确的估价，重视人际关系，善于同他人合作，事业会很顺利。为了保证取得更进一步的成功，不得贪图小利，向比自己优秀的人学习，择善而从，心存诚信、努力开拓事业。",
          info:  "1、随卦占事业\n" +
            "吉。运势发展起伏比较大，要注意观察时局，调节自身的节奏，巧妙地掌握时机。此外，要注意多听长者、伙伴的建言，切忌单打独斗，独断专行。广纳建言，才能获得他人的支持以达成自己的目标。\n" +
            "\n" +
            "2、随卦占工作变动\n" +
            "吉。想要换工作，现在比较吉利，会得到朋友的帮助。\n" 
        },
        zinv: {
          jixiong: "吉",
          title: "随卦占怀孕子女",
          info: "孩子性格乖巧听话，与六亲和睦，幸福之象。 胎孕方面，生产无惊阻，比较平安顺利，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "做事要顺应局势的发展，巧妙地掌握时机，注意多寻求他人的帮助。在学习上，平时做好准备，到时保持平和的心态就可以了，不用太紧张。",
          info: "成绩不错，平时努力勤奋、做好准备，考试时只要放松心情，轻松地应对考试就可以了，不用太担心。另外，考试也需要经验，多参考一下同学或长辈们的经验，考试时也会多一份自信。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "做事要顺应局势的发展，巧妙地掌握时机，注意多寻求他人的帮助。在工作中要学会观察内外环境的变化，随机应变，同时多听听周围人们的建言。",
          info: "有波折，但还算比较顺利，最终能找到一份比较满意的工作。在求职过程中要注意随机应变，谈话要灵活，不要太紧张。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "随卦占官司诉讼",
          info: "	双方皆有部分道理；宜于双方和解."

        },
        jibing: {
          jixiong: "凶",
          title: "随卦占疾病",
          info: "容易有咳嗽虚怯、气喘痰多、外伤牙痛的症状；须防骨折、骨伤、刀伤；③疾病会在白天加重，宜多加注意。"
        },
        shiwu: {
          jixiong: "吉",
          title: "随卦占失物",
          info: "即将疏忽之时，会突然察觉。"
        },
        gupiao: {
          jixiong: "吉",
          title: "随卦占股市期货",
          info: "股市偶尔会出现停滞拖延的现象，但如果谨慎行事，就会从中获利。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "随卦占出行",
          info: "吉利，适宜出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "山风蛊",
    hanyi: "山风蛊卦代表到蛊惑、毒害之意，为凶卦。蛊是内在腐虫，损坏，代表事情不存在或者内藏凶象。任何弊端都是一点一点积累起来的，但是扫除弊端应该大刀阔斧地一次性解决。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "你们的恋爱或婚姻遇到了前所未有的危机，最大的可能就是出现了第三者。接下来自然只有两条路，一是分手或离婚，二是击败第三者，保卫爱情或婚姻。",
          info:  "1、蛊卦占恋情\n" +
            "十分凶险。很可能对方已经变心，不想再继续这段爱情。多半是出现了第三者。第三者在很多方面强于你，但也有很多方面不如你。能不能击败第三者，要看你的决心和勇气了。\n" +
            "\n" +
            "2、蛊卦占婚姻运势\n" +
            "十分凶险。你们的危机在内部和外部同时出现，已经处在最危险的时刻。内部危机就是你们已经对对方产生不满情绪，外部危机就是有人来破坏你们的婚姻，包括你们的长辈。这两个危机都是很难对付的。\n" 
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。在不利于自己的形势中，最好不要铤而走险，有大的行动。利用这段时间，刚好可以休养生息。在反省自己以往做事方式的同时，不断提髙自身的能力，相信事情一定会有转机。",
          info: "1、蛊卦占财运\n" +
            "凶。财运不济，可能会因为父母或其他的家人损耗大量的钱财，甚至负债累累。\n" +
            "\n" +
            "2、蛊卦占生意开张\n" +
            "凶。不宜开张，否则会赔本，最好再等待一段时间。\n" +
            "\n" +
            "3、蛊卦占股市期货\n" +
            "凶。时运不佳，完全没有获利的机会，甚至会有意想不到的灾祸降临。\n" +
            "\n" +
            "4、蛊卦占买卖交易\n" +
            "凶。商品经营没有一点起色，获利更无从谈起。"
        },
        shiye: {
          jixiong: "凶",
          title: "目前事业发展不顺利，处于停滞不前的状态。因为之前工作中存在很多的问题，没有察觉或是察觉了而没有及时处理，所以导致现在这种很糟的局面。静下心来，想想问题到底出在哪里，然后及时地用行动去解决。对于想要变动工作的朋友，现在还不是时机，需要再等等看。",
          info: "1、蛊卦占事业\n" +
            "凶。运气处于不佳状态，或因外界条件，或因个人因素所致。唯有谨慎分析原因，找出弊端，坚决，大胆，不惜冒险，战胜阻力。这时一要头脑冷静，二要向高明的人请教，必能创造业绩。\n" +
            "\n" +
			 "2、蛊卦占工作变动\n" +
            "凶。想要变动工作的朋友，现在还不是时机，需要再等等看。\n" +
            "\n" +
            "3、蛊卦占经商\n" +
            "凶。诸多不利困扰着自己，不宜继续走老路。应全面分析市场动向，当机立断，另外找寻出路。"
        },
        zinv: {
          jixiong: "凶",
          title: "蛊卦占怀孕子女",
          info: "孩子性格易孤僻而坚强，注意日常引导。 胎孕方面，注意预防因惊吓而流产，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "蛊卦，艮为山，巽为风，山下有风，风遇山而回，则万物散乱，为有事之象。蛊者，事也，惑也。物既惑乱，当为治理。故蛊象征惩弊治乱，革新之义。但革新时，应先考虑革新前的状况，再推断革新后将出现的事态，来制定措施。这样才能根治蛊乱，畅通顺利。",
          info: "成绩不理想，考运不佳，平时也不够努力。要静下心来想一想自己成绩差的原因，有针对性地进行改进，不要等到赶不上了再后悔。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "蛊卦，艮为山，巽为风，山下有风，风遇山而回，则万物散乱，为有事之象。蛊者，事也，惑也。物既惑乱，当为治理。故蛊象征惩弊治乱，革新之义。但革新时，应先考虑革新前的状况，再推断革新后将出现的事态，来制定措施。这样才能根治蛊乱，畅通顺利。",
          info: "运气不好，实力不够，准备也不充分，很难找到满意的工作。不要心急，也不要好高骛远，把自己的要求降低一些，从基层做起，等自己有一定的实力后自然会找到满意的工作。"
        },
        guansi: {
          jixiong: "凶",
          title: "蛊卦占官司诉讼 ",
          info: "你方气盛，压制对方,但会拖一段时间，不易解决。"
        },
        jibing: {
          jixiong: "凶",
          title: "蛊卦占疾病 ",
          info: "容易有咳嗽虚怯、气喘痰多、外伤牙痛的症状发生；病症多是旧疾，病情不安；病是内症，易晚上加重；目前无药可医或药效不显."
        },
        shiwu: {
          jixiong: "凶",
          title: "蛊卦占失物 ",
          info: "找不回来。"
        },
        gupiao: {
          jixiong: "凶",
          title: "蛊卦占股市期货",
          info: "时运不佳，完全没有获利的机会，个股入黄昏，阴跌，甚至会有意想不到的灾祸降临。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "蛊卦占出行 ",
          info: "出行防灾祸是非，务必小心谨慎，宜推迟或提前。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "地泽临",
    hanyi: "临卦代表来临、光临之意。象征贵人来了，主吉卦。得此卦者，好运来到，诸事如意。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "愛情是最讲究缘分的，两个人能不能相识、相愛，全都是缘分在起作用。而且缘分不可强求，用年轻人的话来说，缘分是前世修来的，而不是今世追来的。",
          info: "1、临卦占恋情\n" +
            "半吉半凶。 临卦表示你们之间只有八成缘分，需要经过一番努力才能成功。如果想去追求对方，应该使用柔性的手段，靠耐心取得对方的信任。且不可急于求成，否则只会把事情办坏。\n" +
            "\n" +
            "2、临卦占婚姻运势\n" +
            "半吉半凶。你们之间有缘分，成功的可能性比较大。但是成功不是等来的,必须亲自去追，才能得到梦中情人的青睐。在追的过程中，千万不能心急，否则就会弄巧成拙。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。时机到来的时候，应将其紧紧抓在手中，重要事情亲力亲为，慢慢就会获大利。切记：财运虽好，仍须小心谨慎，不可过于松懈、大意，以免好时机在不经意间溜走。",
          info: "1、临卦占财运\n" +
            "吉。财运俱佳，但初期得财后，仍要谨慎从事。\n" +
            "\n" +
            "2、临卦占生意开张\n" +
            "吉。开张大吉，未来生意会更好。\n" +
            "\n" +
            "3、临卦占股市期货\n" +
            "吉。股市上涨，亲自参与，才会获利。\n" +
            "\n" +
            "4、临卦占买卖交易\n" +
            "吉。将货物贩运到较远的地方出售，获利十分丰厚。"
        },
        shiye: {
          jixiong: "吉",
          title: "好运来临，把握时机，努力行动，一定会有所成就，达成心中的 愿望。但要牢记，运气好也不要松懈，如果因为一点成绩就散漫、停止进取，好机会就会在无形中溜走。另外，在工作中要对全局了如指掌，对于重要的工作要身体力行，这样才能时刻保证心中有数。对于想要变动工作 的朋友来说，现在是个好时机，只要努力就会有好的发展。",
          info: "1、临卦占事业\n" +
            "吉。正是成功的极好时机，务必抓紧，不可失去良机。但却不可就此满足，时运会很快消失，一定要从长计议，注意总结经验，团结他人，共同开拓新领域。\n" +
            "\n" +
			  "2、临卦占工作变动\n" +
            "吉。想要变动工作 的朋友来说，现在是个好时机，只要努力就会有好的发展。\n" +
            "\n" +
            "3、临卦占经商\n" +
            "吉。会十分顺利，并有收获，但须随时注意市场动向，兢兢业业，防止出现意外的事故，尤其应妥善处理人际关系。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "临卦占怀孕子女",
          info: "孩子性格温和，多愁善感。 胎孕方面，产妇慎饮食,如家中供奉神位或寺庙求孕产平安更佳，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "临卦，兑为泽，坤为地，泽 上有地，泽卑地尚，尚监 下，为临。临象征监视、 监察。含有由上视下，以尊临卑之义，也有统治的意思。但阴阳消长，监临盛极， 就有转向衰落的危险。",
          info: "成绩还不错，要注意平时多努力，少把心思放在玩乐上。运气只是 一时的，不要总抱着侥幸心理，以你的资质，好好努力，成绩一定错不了。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "临卦，兑为泽，坤为地，泽 上有地，泽卑地尚，尚监 下，为临。临象征监视、 监察。含有由上视下，以尊临卑之义，也有统治的意思。但阴阳消长，监临盛极， 就有转向衰落的危险。",
          info: "求职运不错，只要积极努力，预先做好求职的准备，可以顺利地 找到称心如意的工作。好好做，会前途无量的。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "临卦占官司诉讼",
          info: "易出现对方有理；但对方想要求和，于你有利；这次诉讼，牵连证人或方面比较多，耗费比较大."
        },
        jibing: {
          jixiong: "半吉半凶",
          title: "临卦占疾病",
          info: "容易有感冒风寒、四肢不协、头疼发热的症状发生;防腹痛或腹泻；病症多是旧疾，病情不安；病是内症，易晚上加重."
        },
        shiwu: {
          jixiong: "吉",
          title: "临卦占失物",
          info: "不能立即发现，很久才能找回。"
        },
        gupiao: {
          jixiong: "吉",
          title: "临卦占股市期货",
          info: "股市上涨突破，转势变盘在即，宜做进出准备才会获利"
        },
        jiazai: {},
        chuxing: {
          jixiong: "半吉半凶",
          title: "临卦占出行",
          info: "在准备充分的情况下，可出行。注意防口舌是非。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "风地观",
    hanyi: "风地观卦为察言观色、见风使舵；观者观看也。其含义是等待时机，观察事情的发展情形，也代表事情进展缓慢之一。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "情侣或夫妻之间没有不发生矛盾的。当两个人之间产生比较严重的矛盾时，就要多多站在对方的角度上看问题，这样才能做到互相体谅，齐心协力将困难解决。",
          info:"1、观卦占恋情\n" +
            "半吉半凶。 你们的恋爱之路不是很太平，小矛盾不断。陷入这种状态会让人感到十分沮丧，能不能走出去就要看自己了。不过幸运的是，你们的矛盾并不是原则性的，很容易化解。只要妥善处理这些矛盾，结果就是吉利的。\n"+
			 "\n" +
			  "2、观卦占婚姻\n" +
            "半吉半凶。婚姻之路上的每一步都要自己掌握，因为你们的恋爱之路不是很太平，所以婚姻之路也难以保证顺畅。必须观察各种因素，做出合适的选择。\n"
        },
        caiyun: {
          jixiong: "半吉半凶",
          title: "占财运，得到该卦，为半吉半凶，虽然财运较旺，细致观察周围的环境、人事，并制定策略，等待时机来，就趁势而为，会有所收获。如果不经过分析和思考就贸然投资或交易，会招致损失。",
          info: "1、观卦占财运\n" +
            "平。眼下不宜有大的行动，观望一段时间，再做打算，就会得到钱财\n"+
			 "\n" +
			  "2、观卦占生意开张\n" +
            "平。现在不宜开张，最好再等待一段时间。\n"+
			 "\n" +
			  "3、观卦占股市期货\n" +
            "凶。股市下跌，眼下获利的希望比较渺茫。贸然投资会有损失。\n"+
			 "\n" +
			  "4、观卦占买卖交易\n" +
            "平。时机还没有到来，慎重制定合作条件，选择最好的合作伙伴，交易成功有望。\n"
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "观卦吉凶参半，起伏变化大，要静下心来好好观察局势的变化。在工作中，如果面对问题理不出头绪，头脑不清晰，就暂时不要做决断，待时局明朗时再出手也不迟。",
          info: "1、观卦占事业\n" +
            "平。运势起伏变化大，注意在工作中不要急功近利，先静下心来观察一下局势的变化，想好了利弊再做行动。只要小心谨慎，事情发展就会比较顺利。\n"+
			 "\n" +
			  "2、观卦占工作变动\n" +
            "凶。现在不宜变动，最好再等待一段时间。\n"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "观卦占怀孕子女。",
          info: "孩子多才多艺,儿女将来有成就幸福。 胎孕方面，孕有不安之象，注意及时产检，易生女孩。"
        },
        xueye: {
          jixiong: "半吉",
          title: "运势起伏变化大，做事要三思而行，勿过于急躁。在学习上，有时也会遇到瓶颈，虽然很努力，但进步不大，这时不妨静下来 想想原因出在哪里，向周围的老师同学请教一下。",
          info: "在学习中不要只顾埋头苦读，可以看一下以往的考题，预测一下最热门的考题趋势，再集中方向准备考试，没准儿会达到 事半功倍的效果，拿到比较理想成绩。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "运势起伏变化大，做事要三思而行，勿过于急躁。在 学习上，有时也会遇到瓶颈，虽然很努力，但进步不大，这时不妨静下来 想想原因出在哪里，向周围的老师同学请教一下。",
          info: "可以找到满意的工作，但中间需要一段时间的等待，不要急躁。 先评估一下自己的优势与兴趣所在，再了解一下应聘公司的经营方向与经 营状况，这样就可以有针对性地找到适合自己的公司与职位。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "风地观测官司诉讼",
          info: "宜于双方和解；事有转机，易多次审讯；防对方与证人合谋害你；须防日后纠纷再起。"

        },
        jibing: {
          jixiong: "凶",
          title: "风地观测疾病",
          info: "容易有心发热、口干舌燥或毒疮的症状发生；病情两处，内伤外感；病在胸腹部，容易有心痛的症状发生；目前无药可医或药效不显；疾病易导致吐泻的症状发生，宜多加留意。"
        },
        shiwu: {
          jixiong: "半吉",
          title: "风地观测失物",
          info: "若能细心四察，可以找回来。"
        },
        gupiao: {
          jixiong: "半吉",
          title: "风地观测股票期货",
          info: "止跌，见低反弹或观望."
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "风地观测出行",
          info: "路上不顺，或为行李所累，或因风雨而阻."
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "火雷噬嗑",
    hanyi: "噬嗑卦代表如鲠在喉、难以决策。此卦吉凶不明确，不同的事情有别样的定义。代表法律、法规，困难很快得到解决，障碍排除。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "噬嗑卦是一个极为不吉利的卦，它意味着你们在一起是一个错误的选择。这样的爱情或婚姻注定是不会带来幸福的，所以该分手时就分手。让痛苦早点结束，就能让幸福早点来临。",
          info: "1、噬嗑卦占恋情\n" +
            "极为凶险，几乎不能成功。你们的恋情一开始就是错误的，能走到今天已经是一个不小的奇迹。要想把恋情继续维持下去极为困难，何况你们从中得不到快乐，与其这样拖下去，不如早点了断。\n" +
            "\n" +
            "2、噬嗑卦占婚姻\n" +
            "婚姻运势，非常凶险。两个人根本不是一条路上的，很难相处得来。本卦提示两个人最好不要结婚，否则婚后会有很多痛苦。实际上两个人结婚的可能性并不大，因为多半在恋爱阶段就已经分手了。\n"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。坏事接踵而至，说明不良的积习已经很深了，如果不及时检讨改善，就会有更坏的事情发生，所以要及时革除弊端，改掉一切不良的陋习，才能慢慢出现转机。",
          info: "1、噬嗑卦占财运\n" +
            "凶。财运不济，但如果能谨慎行事，明察秋毫，还要有声威，就能得到钱财。\n" +
            "\n" +
            "2、噬嗑卦占生意开张\n" +
            "凶。阻碍重重，不宜开张。\n" +
            "\n" +
            "3、噬嗑卦占股市期货\n" +
            "凶。投资计划受挫，可能受骗，以致引发争讼。\n" +
            "\n" +
            "4、噬嗑卦占买卖交易\n" +
            "凶。有人从中作梗，交易难成。"
        },
        shiye: {
          jixiong: "凶",
          title: "噬嗑卦可以说是个很不顺利的卦，代表在事业、工作过程中坏事会接踵而至，矛盾层出不穷，似乎所有不如意的事情都挤到了一起，这时就要注意自己在工作中是否有一些不足，及时改正一定会扫除混乱。",
          info: "1、噬嗑卦占事业\n" +
            "凶。困难与阻力十分大，应以坚强的意志，果敢的行为，公正无私的态度去战胜种种厄运，争取事态好转。为了早日化险为夷，必要时可采取强硬手段，甚至诉诸法律。\n" +
			 "2、噬嗑卦占工作变动\n" +
            "凶。想要变动工作，还不是个好时机，中间会有阻碍。\n" +
            "\n" +
            "2、噬嗑卦占经商\n" +
            "凶。处于不利的时候，头脑冷静，明察形势，寻求机遇，不为眼前小利所诱，不发非分之财。认真听取忠告，遵守法纪，秉公办事，不得徇私情，更警惕不得触犯刑律。"
        },
        zinv: {
          jixiong: "凶",
          title: "噬嗑卦占怀孕子女",
          info: "儿女性格易倔，有反抗心理，注意平时疏导。 胎孕方面，注意预防因惊吓而流产，易生女孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "噬嗑卦占考运",
          info: "成绩不理想，过于急躁，静不下心来读书，准备不够充分，造成了成绩不够理想。另外，考试过程中过于紧张，考试状态不好也是一个重要原因。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "噬嗑卦占求职",
          info: "求职不顺利，个性太冲动，礼貌不周，人缘不佳，造成了求职时四处碰壁。如果能改掉冲动、毛躁的毛病，对求职一定会有很大帮助的。"
        },
        guansi: {
          jixiong: "吉",
          title: "噬嗑卦占官司诉讼",
          info: "	你方见理,宜采取主动，据理力争。"

        },
        jibing: {
          jixiong: "凶",
          title: "噬嗑卦占疾病",
          info: "	容易有咳嗽虚怯、气喘痰多、外伤牙痛的症状发生；疾病会在白天加重，宜多加注意；须防病在胸部，胸肋骨痛；疾病会导致吐泻的症状发生，宜多加留意."
        },
        shiwu: {
          jixiong: "凶",
          title: "噬嗑卦占失物",
          info: "有被人捷足捡走的可能，寻回的机会不大。"
        },
        gupiao: {
          jixiong: "凶",
          title: "噬嗑卦占股市期货",
          info: "凶险，违规，投资计划受挫，可能受骗，以致引发争讼。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "噬嗑卦占出行",
          info: "出行须防酒色，切勿贪杯；到达目的地之后，事情多有不顺。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "山火贲",
    hanyi: "山火贲卦，上卦为艮为山，下卦为离为火，山下有火，火燎群山，卦象，思及猛火燎山，玉石俱焚，草木皆尽，以此为戒，从而明察各项政事，不敢以威猛断狱。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "恋爱过程中总是希望越浪漫越好，但是这种浪漫并不能持续太久，一切热度都是有限的。如果说结婚是浪漫的高潮，那么结婚是浪漫的终结。结婚之后，人们只能面对现实中的油盐酱醋的平淡。",
          info: "1、贲卦占恋情\n" +
            "大吉。你们的恋情会十分浪漫，这很可能是你们一生中最幸福的时刻，所以一定要把握好机会，不要让时光过快地流逝。可惜的是越幸福的时光偏偏流逝越快。\n" +
            "\n" +
            "2、贲卦占婚姻\n" +
            "\n" +
            "吉。在恋爱期间，你们会非常浪漫,但是到了结婚之后,就应该平平淡淡。任何热情都不可能一直保持着，在一辈子的婚姻生活中，平平淡淡才是真。\n" 
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。要想有一番作为，不仅要注重外在的形象，还要有内在的实力。要内外兼修，精益求精。自己的能力和实力提髙了，才能抓住机遇，才能有好的财运。",
          info: "1、贲卦占财运吉。财运较佳，但经常表面看上去能赚钱，实际上却是虚空一场。对此应格外注意。\n" +
            "\n" +
            "2、贲卦占生意开张\n" +
            "吉。资金雄厚，才能开张。\n" +
            "\n" +
            "3、贲卦占股市期货\n" +
            "吉。最初股市上涨，但其后却会下跌。可以尝试小额投资。\n" +
            "\n" +
            "4、贲卦占买卖交易\n" +
            "吉。小买卖能成，但大的交易还需等待一段时间。注重产品质量，获利更多。"
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "贲卦告诉我们，实力是企业发展的核心，也是个人发展的必备条件。在企业中，产品要有美丽的外表和过硬的产品质量才能得到消费者的青睐。在工作中，要有机遇更要有实力，才能得到大家的认可。",
          info: "1、贲卦占事业\n" +
            "平。事业运势不错，有很好的机遇。因为自身条件很优越，运气也很 好，所以大家对你的期望都很高。但令人遗憾的是，虽然外部条件很好， 但常常在紧要关头失常，这主要是因为自身的实力不够。\n" +
            "\n" +
			 "2、贲卦占工作变动\n" +
            "平。想要变动工作的朋友，要注意自身实力的加强，这样才能有个好的结果。\n" +
            "\n" +
            "3、贲卦占经商\n" +
            "平。开初会遇到困难，不应灰心，宜全面分析形势，联合他人，共同合作，根据市场，运转业务。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "贲卦占生育",
          info: "子女外貌虽不是十分漂亮，但非常乖巧懂事。胎孕方面，孕有不安之象，生女孩。"
        },
        xueye: {
          jixiong: "半吉半凶",
          title: "贲卦占考运",
          info: "平。考运不错，会取得一个比较满意的成绩。但其实平时的努力还是 不够，基础也不够牢固，所以考试成绩也不够稳定。"
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "贲卦占求职",
          info: "吉。因为外部形象很好，谈吐、为人处事也不错，能够找到一个 较好的工作。但是自身的能力不强，又比较懒惰。不愿通过学习以充实自己，所以很难有进一步的发展。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "贲卦占官司诉讼",
          info: "你方气盛，压制对方；官司可能会经历两处反复后结案；这次诉讼，牵连证人或方面比较多，耗费比较大"

        },
        jibing: {
          jixiong: "凶",
          title: "贲卦占疾病",
          info: "容易有感冒风寒、四肢不协、头疼发热的症状发生;防腹痛或腹泻；病症多是旧疾，病情不安；目前无药可医或药效不显"
        },
        shiwu: {
          jixiong: "半吉",
          title: "贲卦占失物",
          info: "在家中遗失，将可寻回。不妨试试注意门脚的地方。"
        },
        gupiao: {
          jixiong: "半吉",
          title: "贲卦占股市期货",
          info: "最初股市上涨，但有阻力其后却会下跌。可以尝试小额投资。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "半吉",
          title: "贲卦占出行",
          info: "出行防口舌是非，总体顺利。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "山地剥",
    hanyi: "山地剥卦代表去旧生新之意，旱莲逢河，上吉卦。从整个卦象上看，五阴在下，一阳在上，阴盛而阳孤；高山附于地。高山被风雨侵蚀而剥落，其原来的美色遭到破坏，剥落物落在地上，把大地上的原物压坏，破坏了大地原有的美色，对大地也是一种破坏。所以剥卦具有破坏性。此卦阴盛阳衰，喻小人得势，君子困顿，事业败坏。当然，易经是充满辩证思想和发展变化的哲理，若是剥落物落到地上，地上正是一个坑，剥落物将其填平；或者地上是贫瘠的土地，剥落之物土壤肥沃，这又是好事了。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "剥卦说明你们的爱情或婚姻正在被破坏，而且是在较深的层次上的破坏，虽然当时可能看不出什么来，但是若任其发展下去，事态就会非常严重。",
          info: "1、剥卦占恋情\n" +
            "凶。已恋爱意味着你们的爱情或婚姻基础受到了破坏，如果不及时拯救，它就会逐渐被腐蚀掉。未有恋爱对象者，务须慎重考虑，除非有十分般配者，不要随便进行。" +
            "\n" +
            "2、剥卦占婚姻\n" +
            "凶。你们的婚姻之事在一步步走向危险，就像一张床渐渐地剥落一样。如果注意到危机的根源，从根本上予以治理，虽然可能有点晚，但一定会起到作用。\n"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，剥卦为凶，说明财运不济。此时运势下滑到了谷底，而且容易与人发生冲突，或遭人中伤。这个时候最好不要进行投资或交易，以免血本无归。",
          info: "1、剥卦占财运\n" +
            "凶。财运不佳，得财很少，甚至会破财。" +
            "\n" +
            "2、剥卦占生意开张\n" +
            "凶。不宜开张，需要等待时机到来。"+
            "\n" +
            "3、剥卦占买卖交易\n" +
            "凶。时机不对，交易难以达成，最好按兵不动。"
        },
        shiye: {
          jixiong: "凶",
          title: "剥卦是衰败、穷困不堪的一卦，事业运势下滑到谷底，进退两难。此时不要太急躁，在逆境之中更要谨慎行事。也许以退为 守、静待时机是现在的最好选择。",
          info:  "1、剥卦占事业\n" +
            "凶。事业发展不顺利，遇到了很大的阻碍，期待的目标难以达成。此时不要慌乱，也不要勉强补救，退守也许是最佳的选择。趁这个时机努力地充实自己，养精蓄锐，相信一定会否极泰来的。" +
            "\n" +
            "2、剥卦占工作变动\n" +
            "凶。建议想要换工作的朋友，先等一等，现在不是个好时机。"
        },
        zinv: {
          jixiong: "凶",
          title: "剥卦占怀孕子女",
          info: "孩子体质一般，注意后期营养调理。 胎孕方面，注意防惊吓而流产，卦有虚惊之凶象，易生女孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "剥卦占学业考运",
          info: "凶。运气太差，成绩不如想象中的理想。虽然复习得比较认真，但结果不如人意了。不要太沮丧，打起精神准备下一次考试吧。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "剥卦占求职",
          info: "凶。求职很难成功，因为现在竞争太激烈，求职者太多，自己很难得到考官的注意。不如先降低一下目标，找个一般的工作，在工作中慢慢提高自己，等到时机成熟的时候再寻找更满意的工作。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "剥卦占官司诉讼",
          info: "	你方气盛，压制对方；防止对方与证人合谋害你；官司有救，适于和解。"

        },
        jibing: {
          jixiong: "凶",
          title: "剥卦占疾病",
          info: "凶。病情恶化之象，病是内症，多晚上加重，需防头痛、肠胃、性病等疾。"
        },
        shiwu: {
          jixiong: "半吉半凶",
          title: "剥卦占失物",
          info: "目前还隐藏在家中地上，可惜无法发现，建议仔细寻找。"
        },
        gupiao: {
          jixiong: "凶",
          title: "剥卦占股票期货",
          info: "跌，层层剥落，连创新低，走向低迷。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "剥卦占出行",
          info: "出行前充分准备则平安顺利，即使有危险，也能得到化解。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "地雷复",
    hanyi: "复卦表示事情反反复复不稳定之意。此卦吉凶不明，好事与坏事都反复无常，为小吉卦。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "复卦代表你们已经走上错误的道路，提醒要及时改正。在恋爱过程中，由于人们比较年轻，容易做出种种不应该的事情，做错是要及时悔改。",
          info: "1、复卦占恋情\n" +
            "半吉半凶，是凶是吉要看你改过的程度。恋爱过程中的错误，多数是因为年轻人的冲动而犯下的。有些错误不是很重要，但有些错误会影响你们感情的发展，等它们多到一定的程度，就不得不改正了。\n" +
            "\n" +
            "2、复卦占婚姻运势\n" +
            "半吉半凶。你在恋爱过程中的表现，是他（她）选择是否与你结婚的重要依据，如果把握不好自己的表现，就可能导致婚姻的不顺利。\n"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运转旺。过去事情反复不定，改变思路，重新调整，未来就充满希望。另外要注意，此时阴霾刚刚过去，财运还不到最佳，所以不要贸然投资或交易，循序渐进地慢慢来，一定会有所收获。",
          info: "1、复卦占财运\n" +
            "吉。财运较旺，再努力就能得到钱财。\n" +
            "\n" +
            "2、复卦占生意开张\n" +
            "吉。开张大吉，这是好的开始。\n" +
            "\n" +
            "3、复卦占股市期货\n" +
            "吉。股市有上涨的趋势，好气象到来。\n" +
            "\n" +
            "4、复卦占买卖交易\n" +
            "吉。走出困境，流失的客户重新回笼，有望获得利润。"
        },
        shiye: {
          jixiong: "吉",
          title: "你的运势已经好转，逆境即将消失，前段时间的逆境、阻碍都将 被扫除。但现在不要太心急，慢慢来，一切都要沉得住气。另外，也不要 松懈，一步一个脚印地往前走，目标才能实现。",
          info: "1、复卦占事业\n" +
            "吉。已经渡过了困难时期，开始进入积极行动的阶段。但务必抓住时机，当机立断，却不可急躁，且应时常反省个人行动，严于修身，勇往直前，可望成功。\n" +
            "\n" +
			  "2、复卦占工作变动\n" +
            "吉。想要换工作的朋友，现在可以行动了，你会有一个新的开始。\n" +
            "\n" +
            "3、复卦占经商\n" +
            "可大胆投资，与志同道合的伙伴坦诚合作，打开市场，勿因挫折而退缩。更可以打入外地，坚持商业道德，循序渐进，一定会有所赢利。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "复卦占怀孕子女",
          info: "孩子易不听话,有叛逆心理，注意日常疏导。 胎孕方面，主产母有惊惧之灾，注意按时孕检，易生男孩。"

        },
        xueye: {
          jixiong: "吉",
          title: "复卦，震为雷，性动，坤为 地，性顺。震雷在地中微 动，阳动上复而能顺行。 复为归本，故复象征回复、复归。又上卦剥，诸阴剥 阳，而本卦一阳来下，阳 气复返，故称复。此时阳 刚开始伸长，有利于积极 行为。",
          info: "运气好转，成绩也有了进步，但不要因此就沾沾自喜，继续加油，成绩才会更好，持续努力是成绩保持稳定的一个重要保证。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "复卦，震为雷，性动，坤为 地，性顺。震雷在地中微 动，阳动上复而能顺行。 复为归本，故复象征回复、复归。又上卦剥，诸阴剥 阳，而本卦一阳来下，阳 气复返，故称复。此时阳 刚开始伸长，有利于积极 行为。",
          info: "求职运不错，可以找到一个称心如意的工作。自己认真的准备、 努力的学习，终于有了成果，注意在工作中不要松懈，这样才会获得更好 地发展。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "复卦占官司诉讼",
          info: "对方态度强势，这次诉讼易你占劣势；但你方见理；牵连证人或方面比较多，耗费比较大。"
        },
        jibing: {
          jixiong: "凶",
          title: "复卦占疾病",
          info: "肝经比较弱，容易有感冒风寒、四肢不协、头疼发热的症状发生；防腹痛或腹泻；病是内症，易晚上加重；易病在胸部，心痒嘈杂"
        },
        shiwu: {
          jixiong: "吉",
          title: "复卦占失物",
          info: "有失而复得之可能。"
        },
        gupiao: {
          jixiong: "吉",
          title: "复卦占股市期货",
          info: "股市有上涨的趋势，出现生机，反复多变,好气象到来。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "复卦占出行",
          info: "总体出行比较顺利，建议出行前做好周全准备。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "天雷无妄",
    hanyi: "无妄者无希望也，不切实际的行为，主小凶卦。凡事要脚踏实地，不要有一些空幻的想法。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "无论是爱情还是婚姻，都不能妄求十全十美，因为世上根本就没有十全十美的事物。但是有些人偏偏想求得不属于自己的东西，这样的做法会带来一系列的麻烦。",
          info:"1、无妄占恋情\n" +
            "比较顺利，但没有你想象中的完美。产生这种现象的原因是你的要求太高，以至于超出了现实所允许的范围。如果能安守本分，用一种平和的心去看待的话，你的恋情也是很美好的。\n" +
            "\n" +
            "2、无妄占婚姻\n" +
            "半吉半凶。本卦的启示就是不要轻举妄动，不要做自己能力之外的事情。但是你总是想突破这个限制，做一些不该做的事。你的举动使你们的婚姻状况不太顺利，几经波折之后再回到正路上。\n"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。做人要光明磊落，做事要坚守正道，没有私心贪念，才会吉祥平安。如果欲望过髙，妄图使用不法手段获取财富，就有招致灾祸的危险。",
          info: "1、无妄卦占财运\n" +
            "凶。财运不济，不要妄想会有天上掉馅饼的好事，自己努力打拼才会得到钱财。\n" +
            "\n" +
            "2、无妄卦占生意开张\n" +
            "凶。实力不足，不宜开张。\n" +
            "\n" +
            "3、无妄卦占股市期货\n" +
            "凶。股市下跌，投资不会获利。\n" +
            "\n" +
            "4、无妄卦占买卖交易\n" +
            "凶。心怀不轨，贪图钱财，交易难成。"
        },
        shiye: {
          jixiong: "凶",
          title: "无妄卦告诉我们，运势好坏交替是自然界的正常规律，要保持一颗平常心，不要过度地去追求欲望，一旦反其道而行，迷失在功名利禄中，就会给自己带来不可想象的灾难。",
          info: "1、无妄卦占事业\n" +
            "凶。运势好坏交替，凶多于吉。做人做事最怕不守本分，如果欲望过度，企图通过一些违法或违纪的做法来获取一些非法的利益，就必然会招致灾难，影响自己的前途。\n" +
            "\n" +
			 "2、无妄卦占工作变动\n" +
            "凶。目前不宜变动，还是要继续等待时机比较好。\n" +
            "\n" +
            "3、无妄卦占经商\n" +
            "凶。切勿勉为其难，遵循市场规律，讲究商业道德，屏弃投机心理，勿贪暴利，经过辛勤努力，日积月累，必将成功。"
        },
        zinv: {
          jixiong: "凶",
          title: "无妄卦占怀孕子女",
          info: "孩子资质一般,注意平日与子女沟通。 胎孕方面，注意防范意外而动胎气，生产无惊阻，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "本卦启示我们，做人要行得正，站得直，不要有太多贪欲，以致迷失 自我。在学习中，要想获得好成绩，就要靠平时的不懈努力，不要想一些 歪门邪道的做法。在工作中，不要有非分之想，图谋不当利益，以免做出 违法违纪的事情，给自己招来灾难。",
          info: "考试成绩不理想，有待继续努力。好成绩需要的是一点一滴地积累，不要妄想着通过作弊等一些错误的做法去取得好成绩，以免偷鸡不成 反蚀把米。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "本卦启示我们，做人要行得正，站得直，不要有太多贪欲，以致迷失 自我。在学习中，要想获得好成绩，就要靠平时的不懈努力，不要想一些 歪门邪道的做法。在工作中，不要有非分之想，图谋不当利益，以免做出 违法违纪的事情，给自己招来灾难。",
          info: "求职不太顺利，好机会还没有到来，成功的几率不髙。注意要用 正当的方式求职，不要想一些歪门邪道，如修改学历、编一些假的工作经 历等等。这样做即使一时应聘成功了，但因为自己的能力不强，以后工作 也不会顺利。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "无妄卦占官司诉讼",
          info: "诉讼牵连证人或方面比较多，耗费比较大；官司有救，适于和解。"
        },
        jibing: {
          jixiong: "凶",
          title: "无妄卦占疾病",
          info: "如果是最近得的病，那么很快就能好转；如果这个病已经有几个月了，那么有加重的可能；肺经比较弱，容易有咳嗽虚怯、气喘痰多、外伤牙痛的症状发生；疾病会在白天加重，宜多加注意。"
        },
        shiwu: {
          jixiong: "凶",
          title: "无妄卦占失物",
          info: "找不到，似已遗失。"
        },
        gupiao: {
          jixiong: "凶",
          title: "无妄卦占股市期货",
          info: "股市下跌，未达到预期，与愿望相去相左，投资不会获利。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "半吉半凶",
          title: "无妄卦占出行",
          info: "这次出行平安顺利，即使有危险，也能得到化解。但到达目的地之后，事情易多有不顺。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "山天大畜",
    hanyi: "内卦为乾为天，外卦为艮为山，太阳照耀万物摄取阳光雨露滋润。脚踏实地、坚守正道成功就在眼前。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "大畜卦告诉我们，感情也是可以“储蓄”的，而且必须要“储蓄”好足够的感情，才能在婚恋之路上走得顺利。当感情“储蓄”得足够多时，幸福自然会来临。",
          info:"1、大畜卦占恋情\n" +
            "恋情是比较顺利的，因为你们从没有做过伤害对方的事，感情在逐渐积累。随着认识时间的推移，感情也在一步一步加深。从整个过程来看，你们的感情是真心实意的，所以你们的幸福自然会来临。\n" +
			 "\n" +
			"2、大畜卦占婚姻\n" +
            "吉 , 婚姻初期会有一些小波折，但随着两人的不断磨合，感情的加深，默契程度也会不断上升，你们的婚姻也会是幸福和乐的。\n"
		  },
        caiyun: {
          jixiong: "吉",
          title: "大畜卦有储蓄能量、大收获的意思。大畜卦显示目前不是最佳的投资时机，虽然投资方向是正确的，但还需要充分地准备，多做研究，等积累了足够的经验后再投入，一定会有大的收获。",
          info:"1、大畜卦占财运\n" +
            "吉。财运较旺，多学习知识，将来能赚大钱。\n" +
            "\n" +
            "2、大畜卦占生意开张\n" +
            "吉。注重个人积蓄，开张大吉。\n" +
            "\n" +
            "3、大畜卦占股市期货\n" +
            "吉。股市上涨，会从中获利。\n" +
            "\n" +
            "4、大畜卦占买卖交易\n" +
            "吉。开始交易会有困难，但充分准备之后，会有满意的结果。"
        },
        shiye: {
          jixiong: "吉",
          title: "大畜卦显示，目前的事业、工作运势正在好转，前景不错，但现在时机还不是很成熟，要注意储蓄能量、累积资源，这样等时机成熟时，必能一鸣惊人。",
          info:"1、大畜卦占事业\n" +
            "吉。你的事业运势将要开始上升，前景不错，要好好把握机会。但注意在不要太过锋芒外露，因为事业运势正处于上升阶段，但还不是最佳时机。要注意储存实力，待势而发。\n" +
            "\n" +
            "2、大畜卦占工作变动\n" +
            "吉。你的实力还不错,可以变动工作了，但注意不要太过锋芒外露。\n"
        },
        zinv: {
          jixiong: "吉",
          title: "大畜卦占怀孕子女",
          info: "孩子长大后会重情重义,可得幸福之象。 胎孕方面，生产无惊阻，比较平安顺利，易生男孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "大畜卦占考运",
          info: "目前的考试成绩不错，已经较之前有了很大进步。以你的能力， 还有很大的上升空间，所以继续努力吧，下次一定可以取得更好的成绩。"
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "大畜卦占求职",
          info: "你的求职运一般，现在时机还不够成熟，准备也不够充分。但你 的实力还不错，稍事休息，多充充电，耐住性子多应聘几家，一定可以找 到满意的工作。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "大畜卦占官司诉讼",
          info: "	此卦易对方有理；但易出现对方想要求和，于你有利；官司可能会经历两处反复后结案。"

        },
        jibing: {
          jixiong: "凶",
          title: "大畜卦占疾病",
          info: "肝经比较弱，容易有感冒风寒、四肢不协、头疼发热的症状发生；病症多是旧疾，病情不安，病情两处，内伤外感 ,疾病易导致吐泻的症状发生，宜多加留意"
        },
        shiwu: {
          jixiong: "吉",
          title: "大畜卦占失物",
          info: "有机会寻回。似是在圆形有盖盛存之物中。"
        },
        gupiao: {
          jixiong: "吉",
          title: "大畜卦占股市期货",
          info: "股市上涨，积蓄力量，将冲破阻力，会从中获利。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "大畜卦占出行",
          info: "总体适宜出行，出行防口舌是非。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "山雷颐",
    hanyi: "万物萌发，这是颐卦的卦象。得此卦者，对于言语及饮食，凡事需要。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "颐卦启示，在爱情或婚姻生活中，应该注意精神生活建设，它可以帮助减轻社会生活中的各种压力，获得精神上的放松，让爱情或婚姻生活变得更加轻松。",
          info: "1、颐卦占恋情\n" +
            "非常吉利。恋爱期往往是一个人一生中最幸福的时光，在恋爱过程中可以不考虑很多现实问题，只在两个人的小空间中活动。在离结婚问题还远的时候，你们不妨趁此机会仔细体验这难得的精神生活。\n" +
            "\n" +
            "2、颐卦占婚姻运势\n" +
            "比较吉利，一开始时有点凶险，但是后来会发生转机。婚姻之前和结婚之后会有很多烦恼事，解决这些事情不能一味等别人来帮助，关键是提高自己的修养和办事能力，内部矛盾永远比外部矛盾重要。"
        },
        caiyun: {
          jixiong: "半吉半凶",
          title: "占财运，得到该卦，为吉，说明能得到钱财。不要急于开拓事业，而是应不断学习知识，还要注重身心健康，为事业的顺利开展奠定基础。不可贸然行动，固本培元是关键。",
          info: "1、颐卦占财运\n" +
            "平。得财之事并不顺利，有耗财、得财不足的事情发生。平时要注重积累，充实基础，还要保养好身体，才可慢慢扭转不利的形势。\n" +
            "\n" +
            "2、颐卦占生意开张\n" +
            "平。时机还不成熟，不要急于开张。\n" +
            "\n" +
            "3、颐卦占股市期货\n" +
            "平。股市上下起伏不定，不宜贸然投资。\n" +
            "\n" +
            "4、颐卦占买卖交易\n" +
            "平。不要急于成交，否则会徒劳无功有损失。"
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "山雷颐卦有颐养之意，意思是先修养身心再出发。颐卦显示现在不宜积极进取，事业上不要急于开拓，待调整好身心再求发展，一定会取得事半功倍的效果。",
          info: "1、颐卦占事业\n" +
            "平。现在你的事业运势渐趋平稳，暂时不要贸然采取行动，先调整好自己的状态，充实自己再求发展，效果一定会更好。同时要特别注意谨言慎行，以免招来麻烦。\n" +
            "\n" +
			  "2、颐卦占工作变动\n" +
            "平。想要变动工作的朋友来说，现在还不是个好时机。\n" +
            "\n" +
            "3、颐卦占经商\n" +
            "半吉半凶。不得急于求成，初仅以勉强维持生活为限。谨慎小心，循序渐进，诚以待人，真诚与他人合作，因时制宜，不断追求新的开拓方向，必要时可适当冒险。"
        },
        zinv: {
          jixiong: "凶",
          title: "颐卦占怀孕子女",
          info: "孩子需要在教育方面格外操心，不宜过分溺爱。 胎孕方面，孕产最好求佛及家神保佑为佳，易生男孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "本卦是说，内心要行动、改变现状，要踏实、心存善念地去执行，不要因为急于改变而失去节制，为自己带来麻烦。颐养是指谨言慎行，修养身心。强调顺应自然地生活，要节制过度的欲望。",
          info: "考运不错，成绩会越来越好。不要一直担心考试的好坏或是急于有好成绩，静下心来专心读书，把眼前的课程学好，成绩自然会得到提高。"
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "本卦是说，内心要行动、改变现状，要踏实、心存善念地去执行，不要因为急于改变而失去节制，为自己带来麻烦。颐养是指谨言慎行，修养身心。强调顺应自然地生活，要节制过度的欲望。",
          info: "可以找到一份工作，但不一定是你最满意的。不要眼光太髙，可以找一份工作先干着，在工作中慢慢提升自己，等实力增强了再找更好的工作也不迟。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "颐卦占官司诉讼",
          info: "你方气盛，压制对方；你方见理；但多无官主事；人证或物证有可能会不利于你，宜和解。"

        },
        jibing: {
          jixiong: "凶",
          title: "颐卦占疾病",
          info: "多因饮食、钱财而病；目前无药可医或药效不显；疾病易导致吐泻的症状发生，宜多加留意，宜及时就医。"
        },
        shiwu: {
          jixiong: "半吉半凶",
          title: "颐卦占失物",
          info: "尽快去找，似被物件上下夹著。"
        },
        gupiao: {
          jixiong: "半吉半凶",
          title: "颐卦占股市期货",
          info: "股市上下起伏不定，不宜贸然投资。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "颐卦占出行",
          info: "应慎重，总体不宜外出。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "泽风大过",
    hanyi: "大过：代表犯了一个很大的过错，主大凶。诸事不顺。得此卦者，身心不安，事不如意，凡事不宜强求，否则大有后悔之，否则容易犯是非、官非。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "本卦是一个比较凶险的卦，警告要及时地处理好爱情或婚姻过程中的矛盾。解决矛盾的关键在于能否找准问题的根源，有针对性地处理矛盾是最重要的。" ,
          info: "1、大过卦占恋情\n" +
            "比较凶险。两个人的矛盾比较严重，而且容易激化。如果不及时调解，就会越来越凶险，直到恋情破灭、两人分手。\n" +
            "\n" +
            "2、大过卦占婚姻\n" +
            "比较凶险。一开始小心翼翼，却没能躲过危机，虽然你在想办法解决问题，但是解决的结果不是太理想。之所以会这样，多半是因为你没有找准问题产生的根源。"
        },
        caiyun: {
          jixiong: "凶",
          title: "大过卦显示财运不顺畅，而且自身的期待过高，超出了自己能力所及的范围，导致投资或交易不能成功。要试着从实际出发，设定合理的目标，才有机会成交。",
          info:"1、大过卦占财运\n" +
            "凶。财运不佳，做事会遇到阻碍，甚至有灾祸发生。\n" +
            "\n" +
			  "2、大过卦占生意开张\n" +
            "凶。不宜开张，做事要小心谨慎，认真关注每一个细节。\n" +
            "\n" +
			  "3、大过卦占股市期货\n" +
            "凶。股市行情不容乐观，上下起伏较大。\n" +
            "\n" +
			  "4、大过卦占买卖交易\n" +
            "凶。交易不顺畅，期待太高，超出对方所能接受的范围。\n" 
        },
        shiye: {
          jixiong: "凶",
          title: "本卦寓意着，一切事物过度了就会产生相反的效果，做事要量力而行，不要超出自己的能力。凡事过度，即使是善意，也会自找麻烦。掌握分寸，在能力范围之内行事，才会有帮助。",
          info: "1、大过卦占事业\n" +
            "凶。自己要求可能太高了，导致压力、挫折也很多，这对自信心是个很严重的打击，会影响事业的发展。还是给自己制定一个恰当的目标吧，这样才能不断地享受到成功的喜悦。\n" +
            "\n" +
			 "2、大过卦占工作变动\n" +
            "凶。建议想要变动工作的朋友三思而行，现在还不是个好时机。\n" +
            "\n" +
            "3、大过卦占经商\n" +
            "凶。操之过急，发展过快，宜收缩调整。竞争处于不利地步，切勿过度自信，更不得刚愎自用，宜随时观测风向，待机行动。"
        },
        zinv: {
          jixiong: "凶",
          title: "大过卦占怀孕子女",
          info: "孩子成长过程中易经历挫折，注意及时鼓励支持。 胎孕方面，注意防惊吓而流产，卦有虚惊之凶象，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "大过卦，巽为木，兑为泽，泽本润木，但泽在树上，为大水淹没了树木，则过甚。过者,越也。大过象征大为过甚，含有过失的意思。大过内巽外兑，中庸、顺从、使人喜悦、能够得到协助，有可行之道，故前进亨通。",
          info: "考试成绩不理想，因为之前的期待过高了，超出了自己的实力。其实静下来想一想，自己较之前已经有了进步，只是没有达到预期的目标而已。根据自己的实力，给自己制定出一个个的小目标，这样会更有成就感。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "大过卦，巽为木，兑为泽，泽本润木，但泽在树上，为大水淹没了树木，则过甚。过者,越也。大过象征大为过甚，含有过失的意思。大过内巽外兑，中庸、顺从、使人喜悦、能够得到协助，有可行之道，故前进亨通。",
          info: "因为总想着找到一份工资髙、职位好的工作，所以应聘屡屡碰壁。好好反省一下，是不是自己要求太髙了呢。如果给自己降低一下标准，也许会有不错的工作机遇呢。"
        },
        guansi: {
          jixiong: "凶",
          title: "大过卦占官司诉讼",
          info: "易对方态度强势，这次诉讼你占劣势；对方有理；你方证据有利；事有转机，易多次审讯"
        },
        jibing: {
          jixiong: "凶",
          title: "大过卦占疾病",
          info: "容易有咳嗽虚怯、气喘痰多、外伤牙痛的症状发生；病情两处，内伤外感；须防病在胸部，胸肋骨痛；目前无药可医或药效不显；多疾缠身，病情危险，宜及时就医。"
        },
        shiwu: {
          jixiong: "凶",
          title: "大过卦占失物",
          info: "无法发现，不能物归原主。"
        },
        gupiao: {
          jixiong: "凶",
          title: "大过卦占股票期货",
          info: "涨跌不定，升跌过头，掌握时机进出，风险极大。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "大过卦占出行",
          info: "路上不顺或为行李所累或因风雨而阻；到达目的地之后，事情多有不顺。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "坎为水",
    hanyi: "坎为水卦为下下卦，属凶卦。代表含义为雾里看花、水中望月，看得见摸不着，预示着一切没有希望。经云：一轮明月照水中，只见影儿不见踪，愚夫当财下去取，摸来摸去一场空。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "你们的爱情与婚姻都是不顺利的，多半情况下不等维持到结婚就分手了。它们之所以不顺利，并不是你们两个人的感情不好，而是外在困难的影响，毕竟每个人都生活在现实中，有些事情无法改变。",
          info: "1、坎卦占恋情\n"+
		  "十分凶险。能穿过重重坎坷一直走下去需要十二分的勇气和运气，因为你们的处境实在太困难了。你们的爱情缺乏外部条件，十分艰难。\n"+
			"\n"+
		 "2、坎卦占婚姻\n"+
		  "十分凶险。你们的婚姻之事已经到了失败的边缘，拯救似乎也不会起到明显的效果。婚姻之事的凶险并不是突然发生的，而是在一个长期的过程中形成的，早不注意，到了现在已经无法挽回了。\n"

        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，坎卦是《易经》四大难卦之一，说明不会得到钱财。在陷入险境以后，不要有恐惧之心，而要凭借坚强的信念，谨慎行事避免损失，以渡过险关。不要冒险行事，更不要气馁，相信下一步就能时来运转，得见光明。",
          info:"1、坎卦占财运\n"+
		  "凶。财运不济，做事会遇到困难，努力克服，小心谨慎，才不会有损失。\n"+
			"\n"+
			  "2、坎卦占生意开张\n"+
		  "凶。运势极差，不宜开张。\n"+
			"\n"+
			  "3、坎卦占股市期货\n"+
		  "凶。股市大跌，前景也不乐观，不会获利。\n"+
			"\n"+
			  "4、坎卦占买卖交易\n"+
		  "凶。交易难成，最好及早放弃，另寻买主。\n"
        },
        shiye: {
          jixiong: "凶",
          title: "坎卦为易经四大难卦之一，此时运势跌到谷底，非常凶险。在此多事之秋，更要小心谨慎，不要铤而走险。放平心态，用行动检讨、纠正自己的错误，一定能走出困境。",
          info: "1、坎卦占事业\n"+
		  "凶。事业、工作不顺利，进入了进退两难境地，还可能遇到小人的刁难。在此多事之秋，更要小心谨慎，不要贸然行动，遇事不要和他人争，相信总有拨云见日的一天。\n"+
			"\n"+
			  "2、坎卦占工作变动\n"+
		  "凶。想要变动工作，一定要三思，不然极有可能因为找不到新工作而落得两头空。\n"+
            "\n" +
            "3、坎卦占经商\n" +
            "凶。经商十分不利，甚至陷入面临破产的境地，但内心应沉着踏实，保持头脑冷静，身陷险境而心不陷，勿轻举妄动，先求自保以观变，把握时机以脱险。"
        },
        zinv: {
          jixiong: "凶",
          title: "坎卦占怀孕子女",
          info: "孩子多劳苦，宜忍辱负重，注意及时鼓励支持。 胎孕方面，注意防惊吓而流产，卦有虚惊之凶象，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "坎卦占考运",
          info: "要做好心理准备，考试成绩不会很好。虽然很努力，但学习成效不大，同时考运不好，双重的阻碍，使成绩不理想。"

        },
        qiuzhi: {
          jixiong: "凶",
          title: "坎卦占求职",
          info: "求职不顺利，在短期内找不到合适的工作。不要太消沉，建议耐住性子慢慢寻找为好。"
        },
        guansi: {
          jixiong: "凶",
          title: "坎卦占官司诉讼",
          info: "对方有理；官司可能会经历两处反复后结案；官方不认可你的说法，打官司消耗很大"
        },
        jibing: {
          jixiong: "凶",
          title: "坎卦占疾病",
          info: "如果最近得的病，很快就能好转；如病已经有几个月了，那么有加重的可能；多因食而病，胃口减少；容易有脾胃不调、虚黄浮肿、瘟疫毒症等症状发生；注意肾脏，膀胱生殖器病。"
        },
        shiwu: {
          jixiong: "凶",
          title: "坎卦占失物",
          info: "找不回来。有失窃可能。或沉在水底。因坎水有困难之意。"
        },
        gupiao: {
          jixiong: "凶",
          title: "坎卦占股票期货",
          info: "易大跌，易暴跌跳水，连连逃命，谨慎进入。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "半吉半凶",
          title: "坎卦占出行",
          info: "出行防耗财, 但总体出行问题不大。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "离为火",
    hanyi: "离为火，代表太阳，太阳照大地，万物沐光辉，是晋卦的卦象。得此卦者运气旺盛，某事可成，万事大吉。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "离卦强调两人之间感情的重要性。感情是世上唯一无坚不摧的东西，也是爱情或婚姻的基础。恋人或夫妻之间不但需要维持好原有的感情，还要进一步培养感情。",
          info: "1、离卦占恋情\n" +
            "比较顺利。你们有深厚的感情基础，所以恋情很浪漫。偶尔出现困难，但是这些难题对于你们来说并不是太难，稍微一努力，就可以克服了。\n" +
            "\n" +
            "2、离卦占婚姻运势\n" +
            "有波折，但总体来说还是顺利的。婚姻是两个人的事，所以两个人的想法非常重要。只要你们两个人情投意合，两颗心能往一块儿想，没有什么事情能难得倒你们。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。遇事积极，有热情，会大有收获。同时也要注意，虽然财运大好，但投资或交易过程中仍要小心谨慎，以免因为粗心大意而造成损失。另外要随时关注市场动态，不要掉以轻心，这样才能持续获利。",
          info: "1、离卦占财运\n" +
            "吉。诸事顺利，能得到钱财\n" +
            "\n" +
            "2、离卦占生意开张\n" +
            "吉。开张大吉，生意兴隆。\n" +
            "\n" +
            "3、离卦占股市期货\n" +
            "吉。股市上涨，抓准机会投资，就能获利。\n" +
            "\n" +
            "4、离卦占买卖交易\n" +
            "吉。努力认真，双方交易能顺利达成。"
        },
        shiye: {
          jixiong: "吉",
          title: "本卦显示运势如同太阳，光芒耀眼。现在是大刀阔斧、大干一场的时候了，但要注意不要因为鸿运当头就过于狂妄，小心火热过头烧伤了自己。",
          info:  "1、离卦占事业\n" +
            "吉。事业运势不错，现在正是事业如日中天的时候，抓住时机会有一番作为。但不要因此就自以为是，目中无人，要知道爬得越髙就摔得越重。\n" +
            "\n" +
            "2、离卦占工作变动\n" +
            "吉。想要变动工作的朋友来说，现在是个好时机，但不要过于冲动，一定要给自己想好退路。\n" +
            "\n" +
            "3、离卦占经商\n" +
            "吉。行情好,市场竞争顺利。但也会遇到一些困难，必迎难而上，因势利导，克敌制胜。争取众人支持。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "离为火测怀孕子女",
          info: "孩子易多愁善感，注意及时疏导引导，不宜娇生惯养。 胎孕方面，卦有需防惊胎凶象，产母不宜出外游，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "本卦启示我们，即使运势很好时，做事也要小心谨慎、虚心纳言，以免物极必反。在学习中，如果不努力，即使考运再好也帮不上忙，所以不要把考试成绩单单寄托在考运上。在工作中，面对大好的时机，一定要注意虚心谨慎，适时地放慢速度，不可过于急躁。",
          info: "不要把考试成绩单纯地寄托在考运上，自身的努力很重要，只要注意平时的积累，考试时沉着冷静、不粗心、不慌乱，就会取得不错的成绩。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "本卦启示我们，即使运势很好时，做事也要小心谨慎、虚心纳言，以免物极必反。在学习中，如果不努力，即使考运再好也帮不上忙，所以不要把考试成绩单单寄托在考运上。在工作中，面对大好的时机，一定要注意虚心谨慎，适时地放慢速度，不可过于急躁。",
          info: "现在是个求职的好时机，注意面试时要轻松自然，态度要谦和有礼，凭你的实力，会找到一个不错的职位，而且以后会前途无量呢。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "离为火测官司诉讼",
          info: "官方有可能会不认可你的说法，打官司消耗很大；官司剑拔弩张，但会较为迅速的判决。"
        },
        jibing: {
          jixiong: "凶",
          title: "离为火测疾病",
          info: "如果最近得的病，很快就能好转；如病已经有几个月了，那么有加重的可能；肾经比较弱，容易有后腰与泌尿、风寒酸痛、四肢不适的症状发生；视力血管，心脏病症；病是内症，晚上加重。"
        },
        shiwu: {
          jixiong: "吉",
          title: "离为火测失物",
          info: "动作快，可寻回。"
        },
        gupiao: {
          jixiong: "吉",
          title: "离为火测股票期货",
          info: "升，主升时期，大长事渲染。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "离为火测出行",
          info: "可行动，事先应准备充分。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "泽山咸",
    hanyi: "得此卦者，宜谦虚待人，则会吉祥如意，谋事可成。但勿为不正当感情而意乱情迷。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "咸卦是比较吉利的卦，说的是心灵感应的问题。在爱情或婚姻生活中，两个人能心心相印、“心有灵犀一点通”是每个人都渴望的。心灵的沟通是生活幸福的源泉，也是无坚不摧的武器。",
          info: "1、咸卦占恋情\n" +
            "十分吉利！心心相印的恋情是最美好的，因为恋情不需要太多物质的支持，也可以暂时不管现实生活，只需要有感情就够了。你们具备了恋爱过程中最重要的东西，能享有最甜蜜的爱情也就不奇怪了。\n" +
            "\n" +
            "2、婚姻运势\n" +
            "平稳发展，以吉祥如意结束。咸卦的爻辞是非常有趣的，它用人身体上不同部位的感应表示事情发展的进度，一开始是脚上，后来渐渐上升到头上。随着感应部位的上升，婚事的发展越来越顺利。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到咸卦，为吉，说明财运较旺。平时要善于与他人搞好关系， 朋友之间精诚合作，有助于个人运势的提升，诚心合作会带来财富。但同 时也要慎重择友，如果交到一些狐朋狗友，反而会影响自己的前途。",
          info: "1、咸卦占财运\n" +
            "吉。财运较旺，事事顺利，能得到钱财。\n" +
            "\n" +
            "2、咸卦占生意开张\n" +
            "吉。开张大吉，与他人合作，生意红火，赢利丰厚。\n" +
            "\n" +
            "3、咸卦占股市期货\n" +
            "吉。股市慢慢上涨，可以与他人一起合作投资。\n" +
            "\n" +
            "4、咸卦占买卖交易\n" +
            "吉。多考虑他人利益，交易能成。"
        },
        shiye: {
          jixiong: "吉",
          title: "咸卦是个很吉利的卦，它强调的是人际关系的重要性。在事业发展中离不开朋友的帮助，与人和谐相处、为人谦和，才会得到众人的协助，事业也能顺利地开展。",
          info: "1、咸卦占事业\n" +
            "吉。事业运势将会很好，可以发展得很顺利，这主要归功于你的好人缘。因为你为人谦和、乐于助人，所以也将会得到众人的帮助。\n" +
            "\n" +
            "2、咸卦占工作变动\n" +
            "吉。现在想换工作，可以采取行动了，现在是个不错的时机。\n" +
            "\n" +
            "3、咸卦占经商\n" +
            "吉。有利可图。但应以纯正之心，以诚待人，加强合作。市场若不景气，决不可妄动，不可强求，而应静待发展。虚心听取不同意见。"
        },
        zinv: {
          jixiong: "吉",
          title: "咸卦占怀孕子女",
          info: "孩子易灵气十足，特别聪明。 胎孕方面，生产无惊阻，比较平安顺利，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "本卦启示我们，人与人因情感需求而相聚，只有真诚交流，才能得到相知、互助的好朋友，有了朋友的相伴，我们的人生之路会走得更加顺畅。在学习和工作中，我们也离不幵朋友的鼓励、支持，但同时择友要慎重，如果不慎交到“损友”，反而会误入歧途。",
          info: "考运很好，成绩会很理想。注意学习的时候要专心，不要被一些杂事所影响。因为一心不能二用，如果总是被一些其他的事所烦扰，不但成绩会受影响，其他的事也会做得乱七八糟。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "本卦启示我们，人与人因情感需求而相聚，只有真诚交流，才能得到相知、互助的好朋友，有了朋友的相伴，我们的人生之路会走得更加顺畅。在学习和工作中，我们也离不幵朋友的鼓励、支持，但同时择友要慎重，如果不慎交到“损友”，反而会误入歧途。",
          info: "求职运不错，可以找到满意的工作。首先自己的能力不错，再者人际关系很好，可以得到朋友的帮助，所以会很快找到合适的职位。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "咸卦占官司诉讼",
          info: "防官方助他损你；易出现对方想要求和，于你有利，官方易不认可你的说法，打官司消耗很大。"
        },
        jibing: {
          jixiong: "凶",
          title: "咸卦占疾病",
          info: "因食而病，胃口减少；心经比较弱，容易有心发热，口干舌燥，或毒疮的症状发生；病是内症，晚上加重；易茶饭不思，没有胃口。"
        },
        shiwu: {
          jixiong: "半吉半凶",
          title: "咸卦占失物",
          info: "尽速找寻，可以取回，延误时机，则找不回来。"
        },
        gupiao: {
          jixiong: "吉",
          title: "咸卦占股市期货",
          info: "股市慢慢上涨，人气互咸，亨通有利。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "咸卦占出行",
          info: "出行易耗财,暂时不宜远行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "雷风恒",
    hanyi: "此卦吉凶不明确，代表一种稳定、不变的状态。象征一种会持续很长久的一种状况，凡事需要等待之意。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "恒卦要求人们做事要有恒心。在爱情或婚姻中，更是需要有持之以恒、百折不挠的精神。幸福因恒心而来，也因恒心而长久存在。",
          info: "1、恒卦占恋情\n" +
            "你们的恋情不是天生就顺利的，而是要经过漫长的追求过程之后才得到的。在这个漫长的过程中，能不能坚持下来是一个关键问题。如果能坚持，一切都会顺利；如果不能坚持，就会前功尽弃。\n" +
            "\n" +
            "2、恒卦占婚姻\n" +
            "比较顺利。从恋爱到婚姻的道路非常漫长，但是婚姻维持的时间也非常长。在婚姻生活中，能不能长期坚持你们的信念，是婚姻生活幸福与否的基本保证。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。不管做什么事，只要有恒 心，肯下工夫，就一定会享受到成功带来的快乐。不能因为交易完成就松散、懒散，不断地耕耘才能让好财运持续下去。",
          info: "1、恒卦占财运\n" +
            "吉。财运较旺，不怕吃苦，不怕困难，努力奋斗，就能实现得财的愿望。\n" +
            "\n" +
            "2、恒卦占生意开张\n" +
            "吉。适宜开张，但要固守经营之道，才能获利。\n" +
            "\n" +
            "3、恒卦占股市期货\n" +
            "吉。股市有上涨的趋势，可以投资，但不要急躁，有定性，有毅力， 长期投资会获利。\n" +
            "\n" +
            "4、恒卦占买卖交易\n" +
            "吉。双方有共识，交易能顺利达成，但要有长期努力的准备。"
        },
        shiye: {
          jixiong: "吉",
          title: "恒代表着恒久、持之以恒。恒卦告诉我们，只要有恒心、有平静的心境、再加上持续地努力，工作就会平安顺利，但切忌做三心二意、三天打渔两天晒网，那样只会一事无成。",
          info: "1、恒卦占事业\n" +
            "吉。工作运势不错，如果你是一个上班族或是有稳定工作的人，这份工作还比较适合你，只要努力不懈，全身心地投入，心中的目标都能实现。\n" +
            "\n" +
			  "2、恒卦占工作变动\n" +
            "平。想要变动工作，现在还不是个好时机，不要听取别人的劝说，还是再等等看。\n" +
            "\n" +
            "3、恒卦占经商\n" +
            "吉。大胆行动，有所往必有所利。注意市场行情和周围的情况。随时变化经营策略，但不得改变常理常道，坚持慎重选择的方向，勿追随潮流。忌不自量而冒险强求。"
        },
        zinv: {
          jixiong: "吉",
          title: "恒卦占怀孕子女",
          info: "孩子具有坚韧不拔的性格。 胎孕方面，胎有烦恼，但无碍，易生男孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "恒卦占考运",
          info: "最近的考运不错，只要专心读书，保持一颗平常心，再加上持续地努力，一定会有一个不错的成绩。但要注意，如果想继续保持好成绩,一定不能松懈。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "恒卦占求职",
          info: "现在求职会比较顺利，能够找到一个中等职位的工作。不要因为找到了工作就懈怠，不断地提升自己，才能有更好的前途。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "恒卦占官司诉讼",
          info: "此卦易对方有理；对方有可能会想要求和，于你有利；官司可能会经历两处反复后结案；需防对方与证人合谋害你."

        },
        jibing: {
          jixiong: "凶",
          title: "恒卦占疾病",
          info: "容易有咳嗽虚怯、气喘痰多、外伤牙痛的症状发生；须防骨折、骨伤、刀伤；病症多是旧疾，病情不安；病情两处，内伤外感；须防病在胸部，胸肋骨痛."
        },
        shiwu: {
          jixiong: "凶",
          title: "恒卦占失物",
          info: "不能寻回。"
        },
        gupiao: {
          jixiong: "吉",
          title: "恒卦占股市期货",
          info: "股市有上涨的趋势，可以投资，但不要急躁，有定性，有毅力， 长期投资会获利。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "恒卦占出行",
          info: "可以出行，总体顺利。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "天山遁",
    hanyi: "天山遁卦代表退后，退步之意。停滞不前；但是对于有些事情为大吉，假如：古代逃亡，隐瞒事情的时候反之吉卦，因此卦象代表的是宏观的大象，并非绝对的吉凶。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "遁卦启示是妥协退让也是一种智慧。爱情或婚姻不是对抗性的事情，不存在胜负的区别。如果两个人都懂得适当妥协退让，那么相处会变得更容易。",
          info: "1、遁卦占恋情\n" +
            "吉。你的恋情会来得比较容易，恋情会比较顺利，能守住这种恋情需要智慧，像水学习智慧，也就是柔性的智慧。" +
            "\n" +
            "2、遁卦占婚姻\n" +
            "凶。你的婚姻似乎不是主动争取来的，而是妥协退让得到的。其实这只是假象，因为以退为进、以守为攻也是一种战术，并不等于真正地退让或逃避。"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，遁卦为凶，说明财运不济。可能是自身实力不足，也可能是所处环境不利，不宜盲目前行，后退一步为佳。若贸然投资，反而会有破财的危险。",
          info: "1、遁卦占财运\n" +
            "凶。财运不济，应及时反思、总结自己的言行，以免破财。" +
            "\n" +
            "2、遁卦占生意开张\n" +
            "凶。外在环境对自己十分不利，不宜开张。"+
            "\n" +
            "3、遁卦占买卖交易\n" +
            "凶。双方对买卖条件的差距过大，交易不能成功，最好别投入过多的钱财和时间。"
        },
        shiye: {
          jixiong: "凶",
          title: "遁卦给人们的启示是，妥协退让也是一种智慧。当自己能量薄弱时，要学会以退为进，静待时机。凡事不要期待太高，利用逆境去休息、充电，等到时机成熟时再釆取行动，才有成功的机会。",
          info:  "1、遁卦占事业\n" +
            "凶。目前运势不佳，工作中会遇到阻碍，目标不易实现。此时注意安守本分，目标不要定得太远大，也不要和别人争什么。静下心来自我反省，好好休整也许是最好的选择。" +
            "\n" +
            "2、遁卦占工作变动\n" +
            "凶。想要变动工作的朋友要小心，状况没有想象的好，要三思而行。"
        },
        zinv: {
          jixiong: "凶",
          title: "遁卦占怀孕子女",
          info: "孩子性格柔弱，不争强好胜。 胎孕方面，母子不安,卦有虚惊之凶象,注意及时孕检，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "遁卦占考运",
          info: "凶。目前的考试运势走低，竞争对手实力太强，自己的努力又不够，所以无法达到理想的成绩。建议适当降低下自身的目标。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "遁卦占求职",
          info: "凶。求职运不好，关键是时间不对，有小人从中作梗，看似有机会，但其实白忙一场。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "遁卦占官司诉讼",
          info: "你方气盛，压制对方。事有转机，易多次审讯；诉讼牵牵连证人或方面比较多，耗费比较大。"
        },
        jibing: {
          jixiong: "凶",
          title: "遁卦占疾病",
          info: "病症多是旧疾，病情不安；病情易为内伤外感；病在胸部，容易有心痛的症状发生；目前无药可医或药效不显；易茶饭不思，没有胃口。"
        },
        shiwu: {
          jixiong: "凶",
          title: "遁卦占失物",
          info: "失落远处，不能寻回。"
        },
        gupiao: {
          jixiong: "凶",
          title: "遁卦占股票期货",
          info: "跌，空头市场，连续暴跌，急流勇退。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "遁卦占出行",
          info: "当前不宜外出，出行防灾祸是非。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "雷天大壮",
    hanyi: "卦意为打雷、代表声音、响声、表示名声。半吉半凶，雷天大壮卦也代表冲动、发怒，也容易发生突如其来的灾祸。光明正大，强盛壮大；容忍和气，切忌冲动。得此卦者，运势过于强盛，宜心平气和，谨慎行事，否则必生过失。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "大壮卦告诉你，在爱情或婚姻中，最重要的不是外貌、金钱、门第等外在因素，而是道德和两个人的感情。",
          info: "1、大壮卦占恋情\n" +
            "不顺利，有坎坷。你们的恋情会经历比较大的变故，最后的结局有可能还是不错的。在你们的恋情中，出现了当今社会司空见惯的以貌取人、过于势利等情况，但改正得还算及时，因此不算凶险。\n" +
            "\n" +
            "2、大壮卦占婚姻\n" +
            "不算凶险，但也不算太顺利。面对有些婚姻中的问题，你如果用蛮力、金钱等手段解决，反而不会有好的效果；只有当运用智慧和感情时，问题才能迎刃而解。"
        },
        caiyun: {
          jixiong: "半吉半凶",
          title: "占财运，得到该卦，为吉，说明财运较旺。注意平时做事要有度，行 事稳重能得财，任何急功近利的做法最终都会招致失败，做事要踏踏实实、 稳步向前，不可盲目投资、行事躁进，急功近利难以获得成就。",
          info: "1、大壮卦占财运\n" +
            "平。财运较旺，但较易因为做事过头，损耗钱财。\n" +
            "\n" +
            "2、大壮卦占生意开张\n" +
            "吉。开张大吉，和气生财。\n" +
            "\n" +
            "3、大壮卦占股市期货\n" +
            "平。竞争激烈，股市会上涨。\n" +
            "\n" +
            "4、大壮卦占买卖交易\n" +
            "凶。刚开始双方合作热情较髙，但后来意见有分歧，导致交易不能达成。"
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "大壮卦显示，现在事业、工作运势巳经转衰，运气大不如前，不要过于消耗自己的力量或是盛气凌人，做事一步一个脚印儿，踏实向前，才能逐步提升自己的实力，让自己有实力面对各种挑战。",
          info: "1、大壮卦占事业\n" +
            "平。此时运势将要盛极转衰，身处仕途的朋友在升迁之路上走得不平坦。要注意谦虚待人，不要到处得罪人，这样只会给自己带来麻烦，招致祸患。\n" +
            "\n" +
			  "2、大壮卦占工作变动\n" +
            "平。想要换工作的朋友，现在时机一般，选择要谨慎。\n" +
            "\n" +
            "3、大壮卦占经商\n" +
            "平。处在高涨阶段，形势很好。但决不可逞强，更不可妄动，应主动增强与他人的合作。提高警惕，认识物极必反的道理，做事业衰退的准备。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "大壮卦占怀孕子女",
          info: "孩子性格活泼自大，聪明好动。 胎孕方面，母子不安,卦有虚惊之凶象，注意防惊吓而流产，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "君子壮大，当然亨通。然而，声势隆盛壮大，就必须严守纯正，否则就有陷于横暴的可能。所以说，坚守纯正，才会有利。",
          info: "成绩不理想，虽然很努力、行动十足，但意志力不足，不能长期坚持下去，所以考试成绩时好时坏、不稳定，导致成绩不理想。"
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "君子壮大，当然亨通。然而，声势隆盛壮大，就必须严守纯正，否则就有陷于横暴的可能。所以说，坚守纯正，才会有利。",
          info: "求职运一般，此时谋职机会不是很多，需静待时机，修身养性，等自身实力有了提升，机会自然会变多，注意眼光不要过高。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "大壮卦占官司诉讼",
          info: "对方有理；你方证据有利；诉讼牵牵连证人或方面比较多，耗费比较大。宜和解."
        },
        jibing: {
          jixiong: "凶",
          title: "大壮卦占疾病",
          info: "如果最近得的病，很快就能好转；如病很久了，则有加重可能；肝经比较弱，容易有感冒风寒、四肢不协、头疼发热的症状发生，病是内症，晚上加重，病在胸部，心痒嘈杂."
        },
        shiwu: {
          jixiong: "凶",
          title: "大壮卦占失物",
          info: "不能取回."
        },
        gupiao: {
          jixiong: "半吉半凶",
          title: "大壮卦占股市期货",
          info: "竞争激烈，易倒V型，先顺后毖，节制勿贪。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "大壮卦占出行",
          info: "谨慎考量，总体不宜外出，易事情多有不顺"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "火地晋",
    hanyi: "这个卦是异卦（下坤上离）相叠。离为日，为光明；坤为地。太阳高悬，普照大地，大地卑顺，万物生长，光明磊落，柔进上行，喻事业蒸蒸日上。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "晋卦代表在爱情或婚姻中要想吉祥如意，须利用身边有利条件，一是缘分，二是周围之人，尤其是父母和亲朋好友的支持。如果这两个条件都具备了，成功就在眼前。",
          info: "1、晋卦占恋情\n" +
            "吉。有恋爱者，说明两人是有缘分的，虽然有一些波折，但在父母和好友的帮助下，你们的恋情最终能结出胜利的果实。" +
            "\n" +
            "2、晋卦占婚姻\n" +
            "吉。有波折，但结果比较吉利。两人虽有缘分，但还需要周围人的支持。建议多寻求下父母和亲朋好友们的帮助和支持,方能得到理想结果。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，晋卦为吉，说明财运较旺。内心充满希望和热情，勇于付出，就会不断进步，财运也会越来越好。",
          info: "1、晋卦占财运\n" +
            "吉。财运俱佳，能得到正财。" +
            "\n" +
            "2、晋卦占生意开张\n" +
            "吉。开张大吉，奉行以顾客为上帝的经商原则，定会赢利。"+
            "\n" +
            "3、晋卦占买卖交易\n" +
            "吉。买卖双方都有诚意，交易可顺利达成。"
        },
        shiye: {
          jixiong: "吉",
          title: "晋卦预示着即将步步高升，阴霾与黑暗巳经慢慢散去，运势正逐步上升，事业、工作、人际关系都有晋升之象，但现在还未到“如日中天”之时，能量尚不足，要继续努力，同时做事要小心谨慎。",
          info:"1、晋卦占事业\n" +
            "吉。事业运将会如旭日东升，已经摆脱了阴霾与黑暗，重现光明。事业有晋升之象，全心全意地投入到事业、工作中，会得到贵人的相助，目标很可能达成。" +
            "\n" +
            "2、晋卦占工作变动\n" +
            "吉。想要变动工作的朋友，要抓住这个时机，可以有新的发展。"
        },
        zinv: {
          jixiong: "吉",
          title: "晋卦占怀孕子女",
          info: "孩子性格善解人意，多才智，聪明而贤孝。 胎孕方面，生产无惊阻，比较平安顺利，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "火地晋卦占考运",
          info: "你现在已经时来运转，考运佳，成绩会越来越好，如果能再接再厉，金榜题名就指日可待了。同时要注意与同学和睦相处，不要骄傲自满。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "火地晋卦占求职",
          info: "求职运不错，应聘的机会很多，同时会遇到贵人相助。只要努力，就可以找到满意的工作。注意不要眼光过高。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "晋卦占官司诉讼",
          info: "防止官方助他损你的趋势；对方易出现想要求和的想法，于你有利；事有转机，易多次审讯；需防止对方与证人合谋害我；官方不认可你的说法，打官司消耗很大；注意须防日后纠纷再起。"
        },
        jibing: {
          jixiong: "凶",
          title: "晋卦占疾病",
          info: "容易有心发热、口干舌燥或毒疮的症状发生；病情易出现内伤外感；病在胸部，容易有心痛的症状发生；目前无药可医或药效不显；"
        },
        shiwu: {
          jixiong: "半吉半凶",
          title: "晋卦占失物",
          info: "动作快，可以寻回来。似是在地上的箱子之类藏着。"
        },
        gupiao: {
          jixiong: "半吉半凶",
          title: "晋卦占股票期货",
          info: "震荡，反复多次，上下箱形震荡。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "晋卦占出行",
          info: "总体利于出行，出行注意防耗财。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "地火明夷",
    hanyi: "地火明夷卦为小凶卦。外卦为坤，内卦为火，表示日入地中，光明被伤；凡事有阻碍，需要等待时机成熟在决策。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "明夷卦表示目前你们的婚姻或恋情处境就像黎明之前的黑暗。太阳一定会升起来的，你们爱情或婚姻的黎明也一定会到来的。所以要鼓起勇气、增加信心，勇敢地与困难作斗争。",
          info: "1、明夷卦占恋情\n" +
				"半吉半凶。 开始不顺利，但会越来越好。本卦的坎坷主要来自外部，外部的坎坷不是最可怕的，虽然光明暂时被遮蔽，但只要心中充满光明，光明就会来到。\n"+
			  "\n"+
			  "2、明夷卦占婚姻\n" +
			"不吉。 摆在你们面前的形势不太好，就像明媚的阳光被遮住了一样。在这种情况下，应该有一颗向往光明的心。只要心中充满光明，真正的光明才可能会来到。\n"
        },
        caiyun: {
          jixiong: "凶",
          title: "明夷卦显示此时投资环境不佳， 最好打消投资或交易的念头。另外，要谨慎选择投资伙伴和交易 对象，以防受骗、上当。",
          info: "1、明夷卦占财运\n" +
				"凶。财运不济，做事要小心，稍有不慎，就会有破财的危险。\n"+
			  "\n"+
			  "2、明夷卦占生意开张\n" +
				"凶。不宜开张，最好等待一段时间。\n"+
			  "\n"+
			  "3、明夷卦占股市期货\n" +
				"凶。股市上下震动，亏损在所难免。\n"+
			  "\n"+
			  "4、明夷卦占买卖交易\n" +
				"凶。对方无心交易，故意拖延，买卖不会成。还要注意不能替人作保， 收取支票要谨慎，以免收到空头支票。\n"
        },
        shiye: {
          jixiong: "凶",
          title: "明夷卦寓意现在事业、工作运势正处凶险、危难之际，形势非常不利。此时不宜强力对抗，须先沉寂一段时间，养精蓄锐，必要时还要付出极大的努力与毅力来排除困境。",
          info: "1、明夷卦占事业\n" +
            "凶。现在事业运势将要在走下坡路，诸事不顺，行事一定要小心。如果有什么大型计划，最好先暂缓，现在不是贸然采取行动的时候，要耐住性子，一边努力学习，一边等待好时机，千万不可过于急躁。\n" +
            "\n" +
			 "2、明夷卦占工作变动\n" +
            "凶。想要变动工作的朋友来说，现在不是个好时机，一定要慎重。\n" +
            "\n" +
            "3、明夷卦占经商\n" +
            "凶。认真观察言市场动态，待机行动，但须坚持商业道德，目前处于不利情况下,一定要慎重。"
        },
        zinv: {
          jixiong: "凶",
          title: "明夷卦占怀孕子女",
          info: "孩子聪明，但父母易为子女而操劳。 胎孕方面，卦有虚惊之凶象，注意防惊吓而流产，易生女孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "明夷卦占学业考试",
          info: "要做好心理准备，考试成绩不会很好。虽然很努力，但学习成效不大，同时考运不好，双重的阻碍，使成绩不理想。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "明夷卦占求职",
          info: "现在不是求职的好时机，虽然自己很努力，也做了准备，但仍然没有收获。在这段时间注意多充实自己，耐心等待，相信一定可以找到好工作。"
        },
        guansi: {
          jixiong: "凶",
          title: "明夷卦占官司诉讼",
          info: "官司可能会经历两处反复后结案；诉讼牵牵连证人或方面比较多，耗费比较大，宜和解。"
        },
        jibing: {
          jixiong: "凶",
          title: "明夷卦占疾病",
          info: "为潜伏已久之疾，注意心脏、腹部之疾或神经病。"
        },
        shiwu: {
          jixiong: "半吉半凶",
          title: "明夷卦占失物",
          info: "不能立即寻回。正当要遗忘这件事时，会意外地有所发现。"
        },
        gupiao: {
          jixiong: "凶",
          title: "明夷卦占股票期货",
          info: "跌，暗箭难防，每每下挫。"
        },
        jiazai: {},
        chuxing: {},
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "风火家人",
    hanyi: "此卦外卦风、内卦火，风助火势，火助风威，相辅相成，相互帮扶之意。表示与人合伙做事有利，事业发展顺利，家庭和睦，是小吉卦。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "家人卦是与婚恋之事有关的最为吉祥如意的一个卦。家庭是最温暖的地方，也是一切美满的爱情与婚姻的最终目的地。所以要用心给家人关爱，使自己的家庭生活其乐融融。",
          info: "1、家人卦占恋情\n" +
            "吉祥如意！你们的恋爱一开始就是为了走向婚姻的殿堂，从恋爱到结婚的道路，也是宽阔平坦。从恋爱期间开始，你们就各自担负起了自己的责任，这不但使恋情异常顺利，而且为将来的婚姻生活打下了坚实的基础。\n" +
            "\n" +
            "2、家人卦占婚姻\n" +
            "吉祥如意！就婚姻运来说，本卦是六十四卦中最为吉利的一卦。从卦名上就可以看出，本卦是用来指导治理家庭的。你们的婚姻之事十分顺利,几乎没有什么波折，即使有一点小风浪，也会很快平息。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。善于与人交往，积极培养和谐的人际关系，可以为成功增添助力。所以要注重人际关系的培养，多与人沟通、交流，大家互帮互助，会更有利于事业的发展。",
          info: "1、家人卦占财运\n" +
            "吉。财运俱佳，家中生活富裕，衣食无忧。\n" +
            "\n" +
            "2、家人卦占生意开张\n" +
            "吉。开张大吉，生意红火，利润可观。\n" +
            "\n" +
            "3、家人卦占股市期货\n" +
            "吉。股市上涨，特别是家族企业的股票上涨迅速，此时投资能获大利。\n" +
            "\n" +
            "4、家人卦占买卖交易\n" +
            "吉。交易双方关系融洽，能顺利达成交易，且获得利润。"
        },
        shiye: {
          jixiong: "吉",
          title: "家人卦强调的是人际关系的和谐，与周围人的感情就像家人般亲近。在工作中，要多听长辈和亲友的意见，他们提供的重要资讯有利于事业、工作的发展。",
          info: "1、家人卦占事业\n" +
            "吉。事业运势很好，你平时应注重培养良好的人际关系，平时待人谦和友善，将会在接下来工作中总会得到贵人、长辈的提携，所以工作运势很顺畅。\n" +
			  "\n" +
            "2、家人卦占工作变动\n" +
            "吉。现在想要换工作，是个比较好的时机，但要注意变动不要太大。\n" +
            "\n" +
            "3、家人卦占经商\n" +
            "\n" +
            "吉。以治家方式用于商业活动。对待公司职工应严宽结合，以严为主。宜集中领导，主事一人，共同合作，日积月累。"
        },
        zinv: {
          jixiong: "吉",
          title: "家人卦占怀孕子女",
          info: "孩子小时候非常恋家，长大后也是一个会治理家的人。 胎孕方面，生产无惊阻，比较平安顺利，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "家人卦占考运",
          info: "考运不错，如果积极努力，会有不错的成绩。在学习中，要注意与同学间的互助友爱，相信大家在一起学习、讨论会比你一个人学习的成效更大。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "家人卦占求职",
          info: "因为平时为人和善，做事礼貌得体，所以深得长辈及亲友的喜欢，在求职过程中会得到长辈及亲友的推荐，得到一份好的工作。"
        },
        guansi: {
          jixiong: "吉",
          title: "家人卦占官司诉讼",
          info: "	你方虽然见理但易遇到无官主事,若行事合理则无碍。"
        },
        jibing: {
          jixiong: "半吉半凶",
          title: "家人卦占疾病",
          info: "注意心脏或胆病，必须小心调理。"
        },
        shiwu: {
          jixiong: "吉",
          title: "家人卦占失物",
          info: "出现。隐藏在家中。可能是被家人收起来了。"
        },
        gupiao: {
          jixiong: "吉",
          title: "家人卦占股市期货",
          info: "股市上涨，涨升有序，无益无害，此时投资能获大利。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "半吉半凶",
          title: "家人卦占出行",
          info: "出行须防酒色，切勿贪杯误事，非必须可暂缓出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "火泽睽",
    hanyi: "本卦上离、下兑，阻碍不顺，容易犯小人，被朋友出卖。得此卦者，运气不佳，水火不容，相互矛盾，诸事难成。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "爱情或婚姻是不能强求的，因为它们都是两个人的事情。如果两个人缘分不够，那么即使强求也无济于事，但如果两个人有缘分，只需等待就可以喜结良缘。睽卦说的正是两者的结合，所以是先凶后吉。",
          info: "1、睽卦占恋情\n"+
		   "先凶后吉。  之所以要分成两段来说，是因为本卦牵扯到两次恋情。第一次恋爱虽然付出了不少的心血，却以失败告终。在经过失恋的打击之后，第一次恋情却来得十分轻松，基本上是主动送上来的。\n" +
            "\n" +
            "2、睽卦占婚姻\n" +
            "半凶半吉。 你们的婚事基本上也是等来的，你一开始追求的人却没有得到。在经过一系列困难之后，最终你们能走到一起，这是缘分在起作用。在缘分面前，有时候主观的努力是不堪一击的。"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。当与他人有意见分歧的时候，最好异中求同，可以避免有更大的损失。要学会克制自己的脾气，多倾听别人的意见，避免是非、纷争。",
          info: "1、睽卦占财运\n" +
            "凶。财运不济，遇事较易与他人发生对立冲突，赚钱很困难。\n" +
            "\n" +
            "2、睽卦占生意开张\n" +
            "凶。不宜开张，观望一段时间再定。\n" +
            "\n" +
            "3、睽卦占股市期货\n" +
            "凶。股市行情不乐观，总是呈下跌的趋势。期望越高，失望越大。\n" +
            "\n" +
            "4、睽卦占买卖交易\n" +
            "凶。交易双方意见有分歧，可能会不欢而散，或者成本估算错误，损失惨重。"
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "睽卦对事业、工作来说是不太顺利的一卦，常会与人意见相左，冲突、对立不断。关系恶化，很容易将自己卷入是非之中。要注意人际关系的管理，尝试着改变自己与人交往的态度，这样在工作中才能减少牵绊。",
          info: "1、睽卦占事业\n" +
            "凶。事业运势不顺畅，因为与周围的同事观念、立场不同，常会与人发生争执。与同事关系的恶化，很容易导致自己被孤立，影响事业的发展。\n" +
            "\n" +
            "2、睽卦占工作变动\n" +
            "凶。目前运势不好，不宜变动，观望一段时间再定。\n" +
            "\n" +
            "3、睽卦占经商\n" +
            "\n" +
            "凶。应以心平气和的态度投入市场竞争，求大同而存小异。对竞争对手不应敌视，可和而不流，群而不党。尤其不能惹起纠纷，极力避免灾祸。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "睽卦占怀孕子女",
          info: "孩子性格易多愁善感，注意及时疏导。 胎孕方面，生产无惊阻，比较平安顺利，易生女孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "睽卦占考运",
          info: "考试不佳，成绩不理想，一是因为考试前的准备没有找准方向，二是考试时不够细心，即使会的题目也容易答错，要好好反省一下了。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "睽卦占求职",
          info: "求职不顺利，因为个性不随和或者面试发挥不好，导致面试不成功。另外自身的准备不充分，也容易是求职失败的一个重要因素。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "睽卦占官司诉讼",
          info: "这次诉讼，牵连证人比较多，耗费比较大；人证或物证有可能会不利于你；目前官司有救，适于和解"
        },
        jibing: {
          jixiong: "凶",
          title: "睽卦占疾病",
          info: "容易有感冒风寒、四肢不协、头疼发热的症状发生；病是内症，晚上加重。病在胸部，心痒嘈杂易茶饭不思。"
        },
        shiwu: {
          jixiong: "凶",
          title: "睽卦占失物",
          info: "不能找回。有失窃的可能。"
        },
        gupiao: {
          jixiong: "凶",
          title: "睽卦占股票期货",
          info: "涨跌不定，多空分歧，谨慎进入。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "睽卦占出行",
          info: "这次出行平安顺利，即使有危险，也能得到帮助。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "水山蹇",
    hanyi: "蹇代表寒足之意，主凶象，四大难卦第三卦。冰天雪地中赤足而行，代表现在处境多么的艰辛困苦，却又不能放守不管，只能硬撑到底。此时虽是无奈，但也总有苦尽甘来的时刻。人事均很为难之时，事业、感情均有骑虎难下的困境。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "爱情或婚姻就像走一段路，有时候平坦顺畅，有时候非常艰险，甚至完全无法通行。当遇上无法通行的路时，就必须想别的办法。只要手段是正当的，无论用什么方法，达到目的就是好的。",
          info: "1、蹇卦占恋情\n" +
            "很不顺利。在恋爱过程中，需要学会知难而退，因为对于一些不投缘的人，硬要去追也是白费力气。不如早点收回心思，去做该做的事情。\n" +
            "\n" +
            "2、蹇卦占婚姻\n" +
            "\n" +
            "不顺利。在爱情或婚姻中，最重要的是学会正确判断取舍，命中该有的早晚会有，命中不该有的，强求也无济于事。所以适当学会放弃也是很重要的，知难而退不等于逃避。"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。外在环境险象环生，凡事不能急躁，积极想办法应对困难，才是真正的出路。切忌贸然投资或交易，等状况好转时再行动，才不致惹祸上身。",
          info: "1、蹇卦占财运\n" +
            "凶。财运不济，小心有意想不到的灾祸降临而损失钱财。\n" +
            "\n" +
            "2、蹇卦占生意开张\n" +
            "凶。不宜开张，否则经营不顺。\n" +
            "\n" +
            "3、蹇卦占股市期货\n" +
            "凶。股市下跌，会有损失。\n" +
            "\n" +
            "4、蹇卦占买卖交易\n" +
            "凶。困难重重，交易不能顺利达成。"
        },
        shiye: {
          jixiong: "凶",
          title: "蹇卦显示现在如同行走在冰封的高山上，困难重重、进退两难,如果想要加快脚步是不智之举，等状况好转或是寻求有实力的人帮助，才能脱离困境。",
          info:"1、蹇卦占事业\n" +
            "凶。此时事业发展不顺利，处于进退两难的境地，做事不易成功，愿望难以达成。此时不宜有所举动，要等待时机，或是寻求有实力的人帮助，才能摆脱困境。\n" +
            "\n" +
            "2、蹇卦占工作变动\n" +
            "凶。想要变动工作的朋友，暂时不要轻举妄动，以免落得两手空空。\n" +
            "\n" +
            "3、蹇卦占经商\n" +
            "\n" +
            "凶。逐步起业，冒险行事，自寻苦恼。宜加强商业道德，真诚同他人合作，陷入困境时，不得见死不救，而应奋不顾身。联合行动，可活跃于市场竞争之中。"
        },
        zinv: {
          jixiong: "凶",
          title: "蹇卦占怀孕子女",
          info: "孩子性格勇敢坚强,六亲少靠。 胎孕方面，注意防惊吓而流产，卦有虚惊之凶象，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "本卦启示人们，现在运势走低，一切都停滞不前，不要轻举妄动，要等状况好转后再行动，才不致惹祸上身。在困难面前，不必一味执著，有时以退为进也是一种智慧。在学习和工作中，遇到困难支持下去，等时机成熟了，一定可以有更大的进步。",
          info: "考运不佳，因为自身的压力大，准备不够充分，加上心情紧张，导致成绩不理想。试着放松自己的心情，调整一下之前的学习习惯，也许成绩会有新的突破。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "本卦启示人们，现在运势走低，一切都停滞不前，不要轻举妄动，要等状况好转后再行动，才不致惹祸上身。在困难面前，不必一味执著，有时以退为进也是一种智慧。在学习和工作中，遇到困难支持下去，等时机成熟了，一定可以有更大的进步。",
          info: "现在不是求职的好时机，自身的准备不充分，自信心不足，并且没有贵人相助，所以不容易找到满意的工作。"
        },
        guansi: {
          jixiong: "凶",
          title: "蹇卦占官司诉讼",
          info: "官方不认可你的说法，打官司消耗很大；防官方助他不利于你；对方可能有想要求和的想法，于你有利;需要防对方与证人合谋害你。"
        },
        jibing: {
          jixiong: "凶",
          title: "蹇卦占疾病",
          info: "病重，应及时医治，注意肾、胃、手部四肢损伤。"
        },
        shiwu: {
          jixiong: "凶",
          title: "蹇卦占失物",
          info: "搜索有困难阻滞而停止，不能寻回。"
        },
        gupiao: {
          jixiong: "凶",
          title: "蹇卦占股市期货",
          info: "市场险阻，艰难跋涉，易股市下跌，会有损失。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "蹇卦占出行",
          info: "总体不利出行，出行防耗财。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "雷水解",
    hanyi: "雷水解卦代表解决之意。凡事需要一个过程，过程虽然有阻碍、克瑟，但是先苦后甜，只要坚持下午就会成功。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "发生误会是爱情或婚姻中在所难免的，当两个人沟通不及时的时候，就可能引起误会。误会一般不会长久存在，而是很快就能消除，如果处理得当的话，误会消除以后，你们的感情可以进一步加深。",
          info: "1、解卦占恋情\n" +
            "吉。  彼此之间曾经长久存在的误会将会彻底消除。误会一旦消除，就好比是拦在路上的石头被移走，道路自然顺畅得多。你们美好的恋情又一次开始了！\n" +
            "\n" +
            "2、解卦占婚姻\n" +
            "吉。  解卦描述的是祸患一步一步解除的过程，一开始虽然有矛盾和坎坷，但是随着事情的发展，它们都消除了。你们的婚姻从泥泞中脱身出来，渐渐进入佳境。"
        },
        caiyun: {
          jixiong: "吉",
          title: "解卦显示此时财运大有起色，要把握好时机，积极寻找志同道合的合作伙伴，会有很大的获利空间。要注意自己一定要亲力亲为，不可完全依赖他人，以防亏空。",
          info: "1、解卦占财运\n" +
            "吉。财运越来越旺，但眼下只能得到很少的钱财，做事还需谨慎。\n" +
            "\n" +
            "2、解卦占生意开张\n" +
            "吉。可以开张，但处处都需小心谨慎，也可以暂缓一段时间再开张。\n" +
            "\n" +
            "3、解卦占股市期货\n" +
            "吉。股市有上涨的趋势，前一段时间的紧张局势能得到缓解，但投资还需慎重。\n" +
            "\n" +
            "4、解卦占买卖交易\n" +
            "吉。生意有转机，长时间的交涉之后，交易会成功。"
        },
        shiye: {
          jixiong: "吉",
          title: "解卦显示此时就像久旱逢甘霖，事情巳经有了转机，事业运势开始上扬，可以化解眼前的困境。要把握好这千载难逢的好机会，不要错失良机，同时注意寻求贵人的相助。",
          info: "1、解卦占事业\n" +
            "吉。即将出现好时机，过去的困难、阻碍都将消失，是发展事业的好机会。要把握好机会，积极努力地向前冲，千万不要因为犹豫不决而错失良机。\n" +
            "\n" +
            "2、解卦占工作变动\n" +
            "吉。想要变动工作的朋友来说，现在的机会还可以，注意要小心一些，提前打听清楚。\n" 
        },
        zinv: {
          jixiong: "吉",
          title: "解卦占怀孕子女",
          info: "孩子以后能吃苦，所以能成大事。 胎孕方面，生产无惊阻，比较平安顺利，易生男孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "解卦占考运",
          info: "只要平时努力，考试时小心仔细，就会取得满意的成绩。对于复读生来说，现在的考运尤其好，只要用心地准备都会取得不错的成绩。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "解卦占求职",
          info: "求职运不错，机会比较多，只要积极寻找，用心准备，就会得到不错的职位。而且如果表现出色，会受到上司的赏识、提拔。"
        },
        guansi: {
          jixiong: "吉",
          title: "解卦占官司诉讼",
          info: "你方见理或当前有利于你，宜尽快解决，不可拖延。"

        },
        jibing: {
          jixiong: "吉",
          title: "解卦占疾病",
          info: "疾病会在白天加重，宜多加注意，久病可治愈。"
        },
        shiwu: {
          jixiong: "吉",
          title: "解卦占失物",
          info: "遗失之物似有被支解破坏的可能，故寻回的机会不大。"
        },
        gupiao: {
          jixiong: "吉",
          title: "解卦占股票期货",
          info: "易升，有走出困境低谷趋势。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "解卦占出行",
          info: "有利于出行，比较顺利。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "山泽损",
    hanyi: "损下益上，损盈益虚；先难后易，量入为出。此卦有利于他人，虽然刚开始有一定的损失后来会有回报。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "损卦的象征意义是损失、损坏。损卦提醒你，在爱情或婚姻中要提防一些小的摩擦。如果处理不好，小的摩擦就可能变成大的冲突。",
          info: "1、损卦占恋情\n" +
            "不太顺利。你的恋情道路波折较多，其实在恋爱过程中出现一些小波折是再正常不过的，有很多人的恋爱过程就是吵架的过程，但是最终也可以喜结良缘。\n" +
            "\n" +
            "2、损卦占婚姻\n" +
            "不太顺利。 在婚姻生活中，有不少小的波折，破坏感情的不一定都是原则性的大事，往往是微不足道的小事。辛辛苦苦建立起来的感情被鸡毛蒜皮的小事破坏掉，实在是太可惜了。"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，先凶后吉，财运会慢慢转好。凡事要全盘衡量得失，有得就有失，损益制衡，不要为了一点小利益斤斤计较。得与失本来就是人生的常态，只要坚持努力，该是你的就终究会得到。",
          info: "1、损卦占财运\n" +
            "凶。财运不佳，平时要注意节省，尽量减少支出，否则守不住钱财。\n" +
            "\n" +
            "2、损卦占生意开张\n" +
			"凶。市场未来前景不好，不宜开张。\n" +
            "\n" +
            "3、损卦占股市期货\n" +
            "凶。股市下跌，会有损失。\n" +
            "\n" +
            "4、损卦占买卖交易\n" +
            "平。开始的时候，交易不顺，会有小的损失，但其后会出现转机。"
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "损卦为先失后得的一卦，运势先是低落而后逐步翻转。要知道做任何事一开始都可能不顺，但只要保持毅力，坚持到底，就一定有大收获。有失才有得，要先懂得付出，才能有所收获。",
          info: "1、损卦占事业\n" +
            "平。事业发展会经历一个由衰转吉的过程，开始时不顺利，会让你有挫败感，但只要保持毅力，坚持努力，事业之路就会逐渐平坦。\n" +
            "\n" +
            "2、损卦占工作变动\n" +
			"平。想要变动工作的朋友，现在不是个好时机，一定要慎重。\n" 
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "损卦占怀孕子女",
          info: "孩子心思细致，诚实孝顺。 胎孕方面，卦象有惊，会有障碍，防克产母，易生女孩。"
        },
        xueye: {
          jixiong: "半吉半凶",
          title: "损卦占考运",
          info: "这次的考试对你来说是很重要的，要好好准备，只要坚持努力，会取得不错的成绩。但是你的考运算不上最好，要调整好自己的考试状态，不要让紧张的情绪影响了发挥."
        },
        qiuzhi: {
          jixiong: "吉",
          title: "损卦占求职",
          info: "求职运不错，虽然一开始会不顺利，找不到合适的职位，但是只要不放弃，多找几家，就一定会找到满意的职位。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "损卦占官司诉讼",
          info: "官司可能会经历两处反复后结案；官方易出现不认可你的说法的情况，打官司消耗很大。和解对你有利。"
        },
        jibing: {
          jixiong: "半吉半凶",
          title: "损卦占疾病",
          info: "虽目前无药可医或药效不显,但积极治疗可愈。"
        },
        shiwu: {
          jixiong: "凶",
          title: "损卦占失物",
          info: "不能寻回。"
        },
        gupiao: {
          jixiong: "凶",
          title: "损卦占股市期货",
          info: "易连续跳水，股市下跌，会有损失,及时止损。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "损卦占出行",
          info: "总体利于出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "风雷益",
    hanyi: "益者容易也，表示事情开始有点波折，但是奋发图强，正当好运的时候，能得到贵人相助，凡事可成，为小吉卦。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "从名字上就可以看出，益卦与损卦代表了两个相反的过程或状态。损卦表示互相损耗，益卦则表示互相增益。恋人或夫妻双方要互相从对方身上学习长处，弥补自己的短处，共同成长。",
          info: "1、益卦占恋情\n" +
            "大吉大利！你们的恋爱过程也是一个让人成长的过程，双方都能在恋爱过程中学到很多东西。当爱情到来时，不要犹豫，而是要积极去迎接，用心去把握。在爱情的锻炼中，你们会进一步成长。\n" +
            "\n" +
            "2、益卦占婚姻运势\n" +
            "大吉大利！ 但是吉利并不等于顺利，正相反，你们的婚事并不是一帆风顺的。正是因为不顺利，所以才给你们提供了成长的机会。可以让人学习和成长的婚姻，才是最完美的婚姻。"
        },
        caiyun: {
          jixiong: "吉",
          title: "益卦显示此时财运好，是投资的好时机。同时在生意上会得到贵人的相助，双方都能获得很好的收益。要多听取长辈的建议，多与人沟通合作，这样生意上会进展得更加顺利。",
          info: "1、益卦占财运\n" +
            "吉。财运越来越好，物质财富会越来越丰富。\n" +
			 "\n" +
			  "2、益卦占生意开张\n" +
            "吉。贵人相助，开张大吉，生意兴隆，赢利较多。\n" +
			 "\n" +
			  "3、益卦占股市期货\n" +
            "吉。股市上涨，是投资的好时机。\n" +
			 "\n" +
			  "4、益卦占买卖交易\n" +
            "吉。买卖双方有默契，能顺利达成交易，并且双方都能从中获利。\n" 
        },
        shiye: {
          jixiong: "吉",
          title: "益卦显示运势亨通，同时还有贵人相助，只要把握好机会，或是与他人合作，一定会大有所为。但一定要保存好实力，切忌前期动力十足，后期没有动力，导致功亏一篑。",
          info: "1、益卦占事业\n" +
            "吉。事业运势将会不错，一切都很顺利。在工作中即使遇到问题，也会得到贵人的相助，所以一定要抓住时机，让自己有所作为。但注意开始时不要投入太大，以免后期的实力不足，要均衡发展。\n" +
			 "\n" +
			  "2、益卦占工作变动\n" +
            "吉。想要变动工作，现在是个不错的时机，可以有所行动了。\n" 
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "益卦占怀孕子女",
          info: "孩子多才多艺，得家人之喜欢。 胎孕方面，胎有不安，注意防惊吓之事，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "益卦，震为雷，巽为风，风烈则雷迅，雷激则风怒。即风雷相益。益者，增长。故益象征增益。为损上益下，象征统治者减损财富，使人民增益，即行损上益下之道，利于有所前往，排难涉险。",
          info: "考运不错，首先自身的资质很好，之前学习也很努力，准备得很充分，所以会取得不错的成绩。如果能注意与同学搞好关系，大家共同学习，相信成绩会更加理想。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "益卦，震为雷，巽为风，风烈则雷迅，雷激则风怒。即风雷相益。益者，增长。故益象征增益。为损上益下，象征统治者减损财富，使人民增益，即行损上益下之道，利于有所前往，排难涉险。",
          info: "考运不错，首先自身的资质很好，之前学习也很努力，准备得很充分，所以会取得不错的成绩。如果能注意与同学搞好关系，大家共同学习，相信成绩会更加理想。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "益卦占官司诉讼",
          info: "你方见理，但易遇到无官主事；宜妥善处理，防日后纠纷再起。"
        },
        jibing: {
          jixiong: "吉",
          title: "益卦占疾病",
          info: "可治愈，提防肝胆、肠胃之疾或性病等."
        },
        shiwu: {
          jixiong: "吉",
          title: "益卦占失物",
          info: "有望可寻回."
        },
        gupiao: {
          jixiong: "半吉半凶",
          title: "益卦占股票期货",
          info: "有升，对入市有利，但上升不稳."
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "益卦占出行",
          info: "有利可获。大胆外出行动"
        },
        xiaoxi: {},
        qita: {}
      }
  }, {
    zhuguaName: "泽天夬",
    hanyi: "夬卦代表决定或者缺失的意思，是一种状态卦。不同的事情有不一样的吉凶，预示，凡事不可拖延，一旦决定的事情就要及时执行，否则凶。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "夬卦象征着决断，所以是一个非常凶险的卦。在爱情或婚姻中，它表示恋人或夫妻双方都太任性，无论做什么事，总是以自我为中心，导致两个人相处非常困难。",
          info: "1、夬卦占恋情\n" +
            "十分凶险。  你们两个人容易经常吵架，总觉得对方做得不对。其实不是对方做得不对，而是你们都太以自我为中心，总是站在自己的个人立场上去看待问题。既然你们都不想让步，那恋情就不可能顺利发展了。\n" +
            "\n" +
            "2、夬卦占婚姻\n" +
            "十分凶险。  以你们的性格，走完爱情之路已经很不容易了，再想继续过幸福的婚姻生活还真有难度。不知道容忍，不懂得体谅对方，凡事都是以自我为中心，这样的婚姻必定不能维持长久。"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。在面临险境的时候，应果断做出决策，积极应对，犹豫不决则会招致灾祸。但同时要谨记，在处理问题的时候不要采用暴力等偏激的方式解决。冲突、纷争只会让问题更加恶化。",
          info: "1、夬卦占财运\n" +
            "凶。财运不济，平时做事要小心，以免受到他人的欺骗，而损失钱财。\n" +
            "\n" +
            "2、夬卦占生意开张\n" +
            "凶。不宜开张，最好耐心等待时机到来。\n" +
            "\n" +
            "3、夬卦占股市期货\n" +
            "凶。股市下跌严重，不会获得收益。\n" +
            "\n" +
            "4、夬卦占买卖交易\n" +
            "凶。商品交易过程中，双方有争执。此时尊重他人，讲诚信，才不会有利益上的损失。"
        },
        shiye: {
          jixiong: "凶",
          title: "夬卦是一个很凶险的卦，此时运势开始下滑，诸事不顺，处境险恶，要十分地小心谨慎。这个时候，一定注意不要得罪人或是为了利益做违法乱纪的事情，心存正念才不致惹祸上身。",
          info:"1、夬卦占事业\n" +
            "凶。事业运势走低，处境险恶，要小心谨慎才能最大限度地减少损失。特别要注意的是，在这个关键的时候不要做违法乱纪的事情或是得罪人，以免惹祸上身。\n" +
            "\n" +
            "2、夬卦占工作变动\n" +
            "凶。想要变动工作的朋友来说，现在不是个好时机，要慎重选择。\n" +
            "\n" +
            "3、夬卦占经商\n" +
            "\n" +
            "凶。市场正在走向衰落的状态，不宜大量活动，随时注意转向。开拓新领域时，加强同他人的合作。但务必充分注意别有用心的奸诈小人趁机捣乱和破坏。"
        },
        zinv: {
          jixiong: "凶",
          title: "夬卦占怀孕子女",
          info: "孩子非常任性，难以管教,注意平时管束引导。 胎孕方面，母胎宜节食物，且勿发怒气，否则有难产之虑，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "夬卦占考运",
          info: "这次幸运之神没有眷顾你，成绩不理想。原因是你对这次考试没有足够的重视，同时学习的侧重点与考题不符，所以要注意自己的心态和读书技巧。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "夬卦占求职",
          info: "求职运不佳，虽然你对找工作比较积极，但得到的应聘机会总是不多，而且大多不适合自己。注意在应聘过程中要和善友好，避免与人发生纷争。"
        },
        guansi: {
          jixiong: "凶",
          title: "夬卦占官司诉讼",
          info: "你方气盛，压制对方；这次诉讼，牵连证人比较多，耗费比较大；官司有救，适于和解。"
        },
        jibing: {
          jixiong: "凶",
          title: "夬卦占疾病",
          info: "容易有感冒风寒、四肢不协、头疼发热的症状发生；防腹痛或腹泻；病是内症，晚上加重。"
        },
        shiwu: {
          jixiong: "凶",
          title: "夬卦占失物",
          info: "相信失物已经损坏，不能寻回。"
        },
        gupiao: {
          jixiong: "凶",
          title: "夬卦占股市期货",
          info: "易倒V型，易出现涨跌分水岭，先升后跌，转势，注意逃顶。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "夬卦占出行",
          info: "不宜过于频繁，外出旅行吉利。"
        },
        xiaoxi: {},
        qita: {}
      }
  },
  {
    zhuguaName: "天风姤",
    hanyi: "这个卦是异卦（下巽上乾）相叠。乾为天，巽为风。天下有风，吹遍大地，阴阳交合，万物茂盛。姤（gǒu）卦与夬卦相反，互为综卦。姤即遘，阴阳相遇。但五阳一阴，不能长久相处。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "姤卦告诉大家对于完全没有缘分的人，应该远离，否则就会造成无谓的损失。在爱情或婚姻中，缘分并不是虚无缥渺的。没有缘分就不必要在他（她）身上花费过多的时间和精力，否则只会造成自己的精神损失。",
          info: "1、姤卦占恋情\n" +
            "十分凶险。 你们之间没有缘分，具体来说是对方对你没有一点兴趣。如果还是执迷不悟的话，努力注定只能是白费力气。但要想避免凶险，只需要转移目标就行了。\n" +
            "\n" +
            "2、姤卦占婚姻\n" +
            "十分凶险。卦辞中的“勿用取女”就清楚地决定了你们之间的关系。值得注意的是，虽然卦辞说的是“勿用取女”，但在这里男女都一样。你们的婚事基本上是成不了的，即使结婚，生活也不会幸福。\n" 
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，姤卦为凶，财运不济。事情表面看上去形势一片大好，但实际上潜伏着很多危机，潜在的危机不可忽视。还需提高警惕性，预先做好周密的部署，不能掉以轻心。",
          info: "1、姤卦占财运\n" +
            "凶。财运不佳，遇事会有阻碍。" +
            "\n" +
            "2、姤卦占生意开张\n" +
            "凶。不宜开张，否则经营会亏本，入不敷出。"+
            "\n" +
            "3、姤卦占买卖交易\n" +
            "凶。表面看有机会，但实际上困难重重，易遭遇意外的失败。"
        },
        shiye: {
          jixiong: "凶",
          title: "垢卦总给人一种很遗憾的感觉，因为明明在事业发展中遇到了很多的机会，可是最终却总是错过了，导致目标不能达成。所以在工作中一定要谨慎思考，不能掉以轻心，以免功败垂成。",
          info: "1、姤卦占事业\n" +
            "凶。事业发展不顺利，即使有机会但最终也很难抓住，让人感觉很遗憾。这主要是因为运气差了些，在做事过程中总会生出一些阻碍，而且机会也总是昙花一现，所以做事时一定要加倍地小心，面对机遇要及时地作出反应，以防错失良机。" +
            "\n" +
            "2、姤卦占工作变动\n" +
            "凶。想要变动工作，一定要三思，现在的情况不太乐观。"
        },
        zinv: {
          jixiong: "凶",
          title: "姤卦占怀孕子女",
          info: "孩子易性格古怪,注意平时管束引导。 胎孕方面，生产无惊阻，易生女孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "姤卦占学业考运",
          info: "凶。成绩或效果不理想，对自己的水平高估了或者说考题比预想要难。学业或考试结果让人比较失望。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "姤卦占求职",
          info: "凶。求职运不佳，虽然求职的机会并不少，对自己的表现也比较满意，但最终很难被录用。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "姤卦占官司诉讼",
          info: "对方想要求和，于你有利；诉讼牵连证人比较多，耗费比较大。"
        },
        jibing: {
          jixiong: "凶",
          title: "姤卦占疾病",
          info: "病情重，有恶化情况,宜及时就医。"
        },
        shiwu: {
          jixiong: "半吉半凶",
          title: "姤卦占失物",
          info: "尽快寻找，可失而得。失物似被重重物件压在最底部。"

        },
        gupiao: {
          jixiong: "半吉半凶",
          title: "姤卦占股票期货",
          info: "倒V型，盛阳遇阴，遭遇空头，先升后跌。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "姤卦占出行",
          info: "路上不顺或为行李所累或因风雨而阻。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "泽地萃",
    hanyi: "吉：得此卦者，运气大好，能得到贵人的帮助，获利丰厚，无往不利。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "本卦在爱情婚姻方面“相敬如宾”是形容夫妻二人亲密的关系的，互相尊敬不但是一种高尚的道德，而且是对夫妻双方的基本要求。对两个恋人来说，这种法则同样适用。在现实生活中，只要能做到这一点，婚恋一定不会有太多的麻烦。",
          info: "1、萃卦占恋情\n" +
            "比较吉利。 爱情是两个人的事情，所以要讲道德，做知情达理的人，对文明礼貌方面的事情做得比较到位，你们的爱情将会非常甜蜜，没有困难能难倒你们。\n" +
            "\n" +
            "2、萃卦占婚姻\n" +
            "比较吉利。 二人将来可以做到相敬如宾，只要彼此能互相尊重，就可以使婚姻长久地维持，而且是很好地维持。只要两个人齐心协力，就能把婚姻生活建设得幸福美满。"
        },
        caiyun: {
          jixiong: "吉",
          title: "本卦在财运方面，得到该卦，为吉，说明财运较旺。善于与他人接触，并放弃个人利益，与他人真诚合作，最终一定会有大的收获。不要孤立自己，积极寻找与自己目标相同的人一起合作，或是多听取朋友的建议，大家集思广益，事情进展得会更加顺利。",
          info: "1、萃卦占财运\n" +
            "吉。财运俱佳，得到的钱财会越来越多。\n" +
            "\n" +
            "2、萃卦占生意开张\n" +
            "吉。开张大吉，生意兴隆。\n" +
            "\n" +
            "3、萃卦占股市期货\n" +
            "吉。股市大涨，人气较旺。\n" +
            "\n" +
            "4、萃卦占买卖交易\n" +
            "吉。双方真诚合作，交易能顺利达成，并获得巨大的利润。"
        },
        shiye: {
          jixiong: "吉",
          title: "萃卦为聚集、汇集，广纳众人之智慧的意思，此时运势亨通、诸事顺利，又得长辈的提携，是大有所为的好时机。如果能上下和睦、团结一心，相互支持，就能大有收获。",
          info: "1、萃卦占事业\n" +
            "吉。事业运势不错，现在是天时、地利、人和，同时还能得到长辈的提携，不管是在人际还是工作方面都会比较顺利，如果能勤奋努力，会成就一番大事业。\n" +
            "\n" +
            "2、萃卦占工作变动\n" +
            "吉。想要变动工作，现在是个不错的时机，而且会有更好的发展。\n" +
            "\n" +
            "3、萃卦占经商\n" +
            "吉。真诚合作，团结互助。鼓励是事业兴旺发达的标志。大胆开拓市场，稳妥前进，有备无患，必可取得不断发展。"
        },
        zinv: {
          jixiong: "吉",
          title: "萃卦占怀孕子女",
          info: "孩子知书达礼，从小讲究文明礼貌。 胎孕方面，生产无惊阻，产母注意身体营养，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "萃卦，坤为地，性顺，兑为泽、性悦。泽居地上，即水在地上聚集成泽，滋润万物，为萃。故萃象征会聚。天下会聚，顺利亨通。德高望重者主持会聚必遵循正道，用大的牺牲祭祀祖先会吉祥，聚集使物资丰富，民心一致，可积极前进，从事大的事业。",
          info: "考运不错，会取得一个让人羨慕的好成绩，这主要归功于你平时的勤奋努力和考试前的充分准备。继续努力吧，你会有一个光明的前途的。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "萃卦，坤为地，性顺，兑为泽、性悦。泽居地上，即水在地上聚集成泽，滋润万物，为萃。故萃象征会聚。天下会聚，顺利亨通。德高望重者主持会聚必遵循正道，用大的牺牲祭祀祖先会吉祥，聚集使物资丰富，民心一致，可积极前进，从事大的事业。",
          info: "求职运不错，可以找到一个满意的职位，中间会得到贵人的相助或是长辈推荐工作，如果自己更加努力，找工作会更加顺利。"
        },
        guansi: {
          jixiong: "吉",
          title: "萃卦占官司诉讼",
          info: "你方气盛，压制对方，但总体宜解不宜结。"
        },
        jibing: {
          jixiong: "凶",
          title: "萃卦占疾病",
          info: "病症多是旧疾，病情不安；病是内症，晚上加重，凶象，宜速诊治。"
        },
        shiwu: {
          jixiong: "吉",
          title: "萃卦占失物",
          info: "多半能失而复得。"
        },
        gupiao: {
          jixiong: "吉",
          title: "萃卦占股市期货",
          info: "易股市大涨，多头入市,人气较旺。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "半吉半凶",
          title: "萃卦占出行",
          info: "虽易有小插曲，但总体利于出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "地风升",
    hanyi: "地风升卦为吉卦：得此卦者，运气升腾，诸事皆积极向上发展，谋事有成，名利双收。代表事情会越来越旺。象征树木从地上不断向上，有进升之势。升腾上进，畅行其志；出暗向明，遂渐升进。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "升卦意味着上升、升级，从恋爱到婚姻就是一个升级的过程。你们的感情会不断上升，直到完成从恋爱到婚姻的变化，良好的感情是爱情上升到婚姻的保证。",
          info: "1、升卦占恋情\n" +
            "大吉大利！ 几乎没有阻碍。从互相认识，到确立恋爱关系，再到结婚，几乎是一帆风顺。随着恋情的上升，很快就会从恋爱“上升”到谈婚论嫁的髙度。\n" +
            "\n" +
            "3、升卦占婚姻\n" +
            "大吉大利！几乎没有阻碍。六爻就清楚地说明了上升的情况，至于上升的是什么，在不同的情况下可以有不同的理解。它可以是地位上升、身份上升，也可以是才能和技艺水平上升。当然，对婚恋之事来说，是感情的上升。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。平时做事抓住时机，注意循序渐进，就一定会大有收获。切记光有好的时机还不够，做事一定要小心谨慎、按部就班地进行，不可急功近利。多听取长辈的建议，可少走很多弯路。",
          info: "1、升卦占财运\n" +
            "吉。财源广进，形势大好，会得到越来越多的钱财。\n" +
            "\n" +
            "2、升卦占生意开张\n" +
            "吉。开张大吉，按部就班进行，能获大利。\n" +
            "\n" +
            "3、升卦占股市期货\n" +
            "吉。股市会慢慢上涨。\n" +
            "\n" +
            "4、升卦占买卖交易\n" +
            "吉。不要急躁，交易双方逐渐建立起互信的关系，都会从中获利。"
        },
        shiye: {
          jixiong: "吉",
          title: "升卦预示着步步高升、稳健成长。此卦表示凡事只要按部就班地去做，就会有成功的机会。重要的是要踏踏实实，一步一个脚印儿，长期坚持下去，就会步步高升。",
          info:"1、升卦占事业\n" +
            "吉。事业运势转旺，各方面进展都很顺利，而且会得到贵人的相助，事业、工作、人际方面都会有很大的进展。但是运势刚刚转旺，不可过于急躁，一切都要按部就班地慢慢来，同时要多听长辈的建议。\n" +
            "\n" +
            "2、升卦占工作变动\n" +
            "吉。想要变动工作，现在可以行动了，但不可过于心急。\n" +
            "\n" +
            "3、升卦占经商\n" +
            "吉。遵守商业道德，从小处着手，逐渐开拓，通过自己的勤劳，真诚竞争，稳重为好，切莫冒失而成大错。"
        },
        zinv: {
          jixiong: "吉",
          title: "升卦占怀孕子女",
          info: "孩子有强烈的上进心。 胎孕方面，孕期不宜修造动土，以免动胎气，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "升卦占考运",
          info: "你的成绩会有一个逐步的提高，这让周围的人都很高兴。要继续努力啊，不要松懈，平时注意和老师、同学多沟通，多交流。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "升卦占求职",
          info: "可以顺利地找到自己理想中的工作，这和自己的努力是分不开的。另外，在求职过程中你还可能得到长辈的推荐，这就使你的求职之路变得更加顺利了。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "升卦占官司诉讼",
          info: "双方皆有部分道理；事有转机，易多次审讯；宜于双方和解。"
        },
        jibing: {
          jixiong: "凶",
          title: "升卦占疾病",
          info: "容易有咳嗽虚怯、气喘痰多、外伤牙痛的症状发生；病情两处，内伤外感；须防病在胸部，胸肋竹痛；目前无药可医或药效不显，病情重。"
        },
        shiwu: {
          jixiong: "凶",
          title: "升卦占失物",
          info: "不易寻回，失物有被束之高阁的可能。"
        },
        gupiao: {
          jixiong: "吉",
          title: "升卦占股市期货",
          info: "股市会慢慢上涨，前景看好，走势分明。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "升卦占出行",
          info: "总体比较顺利，利于出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "泽水困",
    hanyi: "泽水困卦的外卦为兑，代表沼泽；内卦为坎，代表水。泽与水连在一起，好像是水多的样子，其实水在泽的下面，泽中恰好没有水。所以困卦象征着困境。就像初六爻辞所说，人困在深山老林里，三年不能出来，陷入一种困境。但是困境早晚可以成为过去，顺境早晚会到来。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "困卦是一个不吉利的卦，从它的名字上也可以看出来。如果占卜得到了困卦，你就不要希望婚恋之事有多顺利了，而是应该充分做好心理准备，迎接马上就会到来的挑战。能不能战胜所有的困难，要看你们的决心和勇气。",
          info: "1、困卦占恋情\n" +
            "凶 。 不顺利，挫折太多。困卦代表你的恋爱道路将充满困难或挑战，会遇上很多困难。感情要经过很多的挫折。既然困难不可避免，就只能去勇敢面对它们。\n" +
            "\n" +
            "3、困卦占婚姻\n" +
            "凶 。 困卦说明你们的婚姻将要遇到的困难来自各个方面，所以不可能一劳永逸地解决所有问题。接踵而来的困难是对你们感情的重大考验。"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。此时你会感到困顿无助，有破财之兆。当人生陷入困境的时候，不能轻举妄动，而应忍辱负重，待时机好转后，再采取行动。当处于事业的低潮期时，正好可以养精蓄锐，暗中提髙自己的专业知识或是竞争力，这样当时机来临时，正好可以大有作为。",
          info: "1、困卦占财运\n" +
            "凶。财运不济，有破财的危险，甚至会负债累累。\n" +
            "\n" +
            "2、困卦占生意开张\n" +
            "凶。困难重重，不宜开张。\n" +
            "\n" +
            "3、困卦占股市期货\n" +
            "凶。股市一直持续不断地下跌。\n" +
            "\n" +
            "4、困卦占买卖交易\n" +
            "凶。困顿无助，交易不顺利，这个时候，不能冒进。"
        },
        shiye: {
          jixiong: "凶",
          title: "困卦的含义是困顿、无助，此时运势衰退，诸事不顺利。处于人生的低潮期时，不要贸然采取行动，暂时退让也是一种智慧。在此阶段正好可以养精蓄锐，提升自我，以待时机。",
          info:"1、困卦占事业\n" +
            "凶。事业运势不好，此时诸事不顺、进退两难。因为时机不好，所以不要贸然采取行动，越积极行动，损失就会越大。现在最好的选择就是采取守势，静待时机。\n" +
            "\n" +
            "2、困卦占工作变动\n" +
            "凶。想要变动工作，现在不是个好时机，最好不要采取行动。\n" +
            "\n" +
            "3、困卦占经商\n" +
            "凶。面临激烈竞争，很有破产的可能。切勿失望，而应在困境中奋斗。总结教训，重新奋起，但也不宜浮躁，应缓慢而进。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "困卦占怀孕子女",
          info: "孩子懂得勤俭节约，易劳碌命格。 胎孕方面，生产无惊阻，比较平安顺利，易生女孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "困卦，坎为水，兑为泽，水在泽下，泽中无水，干涸，为困。困象征困穷。君子处困之时，能努力自济必顺利亨通，只有持正之德高望重者才能获吉而无灾难。此时所言必难取信于人，当多修己德，少说为佳。",
          info: "考试成绩不理想，因为自身的准备不充分，自信心不足。所以不要怪考运不好了，自身的努力最重要，好好加油吧。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "困卦，坎为水，兑为泽，水在泽下，泽中无水，干涸，为困。困象征困穷。君子处困之时，能努力自济必顺利亨通，只有持正之德高望重者才能获吉而无灾难。此时所言必难取信于人，当多修己德，少说为佳。",
          info: "求职不顺利，本来应聘的机会就不多，再加上自己的实力不强，准备也不充分，所以谋得职位的机会很少。注意平时要好好充实自己，提升自己的职业技能。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "困卦占官司诉讼",
          info: "你方见理，凡事不宜过于执着，宜妥善处理，防日后纠纷再起。"
        },
        jibing: {
          jixiong: "凶",
          title: "困卦占疾病",
          info: "容易有心发热，口干舌燥，或毒疮的症状发生；病是内症，晚上加重；病在胸部，容易有心痛的症状发生，危重之象，注意及时就医。"
        },
        shiwu: {
          jixiong: "凶",
          title: "困卦占失物",
          info: "不能寻回。"
        },
        gupiao: {
          jixiong: "凶",
          title: "困卦占股市期货",
          info: "股市一直持续不断地下跌，市场低迷，毫无生机。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "困卦占出行",
          info: "总体不利出行，谨慎考量。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "水风井",
    hanyi: "水风井卦之，井：代表小水之源，有滋养生命的能力，但是井水显然力量有限，凡事量力而行，此卦为小吉。得此卦者，宜修身养性，顺其自然，泰然处之，静有利，动则凶。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "井卦中的古井就是恋人或夫妻之间感情的象征，没有人的维护，古井就会干枯；没有真心的付出，感情之井也会干枯。所以要努力维护好你们心中的那口古井.",
          info: "1、井卦占恋情\n" +
            "先凶后吉。 你们的恋情就像井一样，需要用爱心不断为其增加源泉。年轻人的心往往是不专一的，爱情经不起太长久的等待，长时间不维护自己心中的那口“井”，它就会干枯。真心付出就是提供井水的源泉。\n" +
            "\n" +
            "2、井卦占婚姻\n" +
            "先凶后吉。 如果说在恋爱过程中你们经历了古井由干枯到重新出水的变化，那么结婚后就需要维护好你们心中的那口井，不要让它再次干枯。少为自己考虑，多为对方付出，井水才能长久不枯。"
        },
        caiyun: {
          jixiong: "凶",
          title: "井卦有超出能力付出的意思。井卦的财运不太好，本卦显示你的投入在短期内不会得到满意的回报，辛苦的付出可能得不到收获。不要灰心，从长远来看，你今日的付出一定不会白费的。",
          info: "1、井卦占财运\n" +
            "凶。财运不佳，平时应多注意钱财的积累，不要过度消耗，以免入不敷出。\n" +
            "\n" +
            "2、井卦占生意开张\n" +
            "凶。眼下不宜开张，最好再等待一段时间。餐饮业较佳。\n" +
            "\n" +
            "3、井卦占股市期货\n" +
            "凶。股市停滞，没有上涨的趋势。\n" +
            "\n" +
            "4、井卦占买卖交易\n" +
            "凶。短期之内不会有太满意的结果，要耐心等待。"
        },
        shiye: {
          jixiong: "凶",
          title: "井卦为凶中带吉之卦，付出本来是正常的，但付出也要量力而行，不能超出自己的能力范围之外，况且现在的时运不佳，付出才有收获，所以付出也要有节制。",
          info: "1、井卦占事业\n" +
            "凶。事业运势不佳，目标短时间内难以实现。虽然自己工作很努力，但收获却不大。不要太在意自己的辛苦付出，你要相信今日的付出不会白白浪费的，日后一定会得到回报。\n" +
            "\n" +
            "2、井卦占工作变动\n" +
            "凶。想要变动工作的朋友，要三思而行，现在还不宜有所行动。\n" +
            "\n" +
            "3、井卦占经商\n" +
            "\n" +
            "凶。市场情况不太好，继续本着勤劳、奋进的精神，诚心诚意地开拓市场，特别注意与人的合作，在实践活动中丰富和积累经验。"
        },
        zinv: {
          jixiong: "凶",
          title: "井卦占怀孕子女",
          info: "孩子从小很懂生活，但注意防血光。 胎孕方面，防产母有灾，求佛及家神则安，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "本卦启示人们，井是生命之源，只有不断地维护，才能源源不断地涌出泉水。人的潜能也是如此，只有不断地积累、挖掘，才能拥有无穷的力量与灵感。在学习与工作中，要不断地充实自己，不要将有限的精力浪费在一些无谓的琐事上，只有不断地提升自己，你才有能力壮大自己，同时有能力给予、付出。",
          info: "虽然平时也比较努力，但成绩不是很理想。这主要是因为你没有把精力全部放在学习上，生活中的一些琐事让你无法集中精力读书。相信你只要能摒除这些杂念，成绩一定会有很大进步。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "本卦启示人们，井是生命之源，只有不断地维护，才能源源不断地涌出泉水。人的潜能也是如此，只有不断地积累、挖掘，才能拥有无穷的力量与灵感。在学习与工作中，要不断地充实自己，不要将有限的精力浪费在一些无谓的琐事上，只有不断地提升自己，你才有能力壮大自己，同时有能力给予、付出。",
          info: "求职运不太好，找工作四处碰壁，但这从另外一个方面也为你积累了不少的经验。试着降低一下自己的求职标准，好好表现，一定可以找到一个比较满意的工作。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "井卦占官司诉讼",
          info: "你方气盛，压制对方；你方见理；事有转机，多次审讯；须防日后纠纷再起。"
        },
        jibing: {
          jixiong: "凶",
          title: "井卦占疾病",
          info: "病情较重且拖延，可能复发。"
        },
        shiwu: {
          jixiong: "凶",
          title: "井卦占失物",
          info: "不能寻回。"
        },
        gupiao: {
          jixiong: "凶",
          title: "井卦占股市期货",
          info: "股市停滞，没有上涨的趋势，珠落深渊，守静安常。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "井卦占出行",
          info: "出行须防酒色，防贪杯误事，总体不利出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "泽火革",
    hanyi: "泽火革卦运势：大胆突破，危机即是转机。意味着创新、突破。此时局势不稳定、千变万化，工作、事业、人际等各方面都可能有大的变动。但危机同时也是事业发展的转机，如能抓住这个转机也会有大的发展。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "革卦象征着变革、革新。和其他许多事物一样，爱情或婚姻也需要变革。对于不符合时代特征的东西，要坚决剔除；对于顺应时代潮流的东西，要发扬光大。",
          info: "1、革卦占恋情\n"+
			  "半吉半凶 。你们的恋情会充满了变化，不拘泥于一种模式，这种变化有好的一方面，也有时会起到负面效果。\n"+
			  "\n"+
			  "2、革卦占婚姻\n"+
			  "半吉半凶 。变革精神在生活中也能发挥巨大作用，它可以让你们的生活更加丰富多彩，不至于让人感到单调和厌烦。但可能会出现一些节外生枝的麻烦事，应冷静处理。\n"
        },
        caiyun: {
          jixiong: "半吉半凶",
          title: "占财运，革卦为吉，说明财运较旺。顺应时势的变化，充满热情、积极地进行创新与改革，这能大大提升自己的运势。但心理承受能力差、不喜欢变数的人，还是不要轻易突破。",
          info: "1、革卦占财运\n" +
            "半吉。目前财运并不旺，但调整或改变做事的方法后，能实现得财愿望" +
            "\n" +
            "2、革卦占生意开张\n" +
            "半吉。最好更换或调整下地点再开张"+
            "\n" +
            "3、革卦占买卖交易\n" +
            "半吉。交易洽谈要运用有创意、弹性灵活的方法，双方才能顺利成交。"
        },
        shiye: {
          jixiong: "半吉半凶",
          title: "革卦意味着创新、突破。此时局势不稳定、千变万化，工作、事业、人际等各方面都可能有大的变动。但危机同时也是事业发展的转机，如能抓住这个转机也会有大的发展。",
          info: "1、革卦占事业\n" +
            "平。事业的发展面临着很大的变动，这种变动令人不安，但你要看到这种看似危机的变动其实还隐藏着很大的契机呢，要努力突破自己的观念，用变革的态度来应对变动。" +
            "\n" +
            "2、革卦占工作变动\n" +
            "半吉。如想变动工作，现在是个时机，会有意想不到的收获。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "革卦占怀孕子女",
          info: "孩子有变革精神，易外地工作与父母聚少离多。 胎孕方面，生产无惊阻，比较平安顺利，易生女孩。"
        },
        xueye: {
          jixiong: "半吉半凶",
          title: "革卦占考运",
          info: "半吉。成绩中等但忽高忽低，太不稳定。要试着改变自己的学习方式，向其他同学请教，才能改变之前的状态。"
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "革卦占求职",
          info: "平。求职运一般，中意的工作得不到，被录用的工作不喜欢。要注意改变之前的应聘思路，才能称心如意。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "革卦占官司诉讼",
          info: "官司可能会经历两处反复后结案；诉讼牵连证人或证据比较多，耗费比较大；防止对方与证人合谋害你；官方可能会不认可你的说法，打官司消耗很大。"
        },
        jibing: {
          jixiong: "凶",
          title: "革卦占疾病",
          info: "病易在胸部，饱闷不宽,病情多变，宜改换求医方法。"
        },
        shiwu: {
          jixiong: "半吉半凶",
          title: "革卦占失物",
          info: "因有弃旧迎新之意，故一把不能寻回。"
        },
        gupiao: {
          jixiong: "半吉半凶",
          title: "革卦占股票期货",
          info: "平。转势，题材挖尽，转变策略"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "革卦占出行",
          info: "出行顺利。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "火风鼎",
    hanyi: "火风鼎卦为吉卦。鼎：代表三足而立，三人而行，平稳之势。能得到朋友的帮助，事情很容易取得成就，更利于合伙。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "鼎卦象征着稳重与现实。在爱情或婚姻中，浪漫的情调固然需要，但是也要照顾到物质基础。没有物质基础的浪漫是不切实际的，也不可能长久地维持下去。",
          info: "1、鼎卦占恋情\n" +
            "比较吉利 。 恋情一开始玩的是“浪漫派”，不能只顾浪漫而忽略现实，会有波折。这样的恋情虽然很幸福，却没有可持续性，会遇到很大的阻力，需要转变。\n" +
            "\n" +
            "2、鼎卦占婚姻运势\n" +
            "大吉大利 。在经过了恋爱期间的浪漫与现实的转变之后，在婚姻生活中，你们能处理好浪漫与现实的关系，所以日子过得虽然平淡，但十分幸福。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。遇事有他人相助，会大有收获。善于整合、集结众人的智慧，才能得到志同道合的朋友的支持，大家的鼎力支持，可助你一路顺畅。财运大好时，切忌得意忘形，以诚待人、以礼待人是时刻要遵守的做人行事准则。",
          info: "1、鼎卦占财运\n" +
            "吉。财运俱佳，就好像是风助火势一样，能顺利得到钱财。\n" +
            "\n" +
            "2、鼎卦占生意开张\n" +
            "吉。开张大吉，餐饮业赢利更多。\n" +
            "\n" +
            "3、鼎卦占股市期货\n" +
            "吉。股市上涨，其中最热门的就是食品股。\n" +
            "\n" +
            "4、鼎卦占买卖交易\n" +
            "吉。双方合作愉快，交易能顺利达成，如果求助亲友或朋友，能获取更大的利润。"
        },
        shiye: {
          jixiong: "吉",
          title: "鼎卦运势亨通，一路顺畅，如能听从贵人的建言，集众人之力，可开创事业，名利双收。但佳运来临之际切忌得意忘形，目中无人，以免陷入纷争。",
          info: "1、鼎卦占事业\n" +
            "吉。事业运极佳，又可以得到长辈的提携，事业发展可谓一路顺畅。如能与人合作，集众人之力，可大有作为，名利双收。注意身处高位也要以礼待人，避免与人发生纷争。\n" +
            "\n" +
            "2、鼎卦占工作变动\n" +
            "吉。想要变动工作的朋友，现在可以有所行动了，会有更好的发展。\n" +
            "\n" +
            "3、鼎卦占经商\n" +
            "吉。经过一番奋斗，已经可以比较顺利地发展商业活动，遇到困难也能够克服。倘若坚持商业道德，参与正常竞争活动，商业可大发展。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "鼎卦占怀孕子女",
          info: "孩子性格乐观开朗。 胎孕方面，母子不安,卦有虚惊之凶象，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "火风鼎，外卦为火，内卦为风。火在上，风在下，烈火之下有风助势，会越来越旺。从人际方面看，外卦为火，代表一方有激情和智慧；内卦为风，代表另一方愿意辅助、支持。象征着双方配合默契，一方有智慧和能力，另一方可以完美配合，双方的密切合作、相互帮助，使事情进展得很顺利。",
          info: "考运不错，会取得优异的成绩。你这次的好成绩和你平时的努力是分不开的，继续努力，金榜题名是不成问题的。但是不要太骄傲，如果掉以轻心，好运也不会眷顾你的。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "火风鼎，外卦为火，内卦为风。火在上，风在下，烈火之下有风助势，会越来越旺。从人际方面看，外卦为火，代表一方有激情和智慧；内卦为风，代表另一方愿意辅助、支持。象征着双方配合默契，一方有智慧和能力，另一方可以完美配合，双方的密切合作、相互帮助，使事情进展得很顺利。",
          info: "求职运很好，可以顺利地找到一个满意的工作，这中间会遇到贵人的相助，要多听长辈的提醒和建议。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "鼎卦占官司诉讼",
          info: "诉讼中易对方态度强势，这次诉讼你易占劣势,宜和解了事。"
        },
        jibing: {
          jixiong: "半吉半凶",
          title: "鼎卦占疾病",
          info: "病情有变，但无大碍。"
        },
        shiwu: {
          jixiong: "半吉",
          title: "鼎卦占失物",
          info: "过一段时间可寻回，但有可能破损或变形。"
        },
        gupiao: {
          jixiong: "吉",
          title: "鼎卦占股市期货",
          info: "股市上涨，选政策引导行业可获大利。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "半吉",
          title: "鼎卦占出行",
          info: "无重大事情不宜外出。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "震为雷",
    hanyi: "此卦代表奋发图强，先苦后甜，凡事需要经历风雨才能见彩虹。此卦为小吉。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "爱情或婚姻中有时会遇到难以越过的障碍，像震卦表示的那样，障碍可能连续有许多个。如果遇到了这样的情况，就要调整自己的心态，坦然接受这个事实。一个好的心态，可以帮你集中力量去解决问题。",
          info: "1、震卦占恋情\n" +
            "十分凶险。  在恋爱的开始阶段，总是充满了变动，这些变动可能是由于外部的干扰引起的，也可能是由你们两个人的三心二意引起的。对于这些变动，如果没有办法阻止它们发生，就要从心理上将它们看得平淡一些。\n" +
            "\n" +
            "2、震卦占婚姻\n" +
            "十分凶险，挫折连连。 你们的婚事将会发生很多阻碍，但无论哪种阻碍，最好的应对方式就是提前预防。实在无法预防的，就要用平和的心态去看待，做到处变不惊、临阵不惧。"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。此时是多事之秋，凡事都不能急躁，否则会有意外发生，急躁冒进无财运。改变急躁的性格，多向智者请教，财运之路会更加顺畅。",
          info: "1、震卦占财运\n" +
            "凶。 当前财运不佳，此时应振作精神，积极行动，但要做到经常反思、总结，各项事情就都能顺利进行。\n" +
            "\n" +
            "2、震卦占生意开张\n" +
            "半吉。 可以开张，但做事还需谨慎，以免有失误。\n" +
            "\n" +
            "3、震卦占股市期货\n" +
            "股市慢慢上涨，多吸取自己或他人以往失败的教训，慎重投资，就能获利。\n" +
            "\n" +
            "4、震卦占买卖交易\n" +
            "商业经营刚刚起步，做事不要过于急躁，有了成就，也不沾沾自喜，小心谨慎，终能获大利。"
        },
        shiye: {
          jixiong: "凶",
          title: "本卦显示此时为多事之秋，危机四伏，意外事故频发，要小心谨慎。万事不可急功近利，要注意人际关系的和谐，多向智者请教，避免与人纷争。",
          info: "1、震卦占事业\n" +
            "凶。事业发展不顺利，意外状况时有发生。做事的成效不大，收获不多，而且时局时有变动。要注意稳住情绪，不要过于急躁，做事要有恒心，不要虎头蛇尾，同时要多听取长辈的建议。\n" +
            "\n" +
            "2、震卦占工作变动\n" +
            "凶。想要变动工作，现在时机还可以，但不要过于冒险。\n" +
            "\n" +
            "3、震卦占经商\n" +
            "凶。在激烈的商场竞争中，随时可能出现问题，陷入困境。冷静、从容地应付到来的现实，从容不迫地去战胜困难。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "震卦占怀孕子女",
          info: "孩子性格朴实而坚强。 胎孕方面，孕妇注意安胎，产母不宜出外游，临产妇得之无碍，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "本卦启示人们，生活中总会遇到一些变动，不用感到震惊，也不用过于急躁，调整好自己的心态，多向长辈请教，坦然面对，事情会有转机的。在学习与工作中，出现一些新情况是常有的事，要有这种心理准备，尽量克制自己急躁的脾气。",
          info: "成绩不理想，要试着改变自己浮躁的现状，你有一定的实力，只要按部就班、踏踏实实地学习，会取得更好的成绩。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "本卦启示人们，生活中总会遇到一些变动，不用感到震惊，也不用过于急躁，调整好自己的心态，多向长辈请教，坦然面对，事情会有转机的。在学习与工作中，出现一些新情况是常有的事，要有这种心理准备，尽量克制自己急躁的脾气。",
          info: "求职不顺利，这跟运气的关系不大，主要是没有耐性，每次准备应聘都是开始很积极，不长时间就没激情了。要注意耐住性子，慢慢来，与人和谐沟通，只要克服了自身的一些毛病，就一定有机会找到满意的工作。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "震卦占官司诉讼",
          info: "双方皆有部分道理；宜于双方和解，官司剑拔弩张，但会较为迅速地判决。"
        },
        jibing: {
          jixiong: "凶",
          title: "震卦占疾病",
          info: "如果最近得的病，很快就能好转；如病已经有几个月了，那么有加重的可能；疾病会在白天加重，宜多加注意；须防病在胸部，胸肋骨痛。"
        },
        shiwu: {
          jixiong: "凶",
          title: "震卦占失物",
          info: "尝试于会发声的东西或电器处寻找。"
        },
        gupiao: {
          jixiong: "凶",
          title: "震卦占股市期货",
          info: "震荡，大副震荡，惊吓，迅雷不及掩耳。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "震卦占出行",
          info: "总体顺利，注意防范贪杯误事。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "艮为山",
    hanyi: "此卦含义为：卸掉责任，挂笏隐退，放弃名利远走高飞，躲避灾祸之意。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "有些事情是不应该做的，君子要有所为有所不为，适可而止是一种高明的智慧。在爱情或婚姻中，要学会有所不为、适可而止的智慧。",
          info: "1、艮卦占恋情\n" +
            "不太顺利。 恋情的发展就像一个喝醉的人走路，不但走走停停，而且东倒西歪，难以走上正路。原因是对恋爱的要求太多，现在还没到应该提出这些要求的时候，要求多了反而什么也得不到。\n" +
            "\n" +
            "2、艮卦占婚姻\n" +
            "不太顺利。婚姻生活是两个人互相奉献、互相付出的过程，如果索取较多而付出较少，婚姻生活中充满了坎坷和阻力，婚姻生活就会变得十分坎坷。"
        },
        caiyun: {
          jixiong: "凶",
          title: "艮卦代表前方有阻碍，诸事不顺，此时应广泛接受他人的意见，积极寻求帮助，制定对策，以尽快走出困境。注意财运不济时，不要贸然地投资或交易，小心谨慎才能走得更顺利。",
          info: "1、艮卦占财运\n" +
            "凶。财运不济，几乎没有得财的机会。" +
            "\n" +
            "2、艮卦占生意开张\n" +
            "凶。此时开张不吉。"+
            "\n" +
            "3、艮卦占买卖交易\n" +
            "凶。交易问题多，波折多,双方交易难以达成。"
        },
        shiye: {
          jixiong: "凶",
          title: "艮卦是两座山重叠在一起，表示阻碍，困难重重。此时运势衷退，工作处于低潮期，目标难以达成。现在要做的就是养精蓄锐，好好充实自己，等时机来临时再作行动。",
          info: "1、艮卦占事业\n" +
            "凶。运势停滞，事业发展受阻，目标难以达成。此时不要有什么举动，投资或是拓展的计划都要暂缓，如果贸然前行只会加重损失。" +
            "\n" +
            "2、艮卦占工作变动\n" +
            "凶。此时运势不佳，不宜变动，建议静待时机。"+
            "\n" +
            "3、艮卦占经商\n" +
            "\n" +
            "凶。进入停滞不前的状态，切勿盲目冒进，而宜适时停止，进入安静退守，不要受外界干扰，尤其是应该保持内心和理智上的宁静，更不要轻易与他人合作。"
        },
        zinv: {
          jixiong: "凶",
          title: "艮卦占怀孕子女",
          info: "孩子自制力比较强，但子女多有不和。 胎孕方面，母子不安,卦有难产虚惊之凶象，建议大医院孕产，易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "艮卦占学业",
          info: "考运差，自身的努力不够，成绩不能让人满意。要注意多向老师和同学请教，改变自己的学习方法。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "艮卦占求职",
          info: "竞争比较激烈，求职机会不多，很难找到合适的工作。平时要注意充实自己的实力，多学习一下面试时的沟通技巧，等机会来临时就可以好好把握了。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "艮卦占官司诉讼",
          info: "要防范因小事而化大，宜和解。"
        },
        jibing: {
          jixiong: "凶",
          title: "艮卦占疾病",
          info: "难治，注意肠胃血管硬化及结核病。"
        },
        shiwu: {
          jixiong: "吉",
          title: "艮卦占失物",
          info: "可以寻回，但要等一段时间。藏在家中、旅馆、寺院、山中某处。"
        },
        gupiao: {
          jixiong: "凶",
          title: "艮卦占股票期货",
          info: "阻力大，难进退，谨慎进入。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "艮卦占出行",
          info: "不宜出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "风山渐",
    hanyi: "此卦代表循序渐进，积少成多；越来越好，欲速则不达之意。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "渐卦代表循序渐进、逐步发展。感情的发展是一个循序渐进的过程，相识、相爱、结婚是婚恋过程中三个不可缺少的基本步骤。用心去经营，总是会前进的，最后一定能到达希望的终点。",
          info: "1、渐卦占婚恋\n" +
            "比较吉利 。感情的发展不可操之过急，过程中有时出现小挫折，就像一辆车在不平的道路上前进，有时快有时慢，有时会停下来，但是早晚可以到达终点。\n" +
            "\n" +
            "2、渐卦占婚姻\n" +
            "比较吉利。本卦的爻辞用了一只鸿雁的前进过程，说明了婚事的发展过程。鸿雁从湖边开始，经过石头、陆地、大树、丘陵，最后落到山顶上，象征着婚事的一步步发展。但是发展过程是有曲折的，并不是越来越好。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。耐心是金，平时做事不急于求成，按部就班，循序渐进，终能取得成功。要注意，你的付出可能需要较长的时期才能看到回报，所以不要一次投入太多资金，以防资金周转不灵。",
          info: "1、渐卦占财运\n" +
            "吉。财运较旺，但要注意丰厚的财富是渐渐积累起来的。\n" +
            "\n" +
            "2、渐卦占生意开张\n" +
            "吉。做事不要着急，慢慢筹备，就可开张。\n" +
            "\n" +
            "3、渐卦占股市期货\n" +
            "吉。股市会慢慢上升。\n" +
            "\n" +
            "4、渐卦占买卖交易\n" +
            "吉。买卖开始并不顺利，但不断努力，转机就会慢慢出现。"
        },
        shiye: {
          jixiong: "吉",
          title: "渐卦为逐渐成长，循序渐进的意思。此时好运逐渐展开，同时会有贵人相助，要把握好时机，一步一步、踏踏实实地往前走，只有打好根基，才能不断地取得成功。",
          info:"1、渐卦占事业\n" +
            "吉。事业运势逐渐上升，好运会接踵而来，而且会有贵人的相助。但此时还不到运势最好的时候，不要急躁，做事要循序渐进，不可掉以轻心。\n" +
            "\n" +
            "2、渐卦占工作变动\n" +
            "吉。想要变动工作，现在是个不错的时机，最好是提前做好计划。\n" +
            "\n" +
            "3、渐卦占经商\n" +
            "吉。正处在稳步向前发展的阶段，定要把握时机，既不可盲目乐观，也不要停步不前，而应采取逐步前进的策略，量力而行。"
        },
        zinv: {
          jixiong: "吉",
          title: "渐卦占怀孕子女",
          info: "孩子做事有条有理，将来有成就。 胎孕方面，生产无惊阻，比较平安顺利，易生女孩。"
        },
        xueye: {
          jixiong: "半吉半凶",
          title: "渐卦占考运",
          info: "成绩还可以，属于中等偏上，但是离你的期望值可能还有一段距离。不要太着急，成绩的提高要慢慢来，只要不断地努力就会有提高的."
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "渐卦占求职",
          info: "是否能求职成功就要看你的努力了，只要有耐心，不断地努力，就会找到满意的工作；如果不能坚持，半途而废就会错失良机."
        },
        guansi: {
          jixiong: "吉",
          title: "渐卦占官司诉讼",
          info: "你方气盛，压制对方；诉讼牵连人或证比较多，耗费比较大；官司有救，宜据理力争可胜。"
        },
        jibing: {
          jixiong: "凶",
          title: "渐卦占疾病",
          info: "疾病会在白天加重，宜多加注意；易有茶饭不思，病情恶化之象。"
        },
        shiwu: {
          jixiong: "凶",
          title: "渐卦占失物",
          info: "多数不能寻回。"
        },
        gupiao: {
          jixiong: "半吉半凶",
          title: "渐卦占股市期货",
          info: "慢牛或阴跌，渐上升，逐步介入。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "渐卦占出行",
          info: "这次出行平安顺利，即使有危险，也能得到帮助。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "雷泽归妹",
    hanyi: "得此卦者，困难之时，做事有违常理，灾祸不断。宜明察事理，修身养性，断绝妄念。测情感之事一般为不吉之象。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "归妹卦提示恋人或夫妻双方要各守本分，两个人互相用情专一，是爱情或婚姻稳定的基本保证。如果出现了第三者，那么爱情或婚姻肯定会受到影响，甚至被完全破坏掉。",
          info: "1、归妹卦占恋情\n" +
            "凶 。代表有人有三心二意、用情不专一，既不想放弃身边的人，又总希望遇到一个更好的人。这样的恋情会酿下苦酒，让三心二意的人自己喝下。\n" +
            "\n" +
            "2、归妹卦占婚姻\n" +
            "凶 。 婚姻中很可能出现第三者，第三者是婚姻的大敌，一旦出现，就会影响家庭生活的稳定，甚至出现家庭危机或走向离婚，会破坏掉本来幸福的婚姻。"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。在新的环境中，要放下身段，接受纪律、规范的约束，并学会配合他人做事，这样有利于提升自己的运势。注意千万不可从事非法交易，以免触法，后悔终生。",
          info: "1、归妹卦占财运\n" +
            "凶。财运不稳，最初进财，但其后却有破财的危险。\n" +
            "\n" +
            "2、归妹卦占生意开张\n" +
            "凶。个人运势由吉转凶，不宜开张。\n" +
            "\n" +
            "3、归妹卦占股市期货\n" +
            "凶。最初股市有上涨的趋势，但随后会慢慢下跌。\n" +
            "\n" +
            "4、归妹卦占买卖交易\n" +
            "凶。开始的时候，交易双方洽谈顺利，但其实彼此期待不相符，使得交易难以达成。"
        },
        shiye: {
          jixiong: "凶",
          title: "归妹卦有缺乏规范，不受约束之意。本卦的运势表面看起来不错，其实运势巳经下滑，要多注意周围的局势变化，找出应对的方法，这样才能有效地解决问题。",
          info:"1、归妹卦占事业\n" +
            "凶。业运表面看来不错，但实际已经下滑，要多注意周围局势的变化，找出应对的策略。此时运势不佳，心中的期望和实际的状况会相差很大，注意不要欲望太多。\n" +
            "\n" +
            "2、归妹卦占工作变动\n" +
            "凶。想要变动工作，现在不是个好时机，最好等待一段时间。\n" +
            "\n" +
            "3、归妹卦占经商\n" +
            "凶。开始时候感觉顺利，但后续很难达到预期，甚至难以达成。"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "归妹卦占怀孕子女",
          info: "孩子性格易多疑，可成长过程中适当引导。 胎孕方面，生产总体顺利无惊阻，秋季得起卦不佳，易生女孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "本卦启示人们，我们处在社会生活中，必然会受一定的社会规范所约束，虽然这些制度会让人不舒服，但服从、配合是必要的。在学习和工作中，学校和单位的制度都是想让我们有一个好的学习和工作环境，不要试图排斥、对抗，只有服从、配合，你才会生活的自在、轻松。",
          info: "考运不佳，自认为会考得不错，但实际上成绩并不理想。不要把自己的水平估计得太高，要从实际出发，做好充足的准备。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "本卦启示人们，我们处在社会生活中，必然会受一定的社会规范所约束，虽然这些制度会让人不舒服，但服从、配合是必要的。在学习和工作中，学校和单位的制度都是想让我们有一个好的学习和工作环境，不要试图排斥、对抗，只有服从、配合，你才会生活的自在、轻松。",
          info: "求职不顺利，表面看来机会很多，但实际面试时并不顺利。这主要是因为自己心中的标准太高，而实际的工作机会不能满足自己的要求，所以总是不能达成一致。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "归妹卦占官司诉讼",
          info: "你方证据有利事有转机，多次审讯；诉讼牵连人或证比较多，耗费比较大；宜于双方和解；"
        },
        jibing: {
          jixiong: "凶",
          title: "归妹卦占疾病",
          info: "容易有心发热、口干舌燥或毒疮的症状发生；病在胸部，容易有心痛的症状发生；无药可医，药效不显,病危重，极易恶化。"
        },
        shiwu: {
          jixiong: "半吉半凶",
          title: "归妹卦占失物",
          info: "失物虽有被归还的可能，但自身仍有损失。"
        },
        gupiao: {
          jixiong: "凶",
          title: "归妹卦占股市期货",
          info: "最初股市有上涨的趋势，但涨跌不定不定，随后会慢慢下跌，不利。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "归妹卦占出行",
          info: "比较顺利，利于出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "雷火丰",
    hanyi: "雷火丰卦代表丰收之象，凡事积极争取则成功，最利于短期投资理财，感情方面，情投意合则可速成。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "丰卦婚姻：勤于“耕耘”才能获得“丰收”，丰卦象征着大丰收，但丰收必须用人们的努力去换。在爱情或婚姻中，缘分加努力是取得胜利的两大因素，缺一不可。",
          info:  "1、丰卦占恋情\n" +
            "过程不顺利，结果吉利。 你们可能是一见钟情型的，因为你们之间有缘分，似乎没有经过仔细考虑就在一起了。但是你们恋情的发展过程是很不顺利的，就像乌云密布的天空一样。能不能迎来明媚的阳光，就要看你们的努力了。\n" +
            "\n" +
			 "2、丰卦占婚姻\n" +
            "过程不顺利，结果吉利。本卦的爻辞用白天见到星星的例子，来说明过程的不顺利。但你们之间是有一定缘分的，只要能努力争取，就能扫开遮住阳光的乌云，得到属于自己的幸福。"
        },
        caiyun: {
          jixiong: "吉",
          title: "丰卦代表财运较旺，珍惜眼前的成就再接再厉，争取有更大的收获。同时在顺势中要有居安思危的意识，要珍惜当下成果，才能使财运持久，切忌得意忘形、过度投资。",
          info:"1、丰卦占财运\n" +
            "吉。财运俱佳，但忌好大喜功，以免运势由吉转凶而损失钱财。" +
            "\n" +
            "2、丰卦占生意开张\n" +
            "吉。开张大吉，应赶快行动起来。"+
            "\n" +
            "3、丰卦占买卖交易\n" +
            "吉。交易达成能获利，但要注意维持双方的合作关系。"
        },
        shiye: {
          jixiong: "吉",
          title: "丰卦，顾名思义有丰收、丰盛之意。丰卦的运势很强，抓住机遇可大有作为，但一定要居安思危，不可因为鸿运当头就得意忘形，以免乐极生悲。",
          info: "1、丰卦占事业\n" +
            "吉。事业运势很好，要注意把握时机，只要努力，心中的目标就能达成。注意不要因为运势好就得意忘形，在顺境中居安思危，这样才能让好运延续。" +
            "\n" +
            "2、丰卦占工作变动\n" +
            "吉。想要变动工作，现在是个好时机，赶快行动吧。"
        },
        zinv: {
          jixiong: "吉",
          title: "丰卦占怀孕子女",
          info: "孩子勤奋好学、热爱劳动。 胎孕方面，生产总体顺利无惊阻，易生男孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "丰卦占考运",
          info: "吉。考运不错，会取得优异的成绩。注意不要骄傲自满，需要不断地努力，不能太松懈，否则就会乐极生悲。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "丰卦占求职",
          info: "吉。求职会比较顺利，能找到不错的工作。对于工作一定要珍惜，在踏实的工作中不断提升自己，事业之路才能走得宽广而安稳。"
        },
        guansi: {
          jixiong: "吉",
          title: "丰卦占官司诉讼",
          info: "对方有可能想要求和，于你有利；你方证据有利；官司可能会经历两处反复后结案防止对方与证人合谋害你；须防日后纠纷再起。"
        },
        jibing: {
          jixiong: "凶",
          title: "丰卦占疾病",
          info: "病况重，注意肝足疾及血压，心脏等疾。"
        },
        shiwu: {
          jixiong: "吉",
          title: "丰卦占失物",
          info: "尽快找寻，可失而复得。"
        },
        gupiao: {
          jixiong: "吉",
          title: "丰卦占股票期货",
          info: "大升，人气沸腾，达到顶峰，注意及时止盈。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "丰卦占出行",
          info: "比较顺利，利于出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "火山旅",
    hanyi: "旅卦代表旅行、出门、不确定、不安稳之意。事情表付不定、反复无常，属于小凶卦。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "旅卦是一个非常凶险的卦。恋爱中的两个人总是希望时时刻刻都在一起，但是这样其实不好，因为每个人都需要有独立的空间。如果你们处理不好这个关系，就会引起感情的降温，甚至导致最终分手。等感情降温后再弥补，已经为时太晚了。",
          info: "1、旅卦占恋情\n" +
            "十分凶险。说来也很奇怪，你们的感情一开始是非常好的，但是因为长时间守在一起而失去了新鲜感，导致了互相厌倦。恋爱的感觉失去后，两个人的关系迅速降温，最后竟然面临着分手的危险。\n" +
            "\n" +
            "2、旅卦占婚姻\n" +
            "十分凶险，婚姻难成，即使成也不幸福。你们整天在一起，互相太了解了，完全没有刚认识时的感觉。结婚以后更是面临着油盐酱醋等现实问题,从恋爱时的虚幻到生活的现实，两者的反差太大。"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。事情进展不顺利，不得不到处奔波、劳碌。但令人遗憾的是，即使劳苦奔波也往往无收获。这个时候，最好多与他人商议，多听从长辈的建议，不要独断专行。",
          info: "1、旅卦占财运\n" +
            "凶。财运不佳，诸事不顺，小心陷入穷困的境地。\n" +
            "\n" +
            "2、旅卦占生意开张\n" +
            "凶。不宜开张，否则，即使苦心经营，生意也做不长久。\n" +
            "\n" +
            "3、旅卦占股市期货\n" +
            "凶。股市下跌，或者上下起伏不定，获利的希望渺茫。\n" +
            "\n" +
            "4、旅卦占买卖交易\n" +
            "凶。商品交易困难多，劳苦奔波，也没有收获。"
        },
        shiye: {
          jixiong: "凶",
          title: "旅卦的事业、工作运势高低起伏，很不稳定。对于外部局势的变化，要保持平常心，不要急于表现。注意多听取长辈的意见，少独断专行，这样才能逢凶化吉。",
          info: "1、旅卦占事业\n" +
            "凶。事业运势起伏不定，外部局势变化大，状况不易把握。现在只是黎明前的黑暗，不要过于急躁，保持平常心，多听从长辈的建议，遇到事情不要独断专行。\n" +
            "\n" +
            "2、旅卦占工作变动\n" +
            "凶。想要变动工作，现在不是个好时机，一定要三思而行。\n" +
            "\n" +
            "3、旅卦占经商\n" +
            "凶。市场行情犹如旅途一样，意想不到的情况，会随时发生。因此，首先应采取慎重的原则，不要冒险。"
        },
        zinv: {
          jixiong: "凶",
          title: "旅卦占怀孕子女",
          info: "孩子重感情,易与父母缘分薄，聚少离多。 胎孕方面，注意防范意外而动胎气，总体生产无惊阻，易生女孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "火山旅卦，外卦为火，内卦为山。火在上，山在下，山上的火一般是自然形成的野火，只要四周有草，就可以很快向四处蔓延，山上火势不断蔓延，动物逃离居所，就像旅人四处迁徙，奔波劳碌，居无定所，需要具备很强的适应能力，方可生存下来。旅卦象征着旅行或外出，又表示两个人的分离。寓意有奔波、劳碌的状况发生。",
          info: "考运不好，成绩不理想。读书时不要被太多事情所烦扰，静下心来“一心只读圣贤书”，成绩的提升才有保证。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "火山旅卦，外卦为火，内卦为山。火在上，山在下，山上的火一般是自然形成的野火，只要四周有草，就可以很快向四处蔓延，山上火势不断蔓延，动物逃离居所，就像旅人四处迁徙，奔波劳碌，居无定所，需要具备很强的适应能力，方可生存下来。旅卦象征着旅行或外出，又表示两个人的分离。寓意有奔波、劳碌的状况发生。",
          info: "求职不顺利，即使辛苦地准备，也找不到满意的工作。这主要是因为竞争太激烈，职位太少，而自身又缺乏贵人相助。这是需要静待时机，同时学习专业的知识来提升自己。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "旅卦占官司诉讼",
          info: "此卦显示易对方有理；此事无官主事；官司有救，适于和解,宜速战速决。"
        },
        jibing: {
          jixiong: "凶",
          title: "旅卦占疾病",
          info: "病情变化不定，宜速就医。"
        },
        shiwu: {
          jixiong: "半吉",
          title: "旅卦占失物",
          info: "尽快去找，应可寻回，失物似在屋舍之外，留意镜子之类物体，可提供线索。"
        },
        gupiao: {
          jixiong: "凶",
          title: "旅卦占股市期货",
          info: "股市下跌，或者上下起伏不定，获利的希望渺茫。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "旅卦占出行",
          info: "顺利适合出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "巽为风",
    hanyi: "巽为风卦不稳定的意思，静中有动、动中有静，好坏不定之象。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "巽卦告诉人们，恋爱不是随便就可以谈得好的，它需要你们具有一种“婚恋意识”，也就是一种为恋爱而准备的心态。从一个人独处到两个人共处；再从恋爱到结婚，中间会发生很多变化，你们必须从心态上去适应这个过程。",
          info: "1、巽卦占恋情\n" +
            "比较顺利。恋愛是一种生活，也是一种心态，只要具有恋愛的意识，就可以把它变得非常美好。因为你们在心态上已经做好了准备，所以你们可以在恋爱过程中享受到一种特有的幸福。\n" +
            "\n" +
            "2、巽卦占婚姻\n" +
            "可以成功，过程有波折。从恋爱到婚姻的转变常常让很多人措手不及,还没等明白过来怎么回事，两个人的关系已经发生了质的变化。但是只要及时调整心态，就可以实现从恋爱到婚姻的顺利过渡。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。俗话说“和气生财”，在与人交往中，要温和，并学会换位思考，善于为他人着想，这样能大大提升自己的运势。当运势不够强时，良好的人际关系也能为你的生意带来意想不到的收益。财运较旺，但做事要顺应时势的变化，或顺应人意，才能赚到钱。\n",
          info: "1、巽卦占生意开张\n" +
            "吉。开张之事不能急躁，最好顺其自然。\n" +
            "\n" +
            "2、巽卦占股市期货\n" +
            "吉。小利益可成,要想获得大利益，还需等待时机。找亲朋好友一起投资，获利的希望更大。\n" +
            "\n" +
            "3、巽卦占买卖交易\n" +
            "吉。信守承诺，重视人和，才能顺利达成交易。"
        },
        shiye: {
          jixiong: "吉",
          title: "巽卦显示目前有成功的希望，但还不到最佳状态，要把握时机、继续努力。注意与人相处要谦和有礼，同时要跟对有才能的人，这样成功的机会才更大。",
          info: "1、巽卦占事业\n" +
            "吉。目前事业运势还不错，但还不到最佳状态，要继续努力，不可过于松懈。对于到来的时机，要及时把握，不可优柔寡断，以免错失良机。\n" +
            "\n" +
            "2、巽卦占工作变动\n" +
            "吉。如果想要变动工作，要提前做好准备，不可仓促行事。\n" +
            "\n" +
            "3、巽卦占经商\n" +
            "半吉。市场竞争激烈，风险大。商业活动务必小心谨慎，遵守商业道德，以谦逊的态度对待同行和顾客，及至竞争对手，必定可以取得利益。\n"
        },
        zinv: {
          jixiong: "半吉半凶",
          title: "巽卦占怀孕子女",
          info: "孩子文明礼貌，尊敬师长，孝顺父母。 胎孕方面，卦有障碍、虚惊之象，宜大医院孕产，易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "本卦启示人们，顺从、温和的态度，是处理问题的重要手段。要学会顺应时势的变化去做事，该顺从的时候就顺从，良好的人际关系也能助你人生之路的顺畅。在学习与工作中，要学会与人和谐相处，多听从他人的意见与建议，不必过于坚持己见。",
          info: "成绩属于中等偏上，已经不错了，如果能再接再厉，就能取得更好的成绩。注意与同学要保持良好的关系，多与老师和同学沟通，多借鉴学习经验。"
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "本卦启示人们，顺从、温和的态度，是处理问题的重要手段。要学会顺应时势的变化去做事，该顺从的时候就顺从，良好的人际关系也能助你人生之路的顺畅。在学习与工作中，要学会与人和谐相处，多听从他人的意见与建议，不必过于坚持己见。",
          info: "求职运一般，好的工作机会需要自己的努力争取，所以一定要在面试前做好充足的准备，另外注意在闲暇时间里多学学专业技能，这样也能提高自己的竞争力。"
        },
        guansi: {
          jixiong: "凶",
          title: "巽卦占官司诉讼",
          info: "对方态度强势，这次诉讼你占劣势；官方不认可你的说法，打官司消耗很大；官司剑拔弩张，会较为迅速地判决。"
        },
        jibing: {
          jixiong: "凶",
          title: "巽卦占疾病",
          info: "久病则凶，且病情变化多端。"
        },
        shiwu: {
          jixiong: "凶",
          title: "巽卦占失物",
          info: "遣失在远处，不能寻回。"
        },
        gupiao: {
          jixiong: "吉",
          title: "巽卦占股市期货",
          info: "小利益可成,要想获得大利益，还需等待时机。市场象一阵风，风过则无，注意逃过倒V型。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "巽卦占出行",
          info: "比较顺利，适合出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "兑为泽",
    hanyi: "使他人喜悦，自己也会喜悦，这样可以促使人际关系和谐，这是顺天应人的做法。但与人和悦，首先应当动机纯正、明辨是非、光明正大，而不能阿谀谄媚，其次应该内刚外柔，坚持原则。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "兑卦表示两个人互相帮助而得到快乐。在爱情或婚姻中，两个人要用平和的态度，互相体贴、互相关爱、互相沟通，使自己的爱情或婚姻生活变得更加美好。",
          info: "1、兑卦占恋情\n" +
            "大吉大利，爱情甜蜜！ 在六十四卦中，兑卦是最为吉利的卦之一，它象征着快乐、顺利。如果得到了兑卦，你们的恋情就会一帆风顺，即使有小的波折也会很快过去。在恋爱过程中，只需要享受快乐就可以了。\n" +
            "\n" +
            "2、兑卦占婚姻\n" +
            "大吉大利，婚姻易成！经过了恋爱期间的锻炼，你们已经学会了如何相处，所以能把婚姻生活经营得很“红火”。顺利的结婚过程，平静的婚姻生活，使你们成为众人羡慕的对象。你们所能做的，只有珍惜眼前的幸福了。"
        },
        caiyun: {
          jixiong: "吉",
          title: "兑卦有喜悦、分享的意思。兑卦显示此时运势顺畅，是投资或交易的好时机，但不要因为财运顺畅就掉以轻心，以免好运丧失。",
          info: "1、兑卦占财运\n" +
            "吉。财运俱佳，赚钱较多，会有令自己满意的收入。\n" +
            "\n" +
            "2、兑卦占生意开张\n" +
            "吉。开张大吉，生意兴隆。\n" +
            "\n" +
            "3、兑卦占股市期货\n" +
            "吉。股市上升，但未来可能会有下跌的趋势。" +
			"\n" +
            "4、兑卦占买卖交易\n" +
            "吉。商品交易能够获利，但不能就此松懈，还应不断努力才行。"
        },
        shiye: {
          jixiong: "吉",
          title: "本卦事业、工作运势平稳，但切忌得意忘形，说话行事要小心谨慎，以防祸从口出。对于当前的好运，要有居安思危的意识，不可过度沉迷。",
          info:"1、兑卦占事业\n" +
            "吉。事业发展顺利，万事亨通，心中的目标基本都可实现。但是要时刻有一个警钟，不可过度沉迷于一时的成功。\n" +
            "\n" +
            "2、兑卦占工作变动\n" +
            "吉。想要变动工作，现在可以行动了，一定要抓住时机。\n" +
            "\n" +
            "3、兑卦占经商\n" +
            "吉。很有利。可以取得多种渠道的支持。但在顺利时切莫忘记谨慎小心的原则，尤其警惕上小人的当。"
        },
        zinv: {
          jixiong: "吉",
          title: "兑卦占怀孕子女",
          info: "孩子天生乐观开朗，与家人和睦。 胎孕方面，生产无惊阻，比较平安顺利。易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "兑卦，兑为泽，兑性悦，上下皆悦，为兑。故兑象征欣悦。刚正不失外悦，柔顺不失内刚，内外刚柔兼济，不谄媚，不暴戾，亨通畅达。但须动机纯正，使人喜欢才会有利。",
          info: "考运不错，成绩很好。注意要坚持努力，不可因一时的好成绩而得意忘形。注意平时与同学的相互交流，大家的沟通，对成绩的提高也有着很大帮助。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "兑卦，兑为泽，兑性悦，上下皆悦，为兑。故兑象征欣悦。刚正不失外悦，柔顺不失内刚，内外刚柔兼济，不谄媚，不暴戾，亨通畅达。但须动机纯正，使人喜欢才会有利。",
          info: "求职运不错，可以找到一份不错的工作。这主要归功于自己平时的努力和贵人的相助。注意不要因为找到了好工作就懈怠，只有勤奋的工作才能保证有一个稳定而美好的工作。"
        },
        guansi: {
          jixiong: "吉",
          title: "兑卦占官司诉讼",
          info: "你方证据有利；官司剑拔弩张，会较为迅速地判决。"
        },
        jibing: {
          jixiong: "半吉半凶",
          title: "兑卦占疾病",
          info: "如果你是最近得的病，那么很快就能好转；如果这个病已经有几个月了，那么有加重的可能；病是内症，晚上加重;久病则凶。"
        },
        shiwu: {
          jixiong: "吉",
          title: "兑卦占失物",
          info: "遣失物似为金属或金钱，有望失而得，但是迟一点。且多数已损毁或损失。"
        },
        gupiao: {
          jixiong: "吉",
          title: "兑卦占股市期货",
          info: "股市震荡上升，但未来可能会有下跌的趋势，小心偏线。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "兑卦占出行",
          info: "比较顺利，适合出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "风水涣",
    hanyi: "涣卦为小吉：亨通，离散解消，灾害涣散。得此卦者初始不顺，但终究解脱困难，凡事需谨慎。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "涣卦象征着涣散、分散。爱情或婚姻都是以物质为基础的，没有物质基础的感情是无本之木、无源之水，所以不能让感情耽误了事业。",
          info: "1、涣卦占恋情\n" +
            "比较凶险。 凶险并不代表你们的感情不好，恰恰相反，你们的感情一开始特别好，以至于你们一直沉浸在两个人的小世界中不能自拔。一旦面对现实问题，你们就会发现，那种虚幻的感情其实是不可靠的。\n" +
            "\n" +
            "2、涣卦占婚姻\n" +
            "比较凶险。  如果说恋爱过程中对现实要求较低的话，那么婚姻就不得不面对油盐酱醋等事物了。没有物质空谈感情的婚姻必定是幸福不了的，你们属于理想主义者，认为感情胜于一切，可以克服一切困难，但现实却没这么简单。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。观念不保守，处事灵活，会顺利解决当下的问题。同时很重要的一点是，做事一定要持之以恒，努力前进，这样才不会半途而废，到头来只做无用功。",
          info: "1、涣卦占财运\n" +
            "吉。最初会有苦难和挫折，但其后财运会越来越旺\n" +
            "\n" +
            "2、涣卦占生意开张\n" +
            "吉。开张大吉，但做事还需谨慎，有好的人缘，会提升个人运势。\n" +
            "\n" +
            "3、涣卦占股市期货\n" +
            "吉。股市下跌，但随后会逐渐上涨。\n" +
            "\n" +
            "4、涣卦占买卖交易\n" +
            "吉。商品交易开始会遇到阻碍，但只要懂得察言观色，依据对方的期待调整策略，就会有大的突破。"
        },
        shiye: {
          jixiong: "吉",
          title: "涣卦的运势开始上升，是转机之时，但此时也是运势起伏不定、难以掌握之时，要根据局势的变化，及时地作出决断，必能开创新机。",
          info: "1、涣卦占事业\n" +
            "吉。事业发展由低迷开始好转，虽然幵始有了转机，但转机之时也是运势起伏不定之时，要注意顺应局势的发展。在为人处事上要小心谨慎，多求助于有实力的人，这样会有助于事业的发展。\n" +
            "\n" +
            "2、涣卦占工作变动\n" +
            "吉。想要变动工作，现在是个不错的时机，最好是借助一些人际关系。\n" +
            "\n" +
            "3、涣卦占经商\n" +
            "半吉。市场状况混乱，方向不明。适当的冒险是可以的,争取有实力者的合作和支援也是完全有必要的。"
        },
        zinv: {
          jixiong: "吉",
          title: "涣卦占怀孕子女",
          info: "孩子事业心比较强，孝敬父母。 胎孕方面，生产无惊阻，比较平安顺利。易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "涣卦，坎为水，巽为风。风行水上，水波离散，为涣。涣象征涣散。有涣发离散的意思。处“涣”之时，形散而神聚。散聚相依，必然亨通顺利。此时，君王应以至诚到宗庙祈祷，获得神的保佑，聚合人力来排险济难。",
          info: "成绩还不错，属于中上水平。注意改变一下原来的学习方式，同学之间多交流一下，这样成绩会有更大地提升。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "涣卦，坎为水，巽为风。风行水上，水波离散，为涣。涣象征涣散。有涣发离散的意思。处“涣”之时，形散而神聚。散聚相依，必然亨通顺利。此时，君王应以至诚到宗庙祈祷，获得神的保佑，聚合人力来排险济难。",
          info: "求职还比较顺利，注意自身要努力一些，不要总是半途而废，这样找到好工作的机会会更大一些。在求职过程中要随机应变，不要让人觉得头脑太死板。"
        },
        guansi: {
          jixiong: "凶",
          title: "涣卦占官司诉讼",
          info: "本次诉讼易遇无官主事；并且官方可能不认可你的说法，打官司消耗很大。"
        },
        jibing: {
          jixiong: "凶",
          title: "涣卦占疾病",
          info: "易因食而病，胃口减少或因口舌争斗而起病；易茶饭不思，注意血液、内分泌。"
        },
        shiwu: {
          jixiong: "凶",
          title: "涣卦占失物",
          info: "不能寻回。"
        },
        gupiao: {
          jixiong: "凶",
          title: "涣卦占股市期货",
          info: "股市易出现下跌，阴跌，人气涣散，人心不聚。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "涣卦占出行",
          info: "总体顺利，适合外出。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "水泽节",
    hanyi: "节卦强调的是人要有节制。人若是不懂得节制，会变得放纵、任性，会做出过分或越轨之事，这会远离幸福与成功。只有谨慎、适度和机警，能适度地把握和控制自己，自觉地培养节制的习惯，清理不必要的开支，不要被欲望牵引，不要成为欲望的奴隶。当然，过分地节制、将自己束缚得牢牢的，也会失去生命的活力，像草木枯槁了一样，这样也是不合适的。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "半吉半凶",
          title: "在爱情或婚姻上，要认清自己的实际能力，不能追求各方面超过自己太多的人。这种人即使能追求成功，婚后的生活也不会有多幸福。这里说的能力不光是经济能力，还包括文化水平等方面。",
          info: "1、节卦占恋情\n" +
            "半吉半凶。 在开始恋爱的时候，总是希望找一个各方面都优秀的人，但是目光过高就会造成失败。在经过了一些失败之后，开始降低目标，寻找最适合你的人，并如愿以偿。" +
            "\n" +
            "2、节卦占婚姻\n" +
            "半吉半凶。表示在婚姻生活中，不要对对方要求和期望过高，否则会出现婚姻危机，降低对方的预期，婚姻还是可以继续的。"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，节卦为凶，说明财运不济。平时做事不可过度，懂得自我调节，才能慢慢提升财运，不加节制会破财。欲望之门大开，毫无节制，就等于自掘坟墓，财运才会跟着消失。",
          info: "1、节卦占财运\n" +
            "凶。财运不济，应改变理财方式，花钱消费不可铺张浪费，注意节俭，才会慢慢积橫起钱财。" +
            "\n" +
            "2、节卦占生意开张\n" +
            "凶。眼下不宜开张，最好再等待一段时间。"+
            "\n" +
            "3、节卦占买卖交易\n" +
            "凶。不宜过分贪图钱财，才有可能会在交易中获利。"
        },
        shiye: {
          jixiong: "凶",
          title: "节卦显示事业、工作运势受阻，在此阶段，凡事都要安守本分，不可欲求过多。不急躁、不贸然行事，才不会招致灾祸。",
          info:  "1、节卦占事业\n" +
            "凶。事业运势不好，现在局势混乱，做事处处受阻。在人际、工作等方面都要小心谨慎，不可贸然行事，以免让自己陷入麻烦之中。" +
            "\n" +
            "2、节卦占生意开张\n" +
            "凶。想要变动工作，现在不是个好时机，要三思而行。"
        },
        zinv: {
          jixiong: "凶",
          title: "节卦占怀孕子女",
          info: "孩子从小懂得勤俭节约。 胎孕方面，卦有虚惊甚至流产之凶象，求佛及家神则安。易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "节卦占学业考运",
          info: "凶。成绩不太好，要学会克制自己，好成绩的取得和辛勤地努力是分不开的，需要继续下工夫学习，成绩才会提高。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "节卦占求职",
          info: "凶。求职运不太好，理想的工作不容易找到。现在的时机不对。不如退而求其次，先找个一般的工作，等时机来了，再换满意的工作。"
        },
        guansi: {
          jixiong: "吉",
          title: "节卦占官司诉讼",
          info: "你方气盛，压制对方；你方见理；官司可能会经历两处反复后结案。"
        },
        jibing: {
          jixiong: "凶",
          title: "节卦占疾病",
          info: "注意泌尿及消化系病变，宜速就医。"
        },
        shiwu: {
          jixiong: "凶",
          title: "节卦占失物",
          info: "不能寻回。"
        },
        gupiao: {
          jixiong: "半吉半凶",
          title: "节卦占股票期货",
          info: "横盘，升跌有止，多空变换，无益无害。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "节卦占出行",
          info: "外出顺利，利于出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "风泽中孚",
    hanyi: "此卦为小吉。风泽中孚卦代表诚信，因此凡事诚信对待为吉利，反之心不诚则凶。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "中孚卦婚姻：心诚则灵，幸福早晚会来到。中孚卦的含义是诚信。在爱情或婚姻中，“心诚则灵”的法则是一个亘古不变的真理，用自己的真诚之心感化对方，幸福早晚会来到。",
          info: "1、中孚卦占恋情\n" +
            "十分吉利！ 只要有一颗真诚的心，就能打动对方，赢得对方的青睐。只要你们两个人的心在一起，无论遇到什么困难，你们的恋爱都是幸福的。\n" +
            "\n" +
            "2、中孚卦占婚姻\n" +
            "比较吉利。经过了恋爱期后，你们的默契程度大大提高。家庭生活本来是比较单调的，但是只要用心经营，再单调的生活也可以变得丰富多彩起来。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。心中有诚信，能够以诚待人，必然会得到他人的支持和帮助，进而推动个人事业的发展。所以平时要注意好好经营自己的人际关系，多与人沟通，多参考他人的意见。",
          info: "1、中孚卦占财运\n" +
		     "吉。做事讲信用，财运俱佳。\n" +
            "\n" +
            "2、中孚卦占生意开张\n" +
            "吉。开张大吉，日后诚信经营，定会赢利。\n" +
            "\n" +
            "3、中孚卦占股市期货\n" +
            "吉。股市上涨，投资策略要务实，与他人合作投资，能获大利。\n" +
            "\n" +
            "4、中孚卦占买卖交易\n" +
            "吉。交易双方秉承诚信的原则，友好合作，最终交易成功，并获得可观的利润。"
        },
        shiye: {
          jixiong: "吉",
          title: "本卦的运势好坏完全取决于自己人际关系的好坏。如果平时处事能以诚相待，就会得到贵人的协助，有助于事业的发展；而如果做事心术不正，为人狡诈，就会有损事业的发展。",
          info: "1、中孚卦占事业\n" +
		     "吉。事业运势的好坏与人际关系的好坏有着直接的关系，如果能以真诚之心对待周围的朋友，就能得到他人的帮助，事业也能很好的开展；如果为人狡诈、心术不正，就会让周围的人远离，必然对事业不利，所以要注意维护周围的人际关系。\n" +
            "\n" +
            "2、中孚卦占工作变动\n" +
            "吉。想要变动工作的朋友，现在可以行动了，但不要过于急躁，需谨慎行事。\n" 
        },
        zinv: {
          jixiong: "吉",
          title: "中孚卦占怀孕子女",
          info: "孩子非常聪明伶俐,孝敬父母。 胎孕方面，生产无惊阻，比较平安顺利。易生女孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "中孚卦占考运",
          info: "吉。考运很好，会取得不错的成绩。如果能注重与同学的相互沟通、交流，成绩会有更大的进步。"
        },
        qiuzhi: {
          jixiong: "吉",
          title: "中孚卦占求职",
          info: "吉。求职比较顺利，可以得到贵人的相助。注意在求职过程中礼貌谦和、以诚待人，同时不要眼光过高。"
        },
        guansi: {
          jixiong: "凶",
          title: "中孚卦占官司诉讼",
          info: "防官方助他不利于你；事有转机，易多次审讯；防对方与证人合谋害你；官方可能会不认可你的说法，打官司消耗很大。"
        },
        jibing: {
          jixiong: "凶",
          title: "中孚卦占疾病",
          info: "容易有感冒风寒、四肢不协、头疼发热的症状发生;防腹痛或腹泻；病在胸部，心痒嘈杂；目前无药可医或药效不显，易茶饭不思，没有胃口。"
        },
        shiwu: {
          jixiong: "吉",
          title: "中孚卦占失物",
          info: "可失而复得，但需要一段时间。"
        },
        gupiao: {
          jixiong: "吉",
          title: "中孚卦占股市期货",
          info: "股市上涨，投资策略要务实，与他人合作投资，能获大利。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "中孚卦占出行",
          info: "顺利，利于出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "雷山小过",
    hanyi: "凶卦： 阴顺阳困，柔软用事；谨慎自持，不宜急进。得此卦者，诸事不利，宜行小事，不宜成大事，更防因自身的过失惹来是非争讼。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "凶",
          title: "在爱情或婚姻中，经常出现“不是冤家不聚头”的情况，两个人可能并不合适，但缘分让你们走到一起了。如果两个人之间的矛盾不是太严重的话，不妨互相忍让一下。如果两个人之间的矛盾完全不可调和，就要果断分手。",
          info: "1、小过卦占恋情\n" +
            "比较凶险。 你们两个人属于缘分严重不足的情况，性格不和，生活习惯也难以协调在一起，所以相处的过程充满了挫折。两个人之间的矛盾较多，但算不上不可调和，所以分手也不是，继续也不是。具体应该怎样做,要根据实际情况来确定。\n" +
            "\n" +
            "2、小过卦占婚姻运势\n" +
            "十分凶险。 你们两个人基本上是难以在一起的，即使勉强在一起了，也会争吵不断。小过卦并没有提供分与合的具体建议，只是说让你们选择好方向，把握好做事的力度，既不能过度，又不能不足。"
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，得到该卦，为凶，说明财运不济。做事要谨慎，小心被绊脚石绊倒，即使错误不大，也要重视。此时不宜贸然有所举动，小的财运有，大的财运还需要等待。注意平时不要多管闲事，避免与人争吵，发生争端，以免带来损失。",
          info: "1、小过卦占财运\n" +
            "凶。财运不佳，平时做事要谨慎，特别是要把不用的钱财存好，以免有损耗。\n" +
            "\n" +
            "2、小过卦占生意开张\n" +
            "凶。不宜开张，否则会因过失而失败。\n" +
            "\n" +
            "3、小过卦占股市期货\n" +
            "凶。投资策略有失误的地方，股市下跌，不能获利。\n" +
            "\n" +
            "4、小过卦占买卖交易\n" +
            "凶。急于成交，以至于利润估算错误，结果亏本经营。"
        },
        shiye: {
          jixiong: "凶",
          title: "小过卦的运势不太好，中间常会有小麻烦、小错误发生。因为运势不太好，所以做事更要三思而行，不可太过激。与人相处要低调，避免纷争。",
          info: "1、小过卦占事业\n" +
            "凶。事业运势不佳，经常会有小麻烦发生。注意做事要量力而行，不要太过头，安守本分才不会惹祸上身。注意多向长辈请教，不可独断专行。\n" +
            "\n" +
            "2、小过卦占工作变动\n" +
            "凶。建议想要变动工作的朋友，现在还是不要动为好。\n" +
            "\n" +
            "3、小过卦占经商\n" +
            "凶。对市场行情不十分掌握，可先稍试探一下，随即收敛行为。否则会导致危险。不应大规模行动。"
        },
        zinv: {
          jixiong: "凶",
          title: "小过卦占怀孕子女",
          info: "孩子性格坚强,但易兄弟不和而操劳。 胎孕方面，卦有虚惊之凶象，宜求香火保佑。易生女孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "雷山小过卦，外卦为雷，内卦为山。雷在上、山在下，山上的雷声比大地上的雷声更强烈，当雷声传到平地时，响声已不再吓人，所以小过卦象征着过分，但过分得并不严重。",
          info: "成绩不理想，主要是因为太高估自己了，对考试准备不充分，再加上考试时马虎大意，使本该答对的题目最后答错了，所以要注意调整自己的心态。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "雷山小过卦，外卦为雷，内卦为山。雷在上、山在下，山上的雷声比大地上的雷声更强烈，当雷声传到平地时，响声已不再吓人，所以小过卦象征着过分，但过分得并不严重。",
          info: "求职不顺利，你对工作的期望太高了，而你的实力又达不到，所以导致面试时频频受阻。这时最好调整一下自己的心态，先找一个一般的工作，等自身能力提髙了再换工作也不迟。"
        },
        guansi: {
          jixiong: "半吉半凶",
          title: "小过卦占官司诉讼",
          info: "事有转机，多次审讯，不宜各走极端，宜多沟通和解。"
        },
        jibing: {
          jixiong: "凶",
          title: "小过卦占疾病",
          info: "病情有恶化之象，但及时诊治则吉"
        },
        shiwu: {
          jixiong: "凶",
          title: "小过卦占失物",
          info: "不能寻回。"
        },
        gupiao: {
          jixiong: "凶",
          title: "小过卦占股市期货",
          info: "投资策略有失误的地方，窄幅震荡，不可大玩，不能获利。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "凶",
          title: "小过卦占出行",
          info: "出行防灾祸是非，谨慎出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "水火既济",
    hanyi: "水火既济卦寓意为不服当时的努力事情已经成功。上卦水、下卦为火，水势压倒火势，救火大功告成的象义。",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "既济卦是一个非常吉利的卦，因为它指出了事情的最后结局是成功的。无论在恋爱过程中遇到了多少风风雨雨，你们最终一定可以走入婚姻的殿堂。结婚之后的生活，也是和和美美，非常幸福。",
          info: "1、既济卦占恋情\n" +
            "大吉大利！  你们的恋情非常顺利，可以用“一帆风顺”来形容。但要注意“物极必反”，谨防在欢乐之中出现令人不愉快的事情。你们在一起就是为了走向婚姻的殿堂，甜蜜令人羨慕。\n" +
			 "\n" +
			  "2、既济卦占婚姻\n" +
            "大吉大利！  在走完恋爱之路后，会如愿以偿走入婚姻的殿堂。婚后的生活并不是十全十美的，有小小的遗憾，但已经比大多数人强很多了。只要用心去感受，你们的婚姻生活会是幸福的！" 
        },
        caiyun: {
          jixiong: "凶",
          title: "占财运，既济卦为凶，说明财运不济。在运势由盛转衰的时刻，不可丧失斗志，顽强努力才会扭转乾坤。同时也不可过于乐观，行事要有节制，三思而后行，这样才不致遭受损失。",
          info: "1、既济卦占财运\n" +
            "凶。最初财运不错，但其后运势会下降，最好谨慎一些，以免破财。" +
            "\n" +
            "2、既济卦占生意开张\n" +
            "凶。暂时不宜开张，最好三思而后行。"+
            "\n" +
            "3、既济卦占买卖交易\n" +
            "凶。最初洽谈顺利，但慢慢发现彼此期待差距很大，交易很难顺利达成。"
        },
        shiye: {
          jixiong: "凶",
          title: "既济卦的运势由盛转衷，开始走下坡路，过去的目标都巳完成，表面前途一片大好，但实际巳到强弩之末。此时不可欲求过高，做事要三思而行。",
          info:"1、既济卦占事业\n" +
            "凶。事业运势开始由强转衰，过去的运势太强了，未来似乎一片美好，但其实现在已是强弩之末。此时不要再有太高的想法，宜清心寡欲、明哲保身。" +
            "\n" +
            "2、既济卦占工作变动\n" +
            "凶。想要变动工作，要三思而行。"+
            "\n" +
            "3、既济卦占经商\n" +
            "凶。预示着危机的随时出现，务必小心在意，事未到，先预防。同时，认真观察市场的变化，随时转向，开拓新市场。"
        },
        zinv: {
          jixiong: "凶",
          title: "既济卦占怀孕子女",
          info: "孩子聪明能干，需防长大叛逆心理，宜加强沟通疏导。 胎孕方面，母子不安,卦有虚惊之象。易生男孩。"
        },
        xueye: {
          jixiong: "凶",
          title: "既济卦占考运",
          info: "凶。成绩不理想，与之前相比出现下滑。现在一定要敲响警钟了，不然成绩会更加糟糕。"
        },
        qiuzhi: {
          jixiong: "凶",
          title: "既济卦占求职",
          info: "凶。求职不顺利，时机不太对。看似是机会但最后也容易失败。"
        },
        guansi: {
          jixiong: "凶",
          title: "既济卦占官司诉讼",
          info: "官司可能会经历两处反复后结案；防对方与证人合谋害你；官方不认可你的说法，打官司消耗很大。"

        },
        jibing: {
          jixiong: "半吉半凶",
          title: "既济卦占疾病",
          info: "短期虽有好转，但好景不常。"
        },
        shiwu: {
          jixiong: "吉",
          title: "既济卦占失物",
          info: "应可寻回。"
        },
        gupiao: {
          jixiong: "吉",
          title: "既济卦占股票期货",
          info: "易大升，如遇条件成熟，则会达到最高点，注意及时止盈。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "既济卦占出行",
          info: "利于出行，注意做好周全准备。"
        },
        xiaoxi: {},
        qita: {}

      }

  }, {
    zhuguaName: "火水未济",
    hanyi: "从卦上卦为火、下卦为水，表示：火势压倒水势，救火大功未成，故称未济。事情未能达成目的，事情波折坎坷之意。 　",
    yunShiTypes:
      {
        hunyin: {
          jixiong: "吉",
          title: "未济卦象征着事情未完成，或者说是事情的开端。结婚是恋爱的终点，同时也是婚姻生活的开始，请用爱心去迎接婚姻生活吧！",
          info: "1、未济卦占恋情\n" +
            "大吉大利！  恋情虽然不是一帆风顺，却有一个吉祥如意的结果。虽然很多人说过程比结果更重要，但是在现实中结果往往影响更大。能走向婚姻殿堂的爱情才是最吉祥如意的爱情。\n" +
            "\n" +
            "2、未济卦占婚姻\n" +
            "大吉大利！  正如爻辞所说，你们的婚姻是非常顺利的，所以对婚姻之事不必太操心，婚后的生活才应该是你们关注的重点。婚后的生活虽然不像恋爱时那样浪漫，却也十分温暖，甜甜蜜蜜。"
        },
        caiyun: {
          jixiong: "吉",
          title: "占财运，得到该卦，为吉，说明财运较旺。在事情不顺的时候，不要灰心，坚持一段时间，就会有转机出现。面对不可知的未来，人难免会感到不安，不要害怕改变，改变的同时就会出现新的契机，不改变就永远没有机会。",
          info: "1、未济卦占财运\n" +
            "吉。财运有逐渐转好的趋势。\n" +
            "\n" +
            "2、未济卦占生意开张\n" +
            "吉。开张大吉，但日后经营需付出一定的努力，才会赢利。\n" +
            "\n" +
            "3、未济卦占股市期货\n" +
            "吉。股市最初下跌，但其后会出现上涨的趋势，尤其是尾盘较佳。\n" +
            "\n" +
            "4、未济卦占买卖交易\n" +
            "吉。初期不顺畅，但只要坚持努力，最后就能成功。"
        },
        shiye: {
          jixiong: "吉",
          title: "未济卦的运势由逆转顺，虽然此时还有诸多的不如意，但事业运势巳经由谷底渐渐上升，黎明就要来临。此时如果耐心等待，坚持努力，困难就会过去，事业会有新的发展。",
          info: "1、未济卦占事业\n" +
            "吉。事业运势开始好转，虽然还会有一些阻碍与困难，但这些都即将过去，好运即将到来。一定要坚持下去，能度过眼前的困难，就能看到好运来临的那一天。\n" +
            "\n" +
            "2、未济卦占工作变动\n" +
            "吉。想要变动工作，现在是个好时机，但也要通过一定的努力。\n" +
            "\n" +
            "3、未济卦占经商\n" +
            "半吉。市场处于大变动的前夕，前景如何尚不明显。这是最为艰苦的时期，头脑必冷静，不可行动过度，适度节制，决定行动。"
        },
        zinv: {
          jixiong: "吉",
          title: "未济卦占怀孕子女",
          info: "孩子有远大理想，长大有所作为。 胎孕方面，生产无惊阻，比较平安顺利。易生男孩。"
        },
        xueye: {
          jixiong: "吉",
          title: "未济卦，坎为水，离为火。火在水上，难以济物，为未济。未济象征事未成。本卦六交均失正，有“事未成”之象。但阳刚阴柔能相应，充满着发展的可能性。未济有可济之理，因而亨通。但若处事不谨慎，则没有什么利益。",
          info: "成绩还不错，属于中上水平。虽然其他同学的实力也很强，竞争很激烈，但你只要认真准备，踏踏实实地复习学到的知识，成绩就错不了。"
        },
        qiuzhi: {
          jixiong: "半吉半凶",
          title: "未济卦，坎为水，离为火。火在水上，难以济物，为未济。未济象征事未成。本卦六交均失正，有“事未成”之象。但阳刚阴柔能相应，充满着发展的可能性。未济有可济之理，因而亨通。但若处事不谨慎，则没有什么利益。",
          info: "求职运还可以，虽然在一段时间里不能找到满意的工作，但是只要做好充足地准备，耐心地寻找，就一定可以找到理想的工作。"
        },
        guansi: {
          jixiong: "凶",
          title: "未济卦占官司诉讼",
          info: "易遇到无官主事的情况；官方可能会不认可你的说法，打官司消耗很大；最好周全处理，须防日后纠纷再起。"
        },
        jibing: {
          jixiong: "凶",
          title: "未济卦占疾病",
          info: "病情不稳定，注意心肾不交、失眠、血液等病。"
        },
        shiwu: {
          jixiong: "凶",
          title: "未济卦占失物",
          info: "不能寻回。"
        },
        gupiao: {
          jixiong: "吉",
          title: "未济卦占股市期货",
          info: "股市最初下跌，但其后会出现上涨的趋势，尤其是尾盘较佳。"
        },
        jiazai: {},
        chuxing: {
          jixiong: "吉",
          title: "未济卦占出行",
          info: "总体出行顺利，利于出行。"
        },
        xiaoxi: {},
        qita: {}

      }

  }
];



const getGuaCiJieYiMoreByName = (name) => {
    if (name.length <= 0) {
        return null;
    }
    for (let i = 0; i < guaCiJieYiMoreData.length; i++) {
        if (guaCiJieYiMoreData[i].zhuguaName === name) {
            return guaCiJieYiMoreData[i];
        }
    }
    return null;
};

